docs/manual.org
#+TITLE: GNU Artanis web-framework Manual
#+AUTHOR: Mu Lei known as NalaGinrut
#+EMAIL: mulei@gnu.org
#+LANGUAGE: en
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="manual.css" />
#+STARTUP: hidestar latexpreview

#+TEXINFO_FILENAME: artanis.texi
#+TEXINFO_HEADER: @syncodeindex pg cp
#+TEXINFO_PRINTED_TITLE: GNU Artanis

#+OPTIONS: H:3 toc:t \n:nil ::t |:t ^:nil -:t f:t *:t tex:t d:(HIDE) tags:not-in-toc
#+OPTIONS: latex:t
#+OPTIONS: tex:verbatim
#+OPTIONS: broken-links:mark somewhere

* Introduction

#+begin_src nil
Copyright (C)  2024  Mu Lei known as NalaGinrut.
Permission is granted to copy, distribute and/or modify this document
under the terms of the GNU Free Documentation License, Version 1.3
or any later version published by the Free Software Foundation;
with no Invariant Sections, no Front-Cover Texts, and no Back-Cover
Texts.  A copy of the license is included in the section entitled 'GNU
Free Documentation License'.
#+end_src

This manual documents GNU Artanis, a fast, monolithithic web framework of Scheme.

A [[http://en.wikipedia.org/wiki/Web_application_framework][web application framework (WAF)]] is a software framework that is designed to support the development of dynamic websites,
web applications, web services and web resources.
This framework aims to alleviate the overhead associated with common activities in web development.
GNU Artanis provides several tools for web development: database access, templating frameworks, session management, [[http://en.wikipedia.org/wiki/Rewrite_engine][URL-remapping]] for [[http://en.wikipedia.org/wiki/Representational_state_transfer][RESTful]], page caching, and more.

Guile is the GNU Ubiquitous Intelligent Language for Extensions, the official extension language for the [[http://www.gnu.org/][GNU operating system]].
Guile is also an interpreter and compiler for other dynamic programming languages including Scheme.

[[http://en.wikipedia.org/wiki/Scheme_%28programming_language%29][Scheme]] is a functional programming language and one of the two main dialects of the programming language [[http://en.wikipedia.org/wiki/Lisp_(programming_language)][Lisp]].
Scheme follows a minimalist design philosophy specifying a small standard core with powerful tools for language extension.
** Conventions used in this manual
In this manual the following syntax is used to demonstrate the use of the API:
#+begin_src scheme
(api-name arg1 arg2 #:key0 val0 ... [optional-arg1 <- default-value1] ...)
#+end_src
If you are new to Scheme, it is recommended that you read the [[Basic in Scheme][Basic in Scheme]] chapter first.
