docs/manual.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-01-01 Wed 01:20 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>GNU Artanis web-framework Manual</title>
<meta name="author" content="Mu Lei known as NalaGinrut" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="manual.css" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">GNU Artanis web-framework Manual</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orge3be19c">1. Introduction</a>
<ul>
<li><a href="#orgbc539fa">1.1. Conventions used in this manual</a></li>
<li><a href="#orgcb01499">1.2. No warranty</a></li>
</ul>
</li>
<li><a href="#org14e78b1">2. License</a></li>
<li><a href="#org088caba">3. Installation</a>
<ul>
<li><a href="#org2e76202">3.1. For Guix users</a></li>
<li><a href="#org2be4e14">3.2. For Ubuntu/Debian users to install dependencies</a></li>
<li><a href="#org9c8bbdf">3.3. For hardcore users</a></li>
<li><a href="#orga09ce19">3.4. For contributors</a></li>
</ul>
</li>
<li><a href="#org2421bd7">4. Configuration</a>
<ul>
<li><a href="#org39c0ecf">4.1. Config APIs</a></li>
</ul>
</li>
<li><a href="#orgafe9c98">5. Hello World</a>
<ul>
<li><a href="#orgb1e6fb8">5.1. Use Guile REPL and verify GNU Artanis installation</a></li>
<li><a href="#org857a739">5.2. Simple HTTP server</a></li>
<li><a href="#org7fb15fa">5.3. Try simple URL remapping</a></li>
<li><a href="#orgea37f97">5.4. More complex URL remapping</a></li>
<li><a href="#org5bd6bfd">5.5. Regex in URL remapping</a></li>
<li><a href="#orgfa4966a">5.6. Database operating</a></li>
</ul>
</li>
<li><a href="#orge4db250">6. Scheme Basics</a>
<ul>
<li><a href="#orgff43995">6.1. For newbies</a></li>
<li><a href="#org2055689">6.2. For Pythonistas</a></li>
<li><a href="#orgb88324d">6.3. For Rubyist</a></li>
<li><a href="#org0b98a40">6.4. For deep learners</a></li>
</ul>
</li>
<li><a href="#orgc1a1e4f">7. GNU Artanis Basics</a>
<ul>
<li><a href="#orgd132cd9">7.1. How to run a site with GNU Artanis</a></li>
<li><a href="#org6edfd21">7.2. Initialization</a></li>
<li><a href="#org104d664">7.3. Registering handlers for HTTP methods</a></li>
<li><a href="#org2c54bd3">7.4. Emit a Response</a></li>
<li><a href="#org40c20df">7.5. Running the server</a></li>
<li><a href="#orgbe85541">7.6. Working with Nginx</a></li>
</ul>
</li>
<li><a href="#orgb43de67">8. The Art command line</a>
<ul>
<li><a href="#orgbedf36a">8.1. art create</a></li>
<li><a href="#org5ac0d50">8.2. art draw</a></li>
<li><a href="#org7105051">8.3. art api</a></li>
<li><a href="#orge62aed8">8.4. art migrate</a></li>
<li><a href="#org791abde">8.5. art work</a></li>
</ul>
</li>
<li><a href="#org3d35f2b">9. URL remapping</a>
<ul>
<li><a href="#orge1e9879">9.1. Introduction to URL remapping</a></li>
<li><a href="#org930d4bb">9.2. URL handling</a></li>
<li><a href="#orgb636c35">9.3. OPTIONS method</a></li>
<li><a href="#orga37ed10">9.4. Get parameters from a URL</a></li>
<li><a href="#orgb993091">9.5. Redirecting</a></li>
</ul>
</li>
<li><a href="#org044c7e5">10. Route context</a>
<ul>
<li><a href="#org7be6511">10.1. Route context APIs</a></li>
</ul>
</li>
<li><a href="#org533ed50">11. Page status handling</a>
<ul>
<li><a href="#orgb713692">11.1. HTTP status code</a></li>
<li><a href="#orga7a3d06">11.2. The default behaviour of status handling</a></li>
<li><a href="#org3f509d1">11.3. Dynamic status page generating</a></li>
</ul>
</li>
<li><a href="#org0b08188">12. MVC</a>
<ul>
<li><a href="#orge90db9b">12.1. Controllers/Views</a></li>
<li><a href="#orgf07d2ed">12.2. Models</a>
<ul>
<li><a href="#org8060817">12.2.1. Create models</a></li>
<li><a href="#org66c44e2">12.2.2. Define table in Model</a></li>
<li><a href="#org908a060">12.2.3. Tables dependencies</a></li>
<li><a href="#org1478ee1">12.2.4. Model API</a></li>
</ul>
</li>
<li><a href="#org69b64f0">12.3. Model mapping</a>
<ul>
<li><a href="#org03383e5">12.3.1. Table get</a></li>
<li><a href="#org5b3db74">12.3.2. Table set</a></li>
<li><a href="#orgcf7352c">12.3.3. Table existance</a></li>
<li><a href="#orge953464">12.3.4. Table schema get</a></li>
<li><a href="#org0395462">12.3.5. Table create</a></li>
<li><a href="#orga8640f6">12.3.6. Table remove</a></li>
<li><a href="#org78def12">12.3.7. Table modify</a></li>
<li><a href="#org8674dd9">12.3.8. Further reading</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org7000d43">13. Query String</a>
<ul>
<li><a href="#orga30efaf">13.1. Query string from GET</a></li>
<li><a href="#org2aee000">13.2. Query string from POST</a></li>
</ul>
</li>
<li><a href="#org8f45483">14. Layouts and Rendering in GNU Artanis</a>
<ul>
<li><a href="#org2310195">14.1. Templating</a></li>
<li><a href="#org5011b6a">14.2. Templating for Pythoners</a></li>
<li><a href="#orge2a928e">14.3. Templating for Rubyists</a></li>
<li><a href="#orga114576">14.4. Templating APIs</a></li>
<li><a href="#orgc52c93f">14.5. Embedded Templates</a>
<ul>
<li><a href="#orgf502fdf">14.5.1. Template special commands</a></li>
</ul>
</li>
<li><a href="#orgfddd8cf">14.6. SXML Templates</a></li>
</ul>
</li>
<li><a href="#org37d7d68">15. Databases</a>
<ul>
<li><a href="#org9432ba5">15.1. DB init hooks</a></li>
<li><a href="#org7d93196">15.2. DB connection pool</a></li>
<li><a href="#orgbd38915">15.3. Migration</a></li>
<li><a href="#orga063699">15.4. ORM problem</a></li>
<li><a href="#org8890e84">15.5. SSQL</a></li>
<li><a href="#org1e98bca">15.6. FPRM (experimental)</a>
<ul>
<li><a href="#org1336e8a">15.6.1. Connect to DB server</a></li>
<li><a href="#org6f2e990">15.6.2. Map DB table</a></li>
<li><a href="#orge2f8907">15.6.3. Create table</a></li>
<li><a href="#orgca33e78">15.6.4. Get columns from table</a></li>
<li><a href="#orga2667a4">15.6.5. Set values to table</a></li>
<li><a href="#orgcbbc83b">15.6.6. Drop a table</a></li>
<li><a href="#org3543c22">15.6.7. Check existence of table</a></li>
<li><a href="#org69fc13f">15.6.8. Get schema of a table</a></li>
</ul>
</li>
<li><a href="#org59ddff9">15.7. SQL Mapping (experimental)</a></li>
</ul>
</li>
<li><a href="#org10423ad">16. RESTful API</a></li>
<li><a href="#org52aa787">17. MIME</a>
<ul>
<li><a href="#org032262f">17.1. JSON</a></li>
<li><a href="#org64e7385">17.2. CSV</a></li>
<li><a href="#org01013e0">17.3. XML</a></li>
<li><a href="#org9b67c0f">17.4. SXML</a></li>
</ul>
</li>
<li><a href="#org029726c">18. Upload files</a>
<ul>
<li><a href="#org9a4ab1b">18.1. Receive an upload from the client</a></li>
<li><a href="#orge68b066">18.2. Send an upload to a Server</a></li>
</ul>
</li>
<li><a href="#org4981a57">19. Sessions</a>
<ul>
<li><a href="#orgf431690">19.1. Session backend</a></li>
</ul>
</li>
<li><a href="#orga094eb3">20. Cookies</a></li>
<li><a href="#org6b6ba58">21. Authentication</a>
<ul>
<li><a href="#org9f2f02b">21.1. Init Authentication</a></li>
<li><a href="#orgba1adfb">21.2. Basic Authentication</a></li>
<li><a href="#org392e484">21.3. Common Authentication</a></li>
<li><a href="#org548c654">21.4. Login Authentication</a></li>
<li><a href="#org4a3c586">21.5. Authenticate checking</a></li>
<li><a href="#orge8d48bc">21.6. Customized Authentication</a></li>
<li><a href="#org7f13a48">21.7. Websocket Authentication</a></li>
<li><a href="#org302091d">21.8. HMAC</a></li>
</ul>
</li>
<li><a href="#orgd80fecc">22. Cache</a>
<ul>
<li><a href="#orgeca8b7e">22.1. On web caching</a></li>
<li><a href="#org9b18438">22.2. Cache APIs</a></li>
</ul>
</li>
<li><a href="#orge1c4e4b">23. Shortcuts</a>
<ul>
<li><a href="#orgfef5175">23.1. What is shortcuts?</a></li>
<li><a href="#orgef3748c">23.2. Database connection</a></li>
<li><a href="#org5392ea3">23.3. Raw SQL</a></li>
<li><a href="#org876c05b">23.4. String template</a></li>
<li><a href="#org64cdbf3">23.5. SQL-Mapping shortcut (unfinished)</a></li>
<li><a href="#org221ee4a">23.6. Authentication shortcut</a></li>
</ul>
</li>
<li><a href="#orgf88fdc8">24. Websocket (Experimental)</a>
<ul>
<li><a href="#org5de36db">24.1. Websocket introduction</a></li>
<li><a href="#orgd80994e">24.2. Websocket basic usage</a></li>
<li><a href="#org934b19e">24.3. Websocket named-pipe</a></li>
<li><a href="#orge6737cd">24.4. Websocket APIs</a>
<ul>
<li><a href="#org8e45583">24.4.1. Websocket configuration</a></li>
<li><a href="#org5c604ca">24.4.2. Websocket application</a></li>
</ul>
</li>
<li><a href="#org78927d6">24.5. Websocket frame</a></li>
<li><a href="#org5addbcd">24.6. Websocket opcode</a></li>
<li><a href="#orgb415ea3">24.7. Websocket authentication</a></li>
</ul>
</li>
<li><a href="#org0823621">25. Ragnarok server core</a>
<ul>
<li><a href="#org3e7660b">25.1. Ragnarok introduction</a></li>
<li><a href="#org61783da">25.2. Principles</a></li>
<li><a href="#org1a7b18a">25.3. Features</a></li>
<li><a href="#orgec80dcb">25.4. Ragnarok APIs</a></li>
</ul>
</li>
<li><a href="#orgc1ff8a6">26. Key-Value Database</a>
<ul>
<li><a href="#orgdaab97c">26.1. LPC</a></li>
</ul>
</li>
<li><a href="#org962d52c">27. Utils</a>
<ul>
<li><a href="#org5923817">27.1. String Template</a></li>
<li><a href="#org0295962">27.2. Random String Generator</a></li>
<li><a href="#orgf80fe5c">27.3. Cryptographic hash functions</a></li>
<li><a href="#org1bc0ceb">27.4. Stack &amp; Queue</a></li>
<li><a href="#orge9dd677">27.5. Useful string operation</a></li>
<li><a href="#org55ffd20">27.6. Time operation tool</a></li>
</ul>
</li>
<li><a href="#org72813ff">28. Debug mode</a></li>
<li><a href="#orgd28a6cb">29. Appendix A GNU Free Documentation License</a></li>
</ul>
</div>
</div>

<div id="outline-container-orge3be19c" class="outline-2">
<h2 id="orge3be19c"><span class="section-number-2">1.</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<div class="org-src-container">
<pre class="src src-nil">Copyright (C)  2024  Mu Lei known as NalaGinrut.
Permission is granted to copy, distribute and/or modify this document
under the terms of the GNU Free Documentation License, Version 1.3
or any later version published by the Free Software Foundation;
with no Invariant Sections, no Front-Cover Texts, and no Back-Cover
Texts.  A copy of the license is included in the section entitled 'GNU
Free Documentation License'.
</pre>
</div>

<p>
This manual documents GNU Artanis, a fast, monolithithic web framework of Scheme.
</p>

<p>
A <a href="http://en.wikipedia.org/wiki/Web_application_framework">web application framework (WAF)</a> is a software framework that is designed to support the development of dynamic websites,
web applications, web services and web resources.
This framework aims to alleviate the overhead associated with common activities in web development.
GNU Artanis provides several tools for web development: database access, templating frameworks, session management, <a href="http://en.wikipedia.org/wiki/Rewrite_engine">URL-remapping</a> for <a href="http://en.wikipedia.org/wiki/Representational_state_transfer">RESTful</a>, page caching, and more.
</p>

<p>
Guile is the GNU Ubiquitous Intelligent Language for Extensions, the official extension language for the <a href="http://www.gnu.org/">GNU operating system</a>.
Guile is also an interpreter and compiler for other dynamic programming languages including Scheme.
</p>

<p>
<a href="http://en.wikipedia.org/wiki/Scheme_%28programming_language%29">Scheme</a> is a functional programming language and one of the two main dialects of the programming language <a href="http://en.wikipedia.org/wiki/Lisp_(programming_language)">Lisp</a>.
Scheme follows a minimalist design philosophy specifying a small standard core with powerful tools for language extension.
</p>
</div>
<div id="outline-container-orgbc539fa" class="outline-3">
<h3 id="orgbc539fa"><span class="section-number-3">1.1.</span> Conventions used in this manual</h3>
<div class="outline-text-3" id="text-1-1">
<p>
In this manual the following syntax is used to demonstrate the use of the API:
</p>
<div class="org-src-container">
<pre class="src src-scheme">(api-name arg1 arg2 <span style="font-weight: bold;">#:key0</span> val0 ... [optional-arg1 &lt;- default-value1] ...)
</pre>
</div>
<p>
If you are new to Scheme, it is recommended that you read the [BROKEN LINK: Basic in Scheme] chapter first.
</p>
</div>
</div>
