docs/manual.org
** No warranty
We distribute software in the hope that it will be useful, but without any warranty. No author or distributor of this software accepts responsibility to anyone for the consequences of using it or for whether it serves any particular purpose or works at all, unless they say so in writing. This is exactly the same warranty that proprietary software companies offer: none.
* License
GNU Artanis is [[http://www.gnu.org/philosophy/free-sw.html][Free Software]]. GNU Artanis is under the terms of the GNU GPLv3+ and GNU LGPLv3+.
See the files COPYING and COPYING.LESSER in toplevel of source code.

This manual is published under the terms of the [[http://www.gnu.org/copyleft/fdl.html][GNU Free Documentation License]] 1.3 or later.

*You must be aware there is no warranty whatsoever for GNU Artanis. This is described in full in the
This is described in full in the licenses.*
* Installation
** For Guix users
GNU Guix is the advanced functional & transactional package manager, we recommend you to try it.
You may read the [[https://guix.gnu.org/manual/en/html_node/Installation.html][GNU Guix installation]] .
#+begin_src null
guix install artanis
#+end_src

** For Ubuntu/Debian users to install dependencies
#+begin_src null
apt-get -qq -y install texinfo guile-3.0 guile-3.0-dev build-essential automake git autoconf libtool libmariadb-dev-compat libmariadb-dev libnss3 libnss3-dev

apt-get -qq -y install gettext redis redis-server libcurl4-openssl-dev
#+end_src

** For hardcore users

*Install GNU Guile-3.0.5 or higher version:*

Since GNU Artanis-0.5, GNU Guile-3+ is required.

Install pre-requisites (typically available in linux package distributions):
a C compiler, [[https://www.gnu.org/software/autoconf/]autoconf],
[[https://www.gnu.org/software/automake/]automake],
[[https://sourceware.org/libffi/]libffi],
[[https://curl.se/libcurl/]libcurl],
[[https://www.gnu.org/software/libtool/]libtool and libltdl],
[[https://www.gnu.org/software/libunistring/]libunistring],
[[https://www.perl.org/]perl],
[[https://firefox-source-docs.mozilla.org/security/nss/index.html]libnss (Network Security Services)],
[[https://tiswww.case.edu/php/chet/readline/rltop.html]readline] and
[[http://zlib.net/]zlib].

#+begin_src null
wget -c ftp://ftp.gnu.org/gnu/guile/guile-3.0.10.tar.xz
tar xvf guile-3.0.10.tar.xz
cd guile-3.0.10 && ./configure && make #(NOTE: this may take a very long time)
sudo make install
#+end_src

I would NOT recommend trying to compile/install Guile from Git repo, since it'll take a long time.

*Install dependencies:*

+ guile-dbi-2.1.8 (The tarball included guile-dbd) *[Optional]*
#+begin_src null
wget -c https://github.com/opencog/guile-dbi/archive/guile-dbi-2.1.8.tar.gz

tar xvzf guile-dbi-2.1.8.tar.gz
cd guile-dbi-guile-dbi-2.1.7/guile-dbi && ./autogen.sh --no-configure && ./configure && make
sudo make install
cd ../..
#+end_src

+ guile-dbd *[Optional]*. The dbd plugins connect to an actual database server.
#+begin_src null

cd guile-dbi-guile-dbi-2.1.8/guile-dbd-mysql && ./autogen.sh --no-configure && ./configure && make
sudo make install
#+end_src
MySQL is used for the examples in this manual. You may find dbd plugins for other databases
[[ https://github.com/opencog/guile-dbi][here]]. The installation process is identical.

+ guile-curl for the client module.
#+begin_src null
git clone https://github.com/spk121/guile-curl.git
cd guile-curl && git checkout v0.9
./bootstrap && ./configure --prefix=/usr && make -j
make install
ln -s /usr/lib/guile/3.0/extensions/libguile-curl.* /usr/lib/
ldconfig
#+end_src
**NOTE:** You may need to make necessary soft links according to above script.

+ guile-redis:
#+begin_src null
git clone https://github.com/aconchillo/guile-redis.git
cd guile-redis
git checkout -b 2.2.0
autoreconf -vif
./configure --prefix=/usr
make
make install
#+end_src

+ guile-json:
#+begin_src null
git clone https://github.com/aconchillo/guile-json.git
cd guile-json
git checkout -b 4.7.3
autoreconf -iv
./configure --prefix=/usr
make -j5
sudo make install
sudo ldconfig
#+end_src

+ libnss (Network Security Services):
Please follow the [[https://firefox-source-docs.mozilla.org/security/nss/build.html] official guide].
It's better to install it with your distro's pkg manager.

*Install the latest GNU Artanis:*

,#+begin_src null
wget -c http://ftp.gnu.org/gnu/artanis/artanis-latest.tar.bz2
tar xvjf artanis-latest.tar.bz2
cd artanis-latest && ./autogen.sh --no-configure && ./configure && make
sudo make install
#+end_src

** For contributors
First of all, thank you for contributing! You may clone the main git repository, or the mirror on GitLab:

#+begin_src null
git clone git://git.savannah.gnu.org/artanis.git

# mirror on GitLab
git clone https://gitlab.com/hardenedlinux/artanis.git
#+end_src

* Configuration
A configuration file is required when Artanis is run for the first time.

+ If you're using minimum mode, say, all code are in a script file without application directory.
  The configure file must be named src_conf[:exports code]{/etc/artanis/artanis.conf}.

+ If you're using application directory, the configure file src_conf[:exports code]{conf/artanis.conf} will be generated automatically for you.

** Config APIs
To change the default configurations:
#+BEGIN_SRC scheme
(conf-set! key value)
;;e.g
(conf-set! 'debug-mode #t)
#+END_SRC

To get the current configuration:
#+BEGIN_SRC scheme
(get-conf key)
;;e.g
(get-conf '(server charset))
#+END_SRC

To get the current hostname in GNU Artanis environment.
#+BEGIN_SRC scheme
(current-myhost)
#+END_SRC
* Hello World
