docs/manual.html
<div id="outline-container-orgcb01499" class="outline-3">
<h3 id="orgcb01499"><span class="section-number-3">1.2.</span> No warranty</h3>
<div class="outline-text-3" id="text-1-2">
<p>
We distribute software in the hope that it will be useful, but without any warranty. No author or distributor of this software accepts responsibility to anyone for the consequences of using it or for whether it serves any particular purpose or works at all, unless they say so in writing. This is exactly the same warranty that proprietary software companies offer: none.
</p>
</div>
</div>
</div>
<div id="outline-container-org14e78b1" class="outline-2">
<h2 id="org14e78b1"><span class="section-number-2">2.</span> License</h2>
<div class="outline-text-2" id="text-2">
<p>
GNU Artanis is <a href="http://www.gnu.org/philosophy/free-sw.html">Free Software</a>. GNU Artanis is under the terms of the GNU GPLv3+ and GNU LGPLv3+.
See the files COPYING and COPYING.LESSER in toplevel of source code.
</p>

<p>
This manual is published under the terms of the <a href="http://www.gnu.org/copyleft/fdl.html">GNU Free Documentation License</a> 1.3 or later.
</p>

<p>
<b>You must be aware there is no warranty whatsoever for GNU Artanis. This is described in full in the
This is described in full in the licenses.</b>
</p>
</div>
</div>
<div id="outline-container-org088caba" class="outline-2">
<h2 id="org088caba"><span class="section-number-2">3.</span> Installation</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org2e76202" class="outline-3">
<h3 id="org2e76202"><span class="section-number-3">3.1.</span> For Guix users</h3>
<div class="outline-text-3" id="text-3-1">
<p>
GNU Guix is the advanced functional &amp; transactional package manager, we recommend you to try it.
You may read the <a href="https://guix.gnu.org/manual/en/html_node/Installation.html">GNU Guix installation</a> .
</p>
<div class="org-src-container">
<pre class="src src-null">guix install artanis
</pre>
</div>
</div>
</div>

<div id="outline-container-org2be4e14" class="outline-3">
<h3 id="org2be4e14"><span class="section-number-3">3.2.</span> For Ubuntu/Debian users to install dependencies</h3>
<div class="outline-text-3" id="text-3-2">
<div class="org-src-container">
<pre class="src src-null">apt-get -qq -y install texinfo guile-3.0 guile-3.0-dev build-essential automake git autoconf libtool libmariadb-dev-compat libmariadb-dev libnss3 libnss3-dev

apt-get -qq -y install gettext redis redis-server libcurl4-openssl-dev
</pre>
</div>
</div>
</div>

<div id="outline-container-org9c8bbdf" class="outline-3">
<h3 id="org9c8bbdf"><span class="section-number-3">3.3.</span> For hardcore users</h3>
<div class="outline-text-3" id="text-3-3">
<p>
<b>Install GNU Guile-3.0.5 or higher version:</b>
</p>

<p>
Since GNU Artanis-0.5, GNU Guile-3+ is required.
</p>

<p>
Install pre-requisites (typically available in linux package distributions):
a C compiler, [[<a href="https://www.gnu.org/software/autoconf/">https://www.gnu.org/software/autoconf/</a>]autoconf],
[[<a href="https://www.gnu.org/software/automake/">https://www.gnu.org/software/automake/</a>]automake],
[[<a href="https://sourceware.org/libffi/">https://sourceware.org/libffi/</a>]libffi],
[[<a href="https://curl.se/libcurl/">https://curl.se/libcurl/</a>]libcurl],
[[<a href="https://www.gnu.org/software/libtool/">https://www.gnu.org/software/libtool/</a>]libtool and libltdl],
[[<a href="https://www.gnu.org/software/libunistring/">https://www.gnu.org/software/libunistring/</a>]libunistring],
[[<a href="https://www.perl.org/">https://www.perl.org/</a>]perl],
[[<a href="https://firefox-source-docs.mozilla.org/security/nss/index.html">https://firefox-source-docs.mozilla.org/security/nss/index.html</a>]libnss (Network Security Services)],
[[<a href="https://tiswww.case.edu/php/chet/readline/rltop.html">https://tiswww.case.edu/php/chet/readline/rltop.html</a>]readline] and
[[<a href="http://zlib.net/">http://zlib.net/</a>]zlib].
</p>

<div class="org-src-container">
<pre class="src src-null">wget -c ftp://ftp.gnu.org/gnu/guile/guile-3.0.10.tar.xz
tar xvf guile-3.0.10.tar.xz
cd guile-3.0.10 &amp;&amp; ./configure &amp;&amp; make #(NOTE: this may take a very long time)
sudo make install
</pre>
</div>

<p>
I would NOT recommend trying to compile/install Guile from Git repo, since it'll take a long time.
</p>

<p>
<b>Install dependencies:</b>
</p>

<ul class="org-ul">
<li>guile-dbi-2.1.8 (The tarball included guile-dbd) <b>[Optional]</b></li>
</ul>
<div class="org-src-container">
<pre class="src src-null">wget -c https://github.com/opencog/guile-dbi/archive/guile-dbi-2.1.8.tar.gz

tar xvzf guile-dbi-2.1.8.tar.gz
cd guile-dbi-guile-dbi-2.1.7/guile-dbi &amp;&amp; ./autogen.sh --no-configure &amp;&amp; ./configure &amp;&amp; make
sudo make install
cd ../..
</pre>
</div>

<ul class="org-ul">
<li>guile-dbd <b>[Optional]</b>. The dbd plugins connect to an actual database server.</li>
</ul>
<div class="org-src-container">
<pre class="src src-null">
cd guile-dbi-guile-dbi-2.1.8/guile-dbd-mysql &amp;&amp; ./autogen.sh --no-configure &amp;&amp; ./configure &amp;&amp; make
sudo make install
</pre>
</div>
<p>
MySQL is used for the examples in this manual. You may find dbd plugins for other databases
[BROKEN LINK:  https://github.com/opencog/guile-dbi]. The installation process is identical.
</p>

<ul class="org-ul">
<li>guile-curl for the client module.</li>
</ul>
<div class="org-src-container">
<pre class="src src-null">git clone https://github.com/spk121/guile-curl.git
cd guile-curl &amp;&amp; git checkout v0.9
./bootstrap &amp;&amp; ./configure --prefix=/usr &amp;&amp; make -j
make install
ln -s /usr/lib/guile/3.0/extensions/libguile-curl.* /usr/lib/
ldconfig
</pre>
</div>
<p>
<b><b>NOTE:</b></b> You may need to make necessary soft links according to above script.
</p>

<ul class="org-ul">
<li>guile-redis:</li>
</ul>
<div class="org-src-container">
<pre class="src src-null">git clone https://github.com/aconchillo/guile-redis.git
cd guile-redis
git checkout -b 2.2.0
autoreconf -vif
./configure --prefix=/usr
make
make install
</pre>
</div>

<ul class="org-ul">
<li>guile-json:</li>
</ul>
<div class="org-src-container">
<pre class="src src-null">git clone https://github.com/aconchillo/guile-json.git
cd guile-json
git checkout -b 4.7.3
autoreconf -iv
./configure --prefix=/usr
make -j5
sudo make install
sudo ldconfig
</pre>
</div>

<ul class="org-ul">
<li>libnss (Network Security Services):</li>
</ul>
<p>
Please follow the [[<a href="https://firefox-source-docs.mozilla.org/security/nss/build.html">https://firefox-source-docs.mozilla.org/security/nss/build.html</a>] official guide].
It's better to install it with your distro's pkg manager.
</p>

<p>
<b>Install the latest GNU Artanis:</b>
</p>

<p>
,#+begin_src null
wget -c <a href="http://ftp.gnu.org/gnu/artanis/artanis-latest.tar.bz2">http://ftp.gnu.org/gnu/artanis/artanis-latest.tar.bz2</a>
tar xvjf artanis-latest.tar.bz2
cd artanis-latest &amp;&amp; ./autogen.sh &#x2013;no-configure &amp;&amp; ./configure &amp;&amp; make
sudo make install
#+end_src
</p>
</div>
</div>

<div id="outline-container-orga09ce19" class="outline-3">
<h3 id="orga09ce19"><span class="section-number-3">3.4.</span> For contributors</h3>
<div class="outline-text-3" id="text-3-4">
<p>
First of all, thank you for contributing! You may clone the main git repository, or the mirror on GitLab:
</p>

<div class="org-src-container">
<pre class="src src-null">git clone git://git.savannah.gnu.org/artanis.git

# mirror on GitLab
git clone https://gitlab.com/hardenedlinux/artanis.git
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org2421bd7" class="outline-2">
<h2 id="org2421bd7"><span class="section-number-2">4.</span> Configuration</h2>
<div class="outline-text-2" id="text-4">
<p>
A configuration file is required when Artanis is run for the first time.
</p>

<ul class="org-ul">
<li>If you're using minimum mode, say, all code are in a script file without application directory.
The configure file must be named <code class="src src-conf">/etc/artanis/artanis.conf</code>.</li>

<li>If you're using application directory, the configure file <code class="src src-conf">conf/artanis.conf</code> will be generated automatically for you.</li>
</ul>
</div>

<div id="outline-container-org39c0ecf" class="outline-3">
<h3 id="org39c0ecf"><span class="section-number-3">4.1.</span> Config APIs</h3>
<div class="outline-text-3" id="text-4-1">
<p>
To change the default configurations:
</p>
<div class="org-src-container">
<pre class="src src-scheme">(conf-set! key value)
<span style="color: #66cdaa;">;;</span><span style="color: #66cdaa;">e.g</span>
(conf-set! 'debug-mode #t)
</pre>
</div>

<p>
To get the current configuration:
</p>
<div class="org-src-container">
<pre class="src src-scheme">(get-conf key)
<span style="color: #66cdaa;">;;</span><span style="color: #66cdaa;">e.g</span>
(get-conf '(server charset))
</pre>
</div>

<p>
To get the current hostname in GNU Artanis environment.
</p>
<div class="org-src-container">
<pre class="src src-scheme">(current-myhost)
</pre>
</div>
</div>
</div>
</div>
