docs/manual.org
** Use Guile REPL and verify GNU Artanis installation
If you are already familiar with Guile, you may skip this section.

Type `guile' in your console to enter the Guile REPL. You should see the following text displayed on your screen:
#+begin_src null
GNU Guile 3.0.9
Copyright (C) 1995-2023 Free Software Foundation, Inc.

Guile comes with ABSOLUTELY NO WARRANTY; for details type `,show w'.
This program is free software, and you are welcome to redistribute it
under certain conditions; type `,show c' for details.

Enter `,help' for help.
scheme@(guile-user)>
#+end_src

Welcome to Guile world! We are now going to play with GNU Artanis. Before we start, we need to check that GNU Artanis is installed correctly:

*(Just type them, you don't have to understand them at present)*

#+begin_src scheme
,use (artanis artanis)
artanis-version
#+end_src

The expected output should be similar to this:
#+begin_src scheme
$1 = "GNU Artanis-x.x.x"
#+end_src
** Simple HTTP server
Run this code in your console:
#+begin_src bash
guile -c "(use-modules (artanis artanis))(init-server)(run)"
## You'll see this screen:
Anytime you want to quit just try Ctrl+C, thanks!
http://127.0.0.1:3000
#+end_src

Assuming there's a file named "index.html" in the current path. Now you may try http://localhost:3000/index.html in your browser.
It's just simply fetching static file by the URL: http://localhost:3000/path/filename
** Try simple URL remapping
Type these code in Guile REPL:
#+begin_src scheme
(use-modules (artanis artanis))
(init-server)
(get "/hello" (lambda () "hello world"))
(run #:port 8080)
#+end_src

Now you can visit http://localhost:8080/hello with your browser, and (hopefully) see the result.

/If you encounter "[EXCEPTION] /favicon.ico is abnormal request" , please just ignore that warning./

Let me explain the code:

+ /line 1:/ Load GNU Artanis module, (artanis artanis) is the name.


+ /line 2:/ The first argument /get/ is GNU Artanis' API correspondence to the GET method of the HTTP protocol.
  The second argument "/hello" is the URL rule to register showing in the address line of e.g. firefox.
  The third argument is the handler which will be triggered if the registered URL rule is hit.

+ /line 3:/ Run the GNU Artanis web server, and listen on socket port 8080.

You may type Ctrl+C to quit and stop the server, see also the message printed on the screen accordingly.
** More complex URL remapping
Try this code:
#+begin_src scheme
(use-modules (artanis artanis))
(init-server)
(get "/hello/:who"
  (lambda (rc)
    (format #f "<p>hello ~a</p> " (params rc "who"))))
(run #:port 8080)
#+end_src

Now you can try http://localhost:8080/hello/artanis in your browser.

There are two differences compared to the simpler example:
+ 1. The special rule, "=/hello/:who=", /:who/ means you can use /params/ to refer to the value of the par of the URL with the key "who". Like: src_scheme[:exports code]{(params rc "who")}.

+ 2. You may have noticed that the handler is being defined as an anonymous function with /lambda/ has one argument /rc/. It means /route context/ which preserves all the related context information. Many GNU Artanis APIs need it, e.g.  /params/.

And /format/ is a Scheme lib function. It is similar to /sprintf/ in the C language, which outputs text with a formatted pattern.
The second argument #f (means FALSE) indicates that the formatted output should be returned in a string rather than printed out.
** Regex in URL remapping
You can use regular expressions as a URL rule argument.
#+begin_src scheme
(use-modules (artanis artanis))
(init-server)
(get "/.+\\.(png|gif|jpeg)" static-page-emitter)
(run #:port 8080)
#+end_src

/static-page-emitter/ is a GNU Artanis API that sends a static file (images, data files) to the client.
