docs/manual.html
<div id="outline-container-orgafe9c98" class="outline-2">
<h2 id="orgafe9c98"><span class="section-number-2">5.</span> Hello World</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-orgb1e6fb8" class="outline-3">
<h3 id="orgb1e6fb8"><span class="section-number-3">5.1.</span> Use Guile REPL and verify GNU Artanis installation</h3>
<div class="outline-text-3" id="text-5-1">
<p>
If you are already familiar with Guile, you may skip this section.
</p>

<p>
Type `guile' in your console to enter the Guile REPL. You should see the following text displayed on your screen:
</p>
<div class="org-src-container">
<pre class="src src-null">GNU Guile 3.0.9
Copyright (C) 1995-2023 Free Software Foundation, Inc.

Guile comes with ABSOLUTELY NO WARRANTY; for details type `,show w'.
This program is free software, and you are welcome to redistribute it
under certain conditions; type `,show c' for details.

Enter `,help' for help.
scheme@(guile-user)&gt;
</pre>
</div>

<p>
Welcome to Guile world! We are now going to play with GNU Artanis. Before we start, we need to check that GNU Artanis is installed correctly:
</p>

<p>
<b>(Just type them, you don't have to understand them at present)</b>
</p>

<div class="org-src-container">
<pre class="src src-scheme">,use (artanis artanis)
artanis-version
</pre>
</div>

<p>
The expected output should be similar to this:
</p>
<div class="org-src-container">
<pre class="src src-scheme">$1 = <span style="color: #ff0000;">"GNU Artanis-x.x.x"</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org857a739" class="outline-3">
<h3 id="org857a739"><span class="section-number-3">5.2.</span> Simple HTTP server</h3>
<div class="outline-text-3" id="text-5-2">
<p>
Run this code in your console:
</p>
<div class="org-src-container">
<pre class="src src-bash">guile -c <span style="color: #ff0000;">"(use-modules (artanis artanis))(init-server)(run)"</span>
<span style="color: #66cdaa;">## </span><span style="color: #66cdaa;">You'll see this screen:</span>
Anytime you want to quit just try Ctrl+C, thanks!
http://127.0.0.1:3000
</pre>
</div>

<p>
Assuming there's a file named "index.html" in the current path. Now you may try <a href="http://localhost:3000/index.html">http://localhost:3000/index.html</a> in your browser.
It's just simply fetching static file by the URL: <a href="http://localhost:3000/path/filename">http://localhost:3000/path/filename</a>
</p>
</div>
</div>
<div id="outline-container-org7fb15fa" class="outline-3">
<h3 id="org7fb15fa"><span class="section-number-3">5.3.</span> Try simple URL remapping</h3>
<div class="outline-text-3" id="text-5-3">
<p>
Type these code in Guile REPL:
</p>
<div class="org-src-container">
<pre class="src src-scheme">(use-modules (artanis artanis))
(init-server)
(get <span style="color: #ff0000;">"/hello"</span> (<span style="color: #4169e1;">lambda</span> () <span style="color: #ff0000;">"hello world"</span>))
(run <span style="font-weight: bold;">#:port</span> 8080)
</pre>
</div>

<p>
Now you can visit <a href="http://localhost:8080/hello">http://localhost:8080/hello</a> with your browser, and (hopefully) see the result.
</p>

<p>
<i>If you encounter "[EXCEPTION] /favicon.ico is abnormal request" , please just ignore that warning.</i>
</p>

<p>
Let me explain the code:
</p>

<ul class="org-ul">
<li><i>line 1:</i> Load GNU Artanis module, (artanis artanis) is the name.</li>
</ul>


<ul class="org-ul">
<li><i>line 2:</i> The first argument <i>get</i> is GNU Artanis' API correspondence to the GET method of the HTTP protocol.
The second argument "/hello" is the URL rule to register showing in the address line of e.g. firefox.
The third argument is the handler which will be triggered if the registered URL rule is hit.</li>

<li><i>line 3:</i> Run the GNU Artanis web server, and listen on socket port 8080.</li>
</ul>

<p>
You may type Ctrl+C to quit and stop the server, see also the message printed on the screen accordingly.
</p>
</div>
</div>
<div id="outline-container-orgea37f97" class="outline-3">
<h3 id="orgea37f97"><span class="section-number-3">5.4.</span> More complex URL remapping</h3>
<div class="outline-text-3" id="text-5-4">
<p>
Try this code:
</p>
<div class="org-src-container">
<pre class="src src-scheme">(use-modules (artanis artanis))
(init-server)
(get <span style="color: #ff0000;">"/hello/:who"</span>
  (<span style="color: #4169e1;">lambda</span> (rc)
    (format #f <span style="color: #ff0000;">"&lt;p&gt;hello ~a&lt;/p&gt; "</span> (params rc <span style="color: #ff0000;">"who"</span>))))
(run <span style="font-weight: bold;">#:port</span> 8080)
</pre>
</div>

<p>
Now you can try <a href="http://localhost:8080/hello/artanis">http://localhost:8080/hello/artanis</a> in your browser.
</p>

<p>
There are two differences compared to the simpler example:
</p>
<ul class="org-ul">
<li>1. The special rule, "<code>/hello/:who</code>", <i>:who</i> means you can use <i>params</i> to refer to the value of the par of the URL with the key "who". Like: <code class="src src-scheme">(params rc <span style="color: #ff0000;">"who"</span>)</code>.</li>

<li>2. You may have noticed that the handler is being defined as an anonymous function with <i>lambda</i> has one argument <i>rc</i>. It means <i>route context</i> which preserves all the related context information. Many GNU Artanis APIs need it, e.g.  <i>params</i>.</li>
</ul>

<p>
And <i>format</i> is a Scheme lib function. It is similar to <i>sprintf</i> in the C language, which outputs text with a formatted pattern.
The second argument #f (means FALSE) indicates that the formatted output should be returned in a string rather than printed out.
</p>
</div>
</div>
<div id="outline-container-org5bd6bfd" class="outline-3">
<h3 id="org5bd6bfd"><span class="section-number-3">5.5.</span> Regex in URL remapping</h3>
<div class="outline-text-3" id="text-5-5">
<p>
You can use regular expressions as a URL rule argument.
</p>
<div class="org-src-container">
<pre class="src src-scheme">(use-modules (artanis artanis))
(init-server)
(get <span style="color: #ff0000;">"/.+\\.(png|gif|jpeg)"</span> static-page-emitter)
(run <span style="font-weight: bold;">#:port</span> 8080)
</pre>
</div>

<p>
<i>static-page-emitter</i> is a GNU Artanis API that sends a static file (images, data files) to the client.
</p>
</div>
</div>
