docs/manual.org
** Database operating
GNU Artanis supports mysql/postgresql/sqlite3. We use mysql as an example here.

Please ensure that your DB service was started before you run this code.

*/If you encounter any problems, it's very likely it's with your DB config./*

You can use a DB (such as mysql) with GUI tools such as "adminer", independently of the running web-server, e.g. artanis-based.
#+begin_src scheme
(use-modules (artanis artanis))
(init-server)
(define conn (connect-db 'mysql #:db-username "your_db_username"
                         #:db-name "your_db_name" #:db-passwd "your_passwd"))
(define mtable (map-table-from-DB conn))
((mtable 'create 'Persons '((name varchar 10)
                            (age integer)
                            (email varchar 20)))
 'valid?)
;; ==> #t
(mtable 'set 'Persons #:name "nala" #:age 20 #:email "nala@artanis.dev")
(mtable 'get 'Persons #:columns '(name email))
;; ==> ((("name" . "nala") ("email" . "nala@artanis.com")))
#+end_src

+ /map-table-from-DB/ is the GNU Artanis API handling tables in a DB. Here, we define this mapping as the var /mtable/.


+ We can use /mtable/ to handle tables, you can get the values from a table with the 'get command.


+ /mtable/ is a function which accepts the first argument as a command, say 'create, which is a command to create a new table. 'set is used to insert/update values in the table. And the 'get command to fetch the values of specific columns.


+ The second argument of /mtable/ is the name of the table as you can guess. Please note that it is case sensitive, while the column name isn't.


+ The /*'create*/ command returns a function too, which also accepts an argument as a command. Here, we use the /*'valid?*/ command to check if the table has been created successfully.

This was just a simple introduction. You may read the DB section in this manual for details.

Of course, you can use DB in your web application.
#+begin_src scheme
(get "/dbtest" #:conn #t ; apply for a DB connection from pool
     (lambda (rc)
       (let ((mtable (map-table-from-DB (:conn rc))))
         (object->string
          (mtable 'get 'Persons #:columns '(name email))))))

(run #:use-db? #t #:dbd 'mysql #:db-username "your_db_username"
     #:db-name "your_db_name" #:db-passwd "your_passwd" #:port 8080)
#+end_src

Now, try loading http://localhost:8080/dbtest in your browser.

Here is quick explanation:
+ The keyword-value pair src_scheme[:exports code]{#:conn #t} means applying for a DB connection from connection-pool.
  Then you can use src_scheme[:exports code]{(:conn rc)} to get the allocated connection for DB operations.

+ Finally, the handler needs to return a string as the HTTP response body, so in this example,
we have to use the Guile
  API /object->string/ to convert the query result into a string.

/Exercise: Return a beautiful table in HTML rather than using object->string./
* Scheme Basics
This chapter introduces some useful documents to help you understand Scheme language.
Feel free to come back here if you have any problems with the Scheme syntax.

Scheme was introduced in 1975 by Gerald J. Sussman and Guy L. Steele Jr. and was the first dialect of Lisp to fully support lexical scoping,
first-class procedures, and continuations. In its earliest form it was a small language intended primarily for research and teaching,
supporting only a handful of predefined syntactic forms and procedures. Scheme is now a complete general-purpose programming language, though
it still derives its power from a small set of key concepts. Early implementations of the language were interpreter-based and slow, but
Guile Scheme is trying to implement sophisticated compiler that generate better optimized code, and even a plan for AOT compiler generated
native code in the future.

** For newbies

If you're not familiar with Scheme and Guile in particular, here is a simple tutorial for you.

If you already know the basics of the Scheme language, please feel free to skip this section.

I would recommend newbies to type/paste the code in Guile REPL following the guide in tutorial:
[[http://web-artanis.com/scheme.html][Learn Scheme in 15 minutes]]

And here's a nice section in the Guile manual for basics in Scheme:
[[https://www.gnu.org/software/guile/manual/guile.html#Hello-Scheme_0021][Hello Scheme]]

Please don't spend too much time on these tutorials, the purpose is to let newbies get a little familiar with the grammar of Scheme.

** For Pythonistas

These are good pythonic articles for Pythoners:

1. [[http://draketo.de/proj/guile-basics/][Guile basics from the perspective of a Pythonista]]
2. [[http://draketo.de/proj/py2guile][Going from Python to Guile Scheme]]

Still, please don't spend too much time on them, the purpose is to let newbies get a little familiar with the grammar of Scheme.

** For Rubyist
Here's a great article for Rubyist to learn Scheme:
1. [[http://wiki.call-cc.org/chicken-for-ruby-programmers][Scheme for ruby programmers]]
** For deep learners

These two books are very good for learning Scheme seriously:

1. [[http://www.scheme.com/tspl4/][The Scheme Programming Language]]
2. [[http://mitpress.mit.edu/sicp/][Structure and Interpretation of Computer Programs(SICP)]]

Please don't bother reading them if you simply want to use GNU Artanis to build your web application/site in few minutes.

And if you really want to try to work these books seriously, please ignore GNU Artanis before you are done with them.

But once you're done reading them *carefully*, you may want to write a new GNU Artanis all by yourself!

Hold your horses. ;-)
* GNU Artanis Basics
** Web application structure
#+begin_src bash
├── app
│   ├── controllers
│   ├── models
│   ├── protocols
│   └── views
├── conf
│   ├── artanis.conf
│   └── README
├── db
│   ├── migration
│   └── sm
├── ENTRY
├── lib
├── log
├── prv
├── pub
│   ├── css
│   ├── img
│   │   └── upload
│   └── js
├── README
├── sys
│   ├── i18n
│   │   ├── json
│   │   ├── po
│   │   └── sxml
│   └── pages
└── test
    ├── benchmark
    │   └── README
    ├── functional
    └── unit
#+end_src

- **lib** is where you put your own modules for the app, and the third-part modules could be put into it. The load path will be added automatically when the server core start.

- **log** is expected to put logs, however, it's not actually used yet.

- **prv** is a place to put your private stuffs, like API token or password in text. This should never be added to git.

*** Temporary files

Since GNU Artanis 1.1.0, the **tmp** directory was moved to **/tmp/your_app_name-xxxxx**. Each time you run **art work**, the related temporary directory will be regenerated. The purpose is to make application folder functional and clean. We support GNU Guix to make the application folder read-only.

