docs/manual.html
<div id="outline-container-orgfa4966a" class="outline-3">
<h3 id="orgfa4966a"><span class="section-number-3">5.6.</span> Database operating</h3>
<div class="outline-text-3" id="text-5-6">
<p>
GNU Artanis supports mysql/postgresql/sqlite3. We use mysql as an example here.
</p>

<p>
Please ensure that your DB service was started before you run this code.
</p>

<p>
<b><i>If you encounter any problems, it's very likely it's with your DB config.</i></b>
</p>

<p>
You can use a DB (such as mysql) with GUI tools such as "adminer", independently of the running web-server, e.g. artanis-based.
</p>
<div class="org-src-container">
<pre class="src src-scheme">(use-modules (artanis artanis))
(init-server)
(<span style="color: #4169e1;">define</span> <span style="color: #ffd700;">conn</span> (connect-db 'mysql <span style="font-weight: bold;">#:db-username</span> <span style="color: #ff0000;">"your_db_username"</span>
                         <span style="font-weight: bold;">#:db-name</span> <span style="color: #ff0000;">"your_db_name"</span> <span style="font-weight: bold;">#:db-passwd</span> <span style="color: #ff0000;">"your_passwd"</span>))
(<span style="color: #4169e1;">define</span> <span style="color: #ffd700;">mtable</span> (map-table-from-DB conn))
((mtable 'create 'Persons '((name varchar 10)
                            (age integer)
                            (email varchar 20)))
 'valid?)
<span style="color: #66cdaa;">;; </span><span style="color: #66cdaa;">==&gt; #t</span>
(mtable 'set 'Persons <span style="font-weight: bold;">#:name</span> <span style="color: #ff0000;">"nala"</span> <span style="font-weight: bold;">#:age</span> 20 <span style="font-weight: bold;">#:email</span> <span style="color: #ff0000;">"nala@artanis.dev"</span>)
(mtable 'get 'Persons <span style="font-weight: bold;">#:columns</span> '(name email))
<span style="color: #66cdaa;">;; </span><span style="color: #66cdaa;">==&gt; ((("name" . "nala") ("email" . "nala@artanis.com")))</span>
</pre>
</div>

<ul class="org-ul">
<li><i>map-table-from-DB</i> is the GNU Artanis API handling tables in a DB. Here, we define this mapping as the var <i>mtable</i>.</li>
</ul>


<ul class="org-ul">
<li>We can use <i>mtable</i> to handle tables, you can get the values from a table with the 'get command.</li>
</ul>


<ul class="org-ul">
<li><i>mtable</i> is a function which accepts the first argument as a command, say 'create, which is a command to create a new table. 'set is used to insert/update values in the table. And the 'get command to fetch the values of specific columns.</li>
</ul>


<ul class="org-ul">
<li>The second argument of <i>mtable</i> is the name of the table as you can guess. Please note that it is case sensitive, while the column name isn't.</li>
</ul>


<ul class="org-ul">
<li>The <i><b>'create</b></i> command returns a function too, which also accepts an argument as a command. Here, we use the <i><b>'valid?</b></i> command to check if the table has been created successfully.</li>
</ul>

<p>
This was just a simple introduction. You may read the DB section in this manual for details.
</p>

<p>
Of course, you can use DB in your web application.
</p>
<div class="org-src-container">
<pre class="src src-scheme">(get <span style="color: #ff0000;">"/dbtest"</span> <span style="font-weight: bold;">#:conn</span> #t <span style="color: #66cdaa;">; </span><span style="color: #66cdaa;">apply for a DB connection from pool</span>
     (<span style="color: #4169e1;">lambda</span> (rc)
       (<span style="color: #4169e1;">let</span> ((mtable (map-table-from-DB (<span style="font-weight: bold;">:conn</span> rc))))
         (object-&gt;string
          (mtable 'get 'Persons <span style="font-weight: bold;">#:columns</span> '(name email))))))

(run <span style="font-weight: bold;">#:use-db?</span> #t <span style="font-weight: bold;">#:dbd</span> 'mysql <span style="font-weight: bold;">#:db-username</span> <span style="color: #ff0000;">"your_db_username"</span>
     <span style="font-weight: bold;">#:db-name</span> <span style="color: #ff0000;">"your_db_name"</span> <span style="font-weight: bold;">#:db-passwd</span> <span style="color: #ff0000;">"your_passwd"</span> <span style="font-weight: bold;">#:port</span> 8080)
</pre>
</div>

<p>
Now, try loading <a href="http://localhost:8080/dbtest">http://localhost:8080/dbtest</a> in your browser.
</p>

<p>
Here is quick explanation:
</p>
<ul class="org-ul">
<li>The keyword-value pair <code class="src src-scheme"><span style="font-weight: bold;">#:conn</span> #t</code> means applying for a DB connection from connection-pool.
Then you can use <code class="src src-scheme">(<span style="font-weight: bold;">:conn</span> rc)</code> to get the allocated connection for DB operations.</li>

<li>Finally, the handler needs to return a string as the HTTP response body, so in this example,</li>
</ul>
<p>
we have to use the Guile
  API <i>object-&gt;string</i> to convert the query result into a string.
</p>

<p>
<i>Exercise: Return a beautiful table in HTML rather than using object-&gt;string.</i>
</p>
</div>
</div>
</div>
<div id="outline-container-orge4db250" class="outline-2">
<h2 id="orge4db250"><span class="section-number-2">6.</span> Scheme Basics</h2>
<div class="outline-text-2" id="text-6">
<p>
This chapter introduces some useful documents to help you understand Scheme language.
Feel free to come back here if you have any problems with the Scheme syntax.
</p>

<p>
Scheme was introduced in 1975 by Gerald J. Sussman and Guy L. Steele Jr. and was the first dialect of Lisp to fully support lexical scoping,
first-class procedures, and continuations. In its earliest form it was a small language intended primarily for research and teaching,
supporting only a handful of predefined syntactic forms and procedures. Scheme is now a complete general-purpose programming language, though
it still derives its power from a small set of key concepts. Early implementations of the language were interpreter-based and slow, but
Guile Scheme is trying to implement sophisticated compiler that generate better optimized code, and even a plan for AOT compiler generated
native code in the future.
</p>
</div>

<div id="outline-container-orgff43995" class="outline-3">
<h3 id="orgff43995"><span class="section-number-3">6.1.</span> For newbies</h3>
<div class="outline-text-3" id="text-6-1">
<p>
If you're not familiar with Scheme and Guile in particular, here is a simple tutorial for you.
</p>

<p>
If you already know the basics of the Scheme language, please feel free to skip this section.
</p>

<p>
I would recommend newbies to type/paste the code in Guile REPL following the guide in tutorial:
<a href="http://web-artanis.com/scheme.html">Learn Scheme in 15 minutes</a>
</p>

<p>
And here's a nice section in the Guile manual for basics in Scheme:
<a href="https://www.gnu.org/software/guile/manual/guile.html#Hello-Scheme_0021">Hello Scheme</a>
</p>

<p>
Please don't spend too much time on these tutorials, the purpose is to let newbies get a little familiar with the grammar of Scheme.
</p>
</div>
</div>

<div id="outline-container-org2055689" class="outline-3">
<h3 id="org2055689"><span class="section-number-3">6.2.</span> For Pythonistas</h3>
<div class="outline-text-3" id="text-6-2">
<p>
These are good pythonic articles for Pythoners:
</p>

<ol class="org-ol">
<li><a href="http://draketo.de/proj/guile-basics/">Guile basics from the perspective of a Pythonista</a></li>
<li><a href="http://draketo.de/proj/py2guile">Going from Python to Guile Scheme</a></li>
</ol>

<p>
Still, please don't spend too much time on them, the purpose is to let newbies get a little familiar with the grammar of Scheme.
</p>
</div>
</div>

<div id="outline-container-orgb88324d" class="outline-3">
<h3 id="orgb88324d"><span class="section-number-3">6.3.</span> For Rubyist</h3>
<div class="outline-text-3" id="text-6-3">
<p>
Here's a great article for Rubyist to learn Scheme:
</p>
<ol class="org-ol">
<li><a href="http://wiki.call-cc.org/chicken-for-ruby-programmers">Scheme for ruby programmers</a></li>
</ol>
</div>
</div>
<div id="outline-container-org0b98a40" class="outline-3">
<h3 id="org0b98a40"><span class="section-number-3">6.4.</span> For deep learners</h3>
<div class="outline-text-3" id="text-6-4">
<p>
These two books are very good for learning Scheme seriously:
</p>

<ol class="org-ol">
<li><a href="http://www.scheme.com/tspl4/">The Scheme Programming Language</a></li>
<li><a href="http://mitpress.mit.edu/sicp/">Structure and Interpretation of Computer Programs(SICP)</a></li>
</ol>

<p>
Please don't bother reading them if you simply want to use GNU Artanis to build your web application/site in few minutes.
</p>

<p>
And if you really want to try to work these books seriously, please ignore GNU Artanis before you are done with them.
</p>

<p>
But once you're done reading them <b>carefully</b>, you may want to write a new GNU Artanis all by yourself!
</p>

<p>
Hold your horses. ;-)
</p>
</div>
</div>
</div>
<div id="outline-container-orgc1a1e4f" class="outline-2">
<h2 id="orgc1a1e4f"><span class="section-number-2">7.</span> GNU Artanis Basics</h2>
<div class="outline-text-2" id="text-7">
</div>
