docs/manual.org
** How to run a site with GNU Artanis
This is the simplest way to run a site:
#+begin_src scheme
#!/bin/env guile
!#
(use-modules (artanis artanis))
(init-server)
(get "/hello" (lambda () "hello world"))
(run)
#+end_src
** Initialization
It's better to use (init-server) to init GNU Artanis.
#+begin_src scheme
(init-server #:statics '(png jpg jpeg ico html js css)
             #:cache-statics? #f #:exclude '())
#+end_src

src_scheme[:exports code]{#:statics} specifies the static files with the file name extensions. GNU Artanis is based on URL remapping, so the requested URL will have to end in the requested file name, matching the string defined, and returning the file without any extra defintions per file type. By default, it covers the most common static file types.

src_scheme[:exports code]{#:cache-statics?} controls whether the static files should be cached.

src_scheme[:exports code]{#:exclude} specifies the types should be excluded. This is useful when you want to generate files dynamically. Even JavaScript/CSS could be generated dynamically, so it depends your design.
** Registering handlers for HTTP methods
Please read [[URL handling][URL handling]].
** Emit a Response
#+begin_src scheme
(response-emit body #:status 200 #:headers '() #:mtime (current-time))
#+end_src

*body* is the response body, it can be a bytevector or literal string (in HTML).

src_scheme[:exports code]{#:status} is the HTTP status, 200 in default, which means OK.

src_scheme[:exports code]{#:headers} lets you specify custom HTTP headers. The headers must follow a certain format. Please read [[http://www.gnu.org/software/guile/manual/html_node/HTTP-Headers.html#Response-Headers][Response Headers]] for details.

src_scheme[:exports code]{#:mtime} specifies the modified time in the response. GNU Artanis will generate it for you when not defined.

#+begin_src scheme
(emit-response-with-file filename [headers <- '()])
#+end_src

*filename* is the filename to be sent as a response.

[headers] is the custom HTTP headers.

** Running the server
#+begin_src scheme
(run #:host #f #:port #f #:debug #f #:use-db? #f
     #:dbd #f #:db-username #f #:db-passwd #f #:db-name #f)
#+end_src

/keywords with the value #f, as default, will get the values from the config file./

But you can define them as well.

src_scheme[:exports code]{#:host} the hostname.

src_scheme[:exports code]{#:port} the socket port of the server.

src_scheme[:exports code]{#:debug} set #t if you want to enable debug mode. Logs will be more verbose.

src_scheme[:exports code]{#:use-db?} set #t if you want to use DB, and GNU Artanis will initialize DB connections.

src_scheme[:exports code]{#:dbd} choose a dbd. These are the supported three: mysql, postgresql, and sqlite3.

src_scheme[:exports code]{#:db-username} the username of your DB server.

src_scheme[:exports code]{#:db-passwd} the DB password for the user above.

src_scheme[:exports code]{#:db-name} the DB name to use.
** Working with Nginx
You may try GNU Artanis+Nginx with a reverse proxy.

*/Although GNU Artanis has good server core, I would recommend you use Nginx as the front server. In addition to the enhanced
performance, it'll also be less vulnerable to attacks./*

These are some sample lines for /etc/nginx/nginx.conf:

#+begin_src conf
location / {
proxy_pass http://127.0.0.1:1234;
proxy_set_header Host $host;
proxy_set_header X-Real-IP $remote_addr;
proxy_set_header X-Forwarded-For $proxy_add_x_forwarded_for;
}
#+end_src
To make it work, restart Nginx after editing the file:

#+begin_src null
sudo service nginx restart
#+end_src

And run GNU Artanis:
#+begin_src scheme
(run #:port 1234)
#+end_src
* The Art command line
GNU Artanis provides the *art* command line tool to save users' time.
** art create
If you want to set up your site/app in an application directory, and take advantage
of the MVC features, you have to use this command to create the application directory
first.

#+begin_src nil
art create proj_path
#+end_src
** art draw
This command will generate the specified components:
#+begin_src nil
Usage:
  art draw <component> NAME [options]

component list:
  model
  controller
  migration
  view
  lib

Options:
  -h, [--help]     # Print this screen
  -d, [--dry]      # Dry run but do not make any changes
  -f, [--force]    # Overwrite files that already exist
  -s, [--skip]     # Skip files that already exist
                   # If -s and -f are both provided, -f will be enabled
  -q, [--quiet]    # Suppress status output

Example:
  art draw model myblog
#+end_src

Please see [[MVC][MVC]] to learn more about how to use these components.
** art api
This command is used to generate RESTful API skeleton.
#+BEGIN_SRC nil
Usage:
  art api [options]

Options:
  -h, [--help]     # Print this screen
  -d, [--dry]      # Dry run but do not make any changes
  -f, [--force]    # Overwrite files that already exist
  -s, [--skip]     # Skip files that already exist
                   # If -s and -f are both provided, -f will be enabled
  -q, [--quiet]    # Suppress status output
  -l, [--list]     # List all defined APIs
  -m, [--mode]     # Specify the WebAPI mode, the default is "restful"
  -v, [--ver]      # Specify the WebAPI version, omit it to auto detect
  -c, [--create]   # Create WebAPI

Example:
  art api -c
  art api -c -v v3
#+END_SRC
Please see [[RESTful API][RESTful API]] for more details.
** art migrate
Migrate is used for Database migration.
#+begin_src nil
Usage:
  art migrate operator name [OPTIONS]

Operators:
  up
  down

OPTIONS:
  VERSION=version
#+end_src
Please see [[Migration][Migration]] for more detail.
