docs/manual.html
<div id="outline-container-orgd132cd9" class="outline-3">
<h3 id="orgd132cd9"><span class="section-number-3">7.1.</span> How to run a site with GNU Artanis</h3>
<div class="outline-text-3" id="text-7-1">
<p>
This is the simplest way to run a site:
</p>
<div class="org-src-container">
<pre class="src src-scheme">#!/bin/env guile
!#
(use-modules (artanis artanis))
(init-server)
(get <span style="color: #ff0000;">"/hello"</span> (<span style="color: #4169e1;">lambda</span> () <span style="color: #ff0000;">"hello world"</span>))
(run)
</pre>
</div>
</div>
</div>
<div id="outline-container-org6edfd21" class="outline-3">
<h3 id="org6edfd21"><span class="section-number-3">7.2.</span> Initialization</h3>
<div class="outline-text-3" id="text-7-2">
<p>
It's better to use (init-server) to init GNU Artanis.
</p>
<div class="org-src-container">
<pre class="src src-scheme">(init-server <span style="font-weight: bold;">#:statics</span> '(png jpg jpeg ico html js css)
             <span style="font-weight: bold;">#:cache-statics?</span> #f <span style="font-weight: bold;">#:exclude</span> '())
</pre>
</div>

<p>
<code class="src src-scheme"><span style="font-weight: bold;">#:statics</span></code> specifies the static files with the file name extensions. GNU Artanis is based on URL remapping, so the requested URL will have to end in the requested file name, matching the string defined, and returning the file without any extra defintions per file type. By default, it covers the most common static file types.
</p>

<p>
<code class="src src-scheme"><span style="font-weight: bold;">#:cache-statics?</span></code> controls whether the static files should be cached.
</p>

<p>
<code class="src src-scheme"><span style="font-weight: bold;">#:exclude</span></code> specifies the types should be excluded. This is useful when you want to generate files dynamically. Even JavaScript/CSS could be generated dynamically, so it depends your design.
</p>
</div>
</div>
<div id="outline-container-org104d664" class="outline-3">
<h3 id="org104d664"><span class="section-number-3">7.3.</span> Registering handlers for HTTP methods</h3>
<div class="outline-text-3" id="text-7-3">
<p>
Please read <a href="#org930d4bb">URL handling</a>.
</p>
</div>
</div>
<div id="outline-container-org2c54bd3" class="outline-3">
<h3 id="org2c54bd3"><span class="section-number-3">7.4.</span> Emit a Response</h3>
<div class="outline-text-3" id="text-7-4">
<div class="org-src-container">
<pre class="src src-scheme">(response-emit body <span style="font-weight: bold;">#:status</span> 200 <span style="font-weight: bold;">#:headers</span> '() <span style="font-weight: bold;">#:mtime</span> (current-time))
</pre>
</div>

<p>
<b>body</b> is the response body, it can be a bytevector or literal string (in HTML).
</p>

<p>
<code class="src src-scheme"><span style="font-weight: bold;">#:status</span></code> is the HTTP status, 200 in default, which means OK.
</p>

<p>
<code class="src src-scheme"><span style="font-weight: bold;">#:headers</span></code> lets you specify custom HTTP headers. The headers must follow a certain format. Please read <a href="http://www.gnu.org/software/guile/manual/html_node/HTTP-Headers.html#Response-Headers">Response Headers</a> for details.
</p>

<p>
<code class="src src-scheme"><span style="font-weight: bold;">#:mtime</span></code> specifies the modified time in the response. GNU Artanis will generate it for you when not defined.
</p>

<div class="org-src-container">
<pre class="src src-scheme">(emit-response-with-file filename [headers &lt;- '()])
</pre>
</div>

<p>
<b>filename</b> is the filename to be sent as a response.
</p>

<p>
[headers] is the custom HTTP headers.
</p>
</div>
</div>

<div id="outline-container-org40c20df" class="outline-3">
<h3 id="org40c20df"><span class="section-number-3">7.5.</span> Running the server</h3>
<div class="outline-text-3" id="text-7-5">
<div class="org-src-container">
<pre class="src src-scheme">(run <span style="font-weight: bold;">#:host</span> #f <span style="font-weight: bold;">#:port</span> #f <span style="font-weight: bold;">#:debug</span> #f <span style="font-weight: bold;">#:use-db?</span> #f
     <span style="font-weight: bold;">#:dbd</span> #f <span style="font-weight: bold;">#:db-username</span> #f <span style="font-weight: bold;">#:db-passwd</span> #f <span style="font-weight: bold;">#:db-name</span> #f)
</pre>
</div>

<p>
<i>keywords with the value #f, as default, will get the values from the config file.</i>
</p>

<p>
But you can define them as well.
</p>

<p>
<code class="src src-scheme"><span style="font-weight: bold;">#:host</span></code> the hostname.
</p>

<p>
<code class="src src-scheme"><span style="font-weight: bold;">#:port</span></code> the socket port of the server.
</p>

<p>
<code class="src src-scheme"><span style="font-weight: bold;">#:debug</span></code> set #t if you want to enable debug mode. Logs will be more verbose.
</p>

<p>
<code class="src src-scheme"><span style="font-weight: bold;">#:use-db?</span></code> set #t if you want to use DB, and GNU Artanis will initialize DB connections.
</p>

<p>
<code class="src src-scheme"><span style="font-weight: bold;">#:dbd</span></code> choose a dbd. These are the supported three: mysql, postgresql, and sqlite3.
</p>

<p>
<code class="src src-scheme"><span style="font-weight: bold;">#:db-username</span></code> the username of your DB server.
</p>

<p>
<code class="src src-scheme"><span style="font-weight: bold;">#:db-passwd</span></code> the DB password for the user above.
</p>

<p>
<code class="src src-scheme"><span style="font-weight: bold;">#:db-name</span></code> the DB name to use.
</p>
</div>
</div>
<div id="outline-container-orgbe85541" class="outline-3">
<h3 id="orgbe85541"><span class="section-number-3">7.6.</span> Working with Nginx</h3>
<div class="outline-text-3" id="text-7-6">
<p>
You may try GNU Artanis+Nginx with a reverse proxy.
</p>

<p>
<b><i>Although GNU Artanis has good server core, I would recommend you use Nginx as the front server. In addition to the enhanced
performance, it'll also be less vulnerable to attacks.</i></b>
</p>

<p>
These are some sample lines for /etc/nginx/nginx.conf:
</p>

<div class="org-src-container">
<pre class="src src-conf"><span style="color: #00ffff;">location /</span> {
proxy_pass http://127.0.0.1:1234;
proxy_set_header Host $host;
proxy_set_header X-Real-IP $remote_addr;
proxy_set_header X-Forwarded-For $proxy_add_x_forwarded_for;
}
</pre>
</div>
<p>
To make it work, restart Nginx after editing the file:
</p>

<div class="org-src-container">
<pre class="src src-null">sudo service nginx restart
</pre>
</div>

<p>
And run GNU Artanis:
</p>
<div class="org-src-container">
<pre class="src src-scheme">(run <span style="font-weight: bold;">#:port</span> 1234)
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgb43de67" class="outline-2">
<h2 id="orgb43de67"><span class="section-number-2">8.</span> The Art command line</h2>
<div class="outline-text-2" id="text-8">
<p>
GNU Artanis provides the <b>art</b> command line tool to save users' time.
</p>
</div>
<div id="outline-container-orgbedf36a" class="outline-3">
<h3 id="orgbedf36a"><span class="section-number-3">8.1.</span> art create</h3>
<div class="outline-text-3" id="text-8-1">
<p>
If you want to set up your site/app in an application directory, and take advantage
of the MVC features, you have to use this command to create the application directory
first.
</p>

<div class="org-src-container">
<pre class="src src-nil">art create proj_path
</pre>
</div>
</div>
</div>
<div id="outline-container-org5ac0d50" class="outline-3">
<h3 id="org5ac0d50"><span class="section-number-3">8.2.</span> art draw</h3>
<div class="outline-text-3" id="text-8-2">
<p>
This command will generate the specified components:
</p>
<div class="org-src-container">
<pre class="src src-nil">Usage:
  art draw &lt;component&gt; NAME [options]

component list:
  model
  controller
  migration
  view
  lib

Options:
  -h, [--help]     # Print this screen
  -d, [--dry]      # Dry run but do not make any changes
  -f, [--force]    # Overwrite files that already exist
  -s, [--skip]     # Skip files that already exist
                   # If -s and -f are both provided, -f will be enabled
  -q, [--quiet]    # Suppress status output

Example:
  art draw model myblog
</pre>
</div>

<p>
Please see <a href="#org0b08188">MVC</a> to learn more about how to use these components.
</p>
</div>
</div>
<div id="outline-container-org7105051" class="outline-3">
<h3 id="org7105051"><span class="section-number-3">8.3.</span> art api</h3>
<div class="outline-text-3" id="text-8-3">
<p>
This command is used to generate RESTful API skeleton.
</p>
<div class="org-src-container">
<pre class="src src-nil">Usage:
  art api [options]

Options:
  -h, [--help]     # Print this screen
  -d, [--dry]      # Dry run but do not make any changes
  -f, [--force]    # Overwrite files that already exist
  -s, [--skip]     # Skip files that already exist
                   # If -s and -f are both provided, -f will be enabled
  -q, [--quiet]    # Suppress status output
  -l, [--list]     # List all defined APIs
  -m, [--mode]     # Specify the WebAPI mode, the default is "restful"
  -v, [--ver]      # Specify the WebAPI version, omit it to auto detect
  -c, [--create]   # Create WebAPI

Example:
  art api -c
  art api -c -v v3
</pre>
</div>
<p>
Please see <a href="#org10423ad">RESTful API</a> for more details.
</p>
</div>
</div>
<div id="outline-container-orge62aed8" class="outline-3">
<h3 id="orge62aed8"><span class="section-number-3">8.4.</span> art migrate</h3>
<div class="outline-text-3" id="text-8-4">
<p>
Migrate is used for Database migration.
</p>
<div class="org-src-container">
<pre class="src src-nil">Usage:
  art migrate operator name [OPTIONS]

Operators:
  up
  down

OPTIONS:
  VERSION=version
</pre>
</div>
<p>
Please see <a href="#orgbd38915">Migration</a> for more detail.
</p>
</div>
</div>
