docs/manual.org
** art work
This command is used to start the server when run in a project directory:
#+begin_src nil
Usage:
  art work [options]

Options:
  -c, [--config=CONFIG]          # Specify config file
                                   Default: conf/artanis.conf
                                            if no, /etc/artanis/artanis.conf
  -h, [--host=HOST]              # Specify the network host
                                   Default: 0.0.0.0
  -d, [--usedb]                  # Whether to use Database
                                   Default: false
  -b, [--dbd=DBD]                # Specify DBD, mysql/postgresql/sqlit3
                                   Default: mysql
  -n, [--name=DATABASE_NAME]     # Database name
                                   Default: artanis
  -w, [--passwd=PASSWD]          # Database password
                                   Default: none
  -u, [--user=USER]              # Database user name
                                   Default: root
  -p, [--port=PORT]              # Specify listening port
                                   Default: 3000
  -g, [--debug]                  # Debug mode
                                   Default: disable
  -s, [--server=SERVER]          # Specify server core
                                   Default: Ragnarok (New server core since 0.2)
  --refresh                      # Clean caches, and force to re-compile all source code.
  --help                         # Show this screen
#+end_src

+ For server core alternatives, please see src_config[:exports code]{server.config} in config.
+ For Database (DBD) alternatives, please see src_config[:exports code]{database.config} in config.

*NOTE:* Please make sure use src_bash[:exports code]{art work --refresh} to recompile WebApp code each time you upgrade GNU Artanis.
And if you want to clean the caches for debug, src_bash[:exports code]{--refresh} is also your friend.
* URL remapping
** Introduction to URL remapping
URL remapping is used to modify a web URL's appearance to provide short, pretty or fancy, search engine friendly URLs.
It's largely used in modern WAFs(web application framework) to provide RESTful web APIs.
** URL handling
According to RFC2616, the methods include GET, POST, etc. However, because of the naming conflict, GNU Artanis provides
the methods by this list:
- get
- post
- put
- patch
- page-delete
- page-options

/In GNU Artanis the HEAD method is handled by the server, so you can't define specific handlers directly for it within GNU Artanis./

Usage:
#+begin_src scheme
(method rule handler)
#+end_src

And the handler could be one of two types, depending on your needs:
#+begin_src scheme
(lambda ()
  ...
  ret)

(lambda (rc)
  ...
  ret)
#+end_src

*ret* also has two types:

+ 1. literal string as the returned response body

+ 2. See [[Emit a Response][Emit a Response]]

#+begin_src scheme
(get "/hello" (lambda () "hello world"))
#+end_src

For a POST method:
#+begin_src scheme
(post "/auth" (lambda (rc) ...))
#+end_src
** OPTIONS method
OPTIONS method is used to return the other methods supported by the server-side at the given URL.
By default in GNU Artanis, for a specified URL, every method whose handler was registerted would be added to its own OPTIONS list.

If you want to deny certain methods for security consideration, you may need to set *server.allowedmethods* in config.

*NOTE:* If you're not trying to use Cross-Origin Resource Sharing (CORS), then you may not need to care about it.
** Get parameters from a URL
#+begin_src scheme
(params rc name)
;; e.g
(get "/hello/:who" (lambda (rc) (params rc "who")))
#+end_src
** Redirecting
#+begin_src scheme
(redirect-to rc path #:status 301 #:type '(text/html) #:headers '())
;; e.g
(get "/aaa" (lambda (rc) (redirect-to rc "/bbb")))
(get "/bbb" (lambda () "ok bbb"))
#+end_src

The *path* could be 2 possible patterns:
- URI created by [[https://www.gnu.org/software/guile/manual/html_node/URIs.html][string->uri]]. For example, src_scheme[:exports code]{(redirect-to rc (string->uri "https://nalaginrut.com/feed/atom"))}.
- A relative path which will finally be converted to absolute URL append the *host.addr*.
  For example, src_scheme[:exports code]{(redirect-to rc "/login")}.

*NOTE:* redirect-to will always use absolute URL implicitly. Although the standard supports relative URL,
there maybe some problems when you're behind a proxy. So we use absolute URL to avoid these issues.
* Route context
Route context is a struct type object which encapsulates the necessary information for the server from the current request context.
We named it /route/ because it's related to the route of [[URL remapping][URL remapping]].
Usually it's passed to the page handler as a unique argument. It's supposed to provide sufficient data about the current request.

#+BEGIN_SRC scheme
(HTTP-METHOD URL-rule (lambda (<route-context>) ...))
;; e.g:
(get "/hello" (lambda (rc) "world")) ; rc is <route-context> type
#+END_SRC

