docs/manual.html
<div id="outline-container-org791abde" class="outline-3">
<h3 id="org791abde"><span class="section-number-3">8.5.</span> art work</h3>
<div class="outline-text-3" id="text-8-5">
<p>
This command is used to start the server when run in a project directory:
</p>
<div class="org-src-container">
<pre class="src src-nil">Usage:
  art work [options]

Options:
  -c, [--config=CONFIG]          # Specify config file
                                   Default: conf/artanis.conf
                                            if no, /etc/artanis/artanis.conf
  -h, [--host=HOST]              # Specify the network host
                                   Default: 0.0.0.0
  -d, [--usedb]                  # Whether to use Database
                                   Default: false
  -b, [--dbd=DBD]                # Specify DBD, mysql/postgresql/sqlit3
                                   Default: mysql
  -n, [--name=DATABASE_NAME]     # Database name
                                   Default: artanis
  -w, [--passwd=PASSWD]          # Database password
                                   Default: none
  -u, [--user=USER]              # Database user name
                                   Default: root
  -p, [--port=PORT]              # Specify listening port
                                   Default: 3000
  -g, [--debug]                  # Debug mode
                                   Default: disable
  -s, [--server=SERVER]          # Specify server core
                                   Default: Ragnarok (New server core since 0.2)
  --refresh                      # Clean caches, and force to re-compile all source code.
  --help                         # Show this screen
</pre>
</div>

<ul class="org-ul">
<li>For server core alternatives, please see <code class="src src-config">server.config</code> in config.</li>
<li>For Database (DBD) alternatives, please see <code class="src src-config">database.config</code> in config.</li>
</ul>

<p>
<b>NOTE:</b> Please make sure use <code class="src src-bash">art work --refresh</code> to recompile WebApp code each time you upgrade GNU Artanis.
And if you want to clean the caches for debug, <code class="src src-bash">--refresh</code> is also your friend.
</p>
</div>
</div>
</div>
<div id="outline-container-org3d35f2b" class="outline-2">
<h2 id="org3d35f2b"><span class="section-number-2">9.</span> URL remapping</h2>
<div class="outline-text-2" id="text-9">
</div>
<div id="outline-container-orge1e9879" class="outline-3">
<h3 id="orge1e9879"><span class="section-number-3">9.1.</span> Introduction to URL remapping</h3>
<div class="outline-text-3" id="text-9-1">
<p>
URL remapping is used to modify a web URL's appearance to provide short, pretty or fancy, search engine friendly URLs.
It's largely used in modern WAFs(web application framework) to provide RESTful web APIs.
</p>
</div>
</div>
<div id="outline-container-org930d4bb" class="outline-3">
<h3 id="org930d4bb"><span class="section-number-3">9.2.</span> URL handling</h3>
<div class="outline-text-3" id="text-9-2">
<p>
According to RFC2616, the methods include GET, POST, etc. However, because of the naming conflict, GNU Artanis provides
the methods by this list:
</p>
<ul class="org-ul">
<li>get</li>
<li>post</li>
<li>put</li>
<li>patch</li>
<li>page-delete</li>
<li>page-options</li>
</ul>

<p>
<i>In GNU Artanis the HEAD method is handled by the server, so you can't define specific handlers directly for it within GNU Artanis.</i>
</p>

<p>
Usage:
</p>
<div class="org-src-container">
<pre class="src src-scheme">(method rule handler)
</pre>
</div>

<p>
And the handler could be one of two types, depending on your needs:
</p>
<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #4169e1;">lambda</span> ()
  ...
  ret)

(<span style="color: #4169e1;">lambda</span> (rc)
  ...
  ret)
</pre>
</div>

<p>
<b>ret</b> also has two types:
</p>

<ul class="org-ul">
<li>1. literal string as the returned response body</li>

<li>2. See <a href="#org2c54bd3">Emit a Response</a></li>
</ul>

<div class="org-src-container">
<pre class="src src-scheme">(get <span style="color: #ff0000;">"/hello"</span> (<span style="color: #4169e1;">lambda</span> () <span style="color: #ff0000;">"hello world"</span>))
</pre>
</div>

<p>
For a POST method:
</p>
<div class="org-src-container">
<pre class="src src-scheme">(post <span style="color: #ff0000;">"/auth"</span> (<span style="color: #4169e1;">lambda</span> (rc) ...))
</pre>
</div>
</div>
</div>
<div id="outline-container-orgb636c35" class="outline-3">
<h3 id="orgb636c35"><span class="section-number-3">9.3.</span> OPTIONS method</h3>
<div class="outline-text-3" id="text-9-3">
<p>
OPTIONS method is used to return the other methods supported by the server-side at the given URL.
By default in GNU Artanis, for a specified URL, every method whose handler was registerted would be added to its own OPTIONS list.
</p>

<p>
If you want to deny certain methods for security consideration, you may need to set <b>server.allowedmethods</b> in config.
</p>

<p>
<b>NOTE:</b> If you're not trying to use Cross-Origin Resource Sharing (CORS), then you may not need to care about it.
</p>
</div>
</div>
<div id="outline-container-orga37ed10" class="outline-3">
<h3 id="orga37ed10"><span class="section-number-3">9.4.</span> Get parameters from a URL</h3>
<div class="outline-text-3" id="text-9-4">
<div class="org-src-container">
<pre class="src src-scheme">(params rc name)
<span style="color: #66cdaa;">;; </span><span style="color: #66cdaa;">e.g</span>
(get <span style="color: #ff0000;">"/hello/:who"</span> (<span style="color: #4169e1;">lambda</span> (rc) (params rc <span style="color: #ff0000;">"who"</span>)))
</pre>
</div>
</div>
</div>
<div id="outline-container-orgb993091" class="outline-3">
<h3 id="orgb993091"><span class="section-number-3">9.5.</span> Redirecting</h3>
<div class="outline-text-3" id="text-9-5">
<div class="org-src-container">
<pre class="src src-scheme">(redirect-to rc path <span style="font-weight: bold;">#:status</span> 301 <span style="font-weight: bold;">#:type</span> '(text/html) <span style="font-weight: bold;">#:headers</span> '())
<span style="color: #66cdaa;">;; </span><span style="color: #66cdaa;">e.g</span>
(get <span style="color: #ff0000;">"/aaa"</span> (<span style="color: #4169e1;">lambda</span> (rc) (redirect-to rc <span style="color: #ff0000;">"/bbb"</span>)))
(get <span style="color: #ff0000;">"/bbb"</span> (<span style="color: #4169e1;">lambda</span> () <span style="color: #ff0000;">"ok bbb"</span>))
</pre>
</div>

<p>
The <b>path</b> could be 2 possible patterns:
</p>
<ul class="org-ul">
<li>URI created by <a href="https://www.gnu.org/software/guile/manual/html_node/URIs.html">string-&gt;uri</a>. For example, <code class="src src-scheme">(redirect-to rc (string-&gt;uri <span style="color: #ff0000;">"https://nalaginrut.com/feed/atom"</span>))</code>.</li>
<li>A relative path which will finally be converted to absolute URL append the <b>host.addr</b>.
For example, <code class="src src-scheme">(redirect-to rc <span style="color: #ff0000;">"/login"</span>)</code>.</li>
</ul>

<p>
<b>NOTE:</b> redirect-to will always use absolute URL implicitly. Although the standard supports relative URL,
there maybe some problems when you're behind a proxy. So we use absolute URL to avoid these issues.
</p>
</div>
</div>
</div>
<div id="outline-container-org044c7e5" class="outline-2">
<h2 id="org044c7e5"><span class="section-number-2">10.</span> Route context</h2>
<div class="outline-text-2" id="text-10">
<p>
Route context is a struct type object which encapsulates the necessary information for the server from the current request context.
We named it <i>route</i> because it's related to the route of <a href="#org3d35f2b">URL remapping</a>.
Usually it's passed to the page handler as a unique argument. It's supposed to provide sufficient data about the current request.
</p>

<div class="org-src-container">
<pre class="src src-scheme">(HTTP-METHOD URL-rule (<span style="color: #4169e1;">lambda</span> (<span style="color: #00ffff;">&lt;route-context&gt;</span>) ...))
<span style="color: #66cdaa;">;; </span><span style="color: #66cdaa;">e.g:</span>
(get <span style="color: #ff0000;">"/hello"</span> (<span style="color: #4169e1;">lambda</span> (rc) <span style="color: #ff0000;">"world"</span>)) <span style="color: #66cdaa;">; </span><span style="color: #66cdaa;">rc is &lt;route-context&gt; type</span>
</pre>
</div>
</div>
