docs/manual.org
** Route context APIs

#+BEGIN_SRC scheme
(rc-path <route-context>)
#+END_SRC
+ Get the requested path, that is to say, the actual URI visited by the client.

#+BEGIN_SRC scheme
;; e.g
(get "/hello/world" (lambda (rc) (rc-path rc)))
;; visit localhost:3000/hello/world or from any port you specified
;; the result is "/hello/world".
(get "/hello/:who" (lambda (rc) (rc-path rc)))
;; visit localhost:3000/hello/world or from any port you specified
;; the result is "/hello/world".
#+END_SRC

#+BEGIN_SRC scheme
(rc-req <route-context>)
#+END_SRC
+ Get the current HTTP request wrapped in record-type. About HTTP request
  please see [[https://www.gnu.org/software/guile/manual/html_node/Requests.html][HTTP Request]]. It stores HTTP request of Guile.

#+BEGIN_SRC scheme
(rc-body <route-context>)
#+END_SRC
+ Get the current request body:
  + For a regular HTTP request, the body should be a bytevector;
  + For a Websocket request, the body should be [[Websocket frame][Websocket frame]] as a record-type.

#+BEGIN_SRC  scheme
(rc-method <route-context>)
#+END_SRC
+ Get the current requested HTTP method.

#+BEGIN_SRC scheme
(rc-conn <route-context>)
#+END_SRC
+ Get the current DB connection if you've requested one, please checkout [[DB shortcut][DB shortcut]].

#+BEGIN_SRC scheme
(rc-qt <route-context>)
#+END_SRC
+ Get query table, which is a key-value list parsed from [[Query String][query string]].

#+BEGIN_SRC scheme
(rc-handler <route-context>)
#+END_SRC
+ Get the current request handler. The tricky part is that you can only get this handler
  within this handler unless you can go no where to run /rc-handler/ correctly.
  + It's on your own risk to use this API. But now that we have powerful first class lambda,
    you may do some magic. Well, depends on you.

#+BEGIN_SRC scheme
(rc-mtime <route-context>) ; getter
(rc-mtime! <route-context>) ; setter
#+END_SRC
+ You may set it in the handler to return you customized modified time.
  For static pages, the mtime is set automatically. But sometimes people
  may want to set it in a dynamic generated page.

#+BEGIN_SRC scheme
(rc-cookie <route-context>)
#+END_SRC
+ The cookies parsed from request header.

#+BEGIN_SRC scheme
(rc-set-cookie! <route-context>)
#+END_SRC
+ Set response cookie from server side. If you want to return cookies to
  the client, please use it.

There're other APIs in /route-context/, but they're largely used for
internals of Artanis, rarely useful for users. So we don't list them here.
* Page status handling
** HTTP status code
HTTP response status codes are the error numbers show the status of a specific HTTP request. The responses are grouped in five classes:
- Informational responses (100–199)
- Successful responses (200–299)
- Redirects (300–399)
- Client errors (400–499)
- Server errors (500–599)
** The default behaviour of status handling
On success, GNU Artanis returns the status code 200.

If there's any issue prevents GNU Artanis to generate requested result successfully, then it'll throw the relavent exception somewhere issue
happened. And finally it will be caught by the server-core. In theory, the status code other than 200 will trigger a system page generating
operation. By default, status pages are put in */etc/artanis/pages*, but you may override it in *your_app_folder/sys/pages*. Each system page
named with the status code, say, *404.html*. So you may easily customize your preferred status page.
** Dynamic status page generating
Sometimes you may need more complex status page generating. For example, you want to put a random public service advertising when the visitors
encountered a 404 (page missing). Then you can do it like this:
#+BEGIN_SRC scheme
(http-status status-code thunk-handler)
#+END_SRC
- *status-code* must be an integer between 100~599.
- *Thunk* implies a function without any argument.
Let's see an example:

#+BEGIN_SRC scheme
;; You may put this code in any controller module.
(http-status 404
 (lambda ()
   (view-render "psd_404" (the-environment))))
#+END_SRC

In this example, "psd" stands for public-service-advertising, and "psd_404" tells the *view-render* to find "psd_404.html" in
*your_app_folder/sys/pages/psd_404.html*. So you can render the HTML template to generate a status page. Of course, there're a few ways to
implement the similar idea. If you don't want to render template on the backend, you may generate a JSON and let the frontend framework to
generate it.
* MVC
MVC is Model-View-Controller, the most classic architectural pattern for implementing
user interfaces.
It divides a given software application into three interconnected parts, so as to
separate internal representations of information from the ways that information is
presented to or accepted from the user.
