docs/manual.html

<div id="outline-container-org7be6511" class="outline-3">
<h3 id="org7be6511"><span class="section-number-3">10.1.</span> Route context APIs</h3>
<div class="outline-text-3" id="text-10-1">
<div class="org-src-container">
<pre class="src src-scheme">(rc-path <span style="color: #00ffff;">&lt;route-context&gt;</span>)
</pre>
</div>
<ul class="org-ul">
<li>Get the requested path, that is to say, the actual URI visited by the client.</li>
</ul>

<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #66cdaa;">;; </span><span style="color: #66cdaa;">e.g</span>
(get <span style="color: #ff0000;">"/hello/world"</span> (<span style="color: #4169e1;">lambda</span> (rc) (rc-path rc)))
<span style="color: #66cdaa;">;; </span><span style="color: #66cdaa;">visit localhost:3000/hello/world or from any port you specified</span>
<span style="color: #66cdaa;">;; </span><span style="color: #66cdaa;">the result is "/hello/world".</span>
(get <span style="color: #ff0000;">"/hello/:who"</span> (<span style="color: #4169e1;">lambda</span> (rc) (rc-path rc)))
<span style="color: #66cdaa;">;; </span><span style="color: #66cdaa;">visit localhost:3000/hello/world or from any port you specified</span>
<span style="color: #66cdaa;">;; </span><span style="color: #66cdaa;">the result is "/hello/world".</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-scheme">(rc-req <span style="color: #00ffff;">&lt;route-context&gt;</span>)
</pre>
</div>
<ul class="org-ul">
<li>Get the current HTTP request wrapped in record-type. About HTTP request
please see <a href="https://www.gnu.org/software/guile/manual/html_node/Requests.html">HTTP Request</a>. It stores HTTP request of Guile.</li>
</ul>

<div class="org-src-container">
<pre class="src src-scheme">(rc-body <span style="color: #00ffff;">&lt;route-context&gt;</span>)
</pre>
</div>
<ul class="org-ul">
<li>Get the current request body:
<ul class="org-ul">
<li>For a regular HTTP request, the body should be a bytevector;</li>
<li>For a Websocket request, the body should be <a href="#org78927d6">Websocket frame</a> as a record-type.</li>
</ul></li>
</ul>

<div class="org-src-container">
<pre class="src src-scheme">(rc-method <span style="color: #00ffff;">&lt;route-context&gt;</span>)
</pre>
</div>
<ul class="org-ul">
<li>Get the current requested HTTP method.</li>
</ul>

<div class="org-src-container">
<pre class="src src-scheme">(rc-conn <span style="color: #00ffff;">&lt;route-context&gt;</span>)
</pre>
</div>
<ul class="org-ul">
<li>Get the current DB connection if you've requested one, please checkout [BROKEN LINK: DB shortcut].</li>
</ul>

<div class="org-src-container">
<pre class="src src-scheme">(rc-qt <span style="color: #00ffff;">&lt;route-context&gt;</span>)
</pre>
</div>
<ul class="org-ul">
<li>Get query table, which is a key-value list parsed from <a href="#org7000d43">query string</a>.</li>
</ul>

<div class="org-src-container">
<pre class="src src-scheme">(rc-handler <span style="color: #00ffff;">&lt;route-context&gt;</span>)
</pre>
</div>
<ul class="org-ul">
<li>Get the current request handler. The tricky part is that you can only get this handler
within this handler unless you can go no where to run <i>rc-handler</i> correctly.
<ul class="org-ul">
<li>It's on your own risk to use this API. But now that we have powerful first class lambda,
you may do some magic. Well, depends on you.</li>
</ul></li>
</ul>

<div class="org-src-container">
<pre class="src src-scheme">(rc-mtime <span style="color: #00ffff;">&lt;route-context&gt;</span>) <span style="color: #66cdaa;">; </span><span style="color: #66cdaa;">getter</span>
(rc-mtime! <span style="color: #00ffff;">&lt;route-context&gt;</span>) <span style="color: #66cdaa;">; </span><span style="color: #66cdaa;">setter</span>
</pre>
</div>
<ul class="org-ul">
<li>You may set it in the handler to return you customized modified time.
For static pages, the mtime is set automatically. But sometimes people
may want to set it in a dynamic generated page.</li>
</ul>

<div class="org-src-container">
<pre class="src src-scheme">(rc-cookie <span style="color: #00ffff;">&lt;route-context&gt;</span>)
</pre>
</div>
<ul class="org-ul">
<li>The cookies parsed from request header.</li>
</ul>

<div class="org-src-container">
<pre class="src src-scheme">(rc-set-cookie! <span style="color: #00ffff;">&lt;route-context&gt;</span>)
</pre>
</div>
<ul class="org-ul">
<li>Set response cookie from server side. If you want to return cookies to
the client, please use it.</li>
</ul>

<p>
There're other APIs in <i>route-context</i>, but they're largely used for
internals of Artanis, rarely useful for users. So we don't list them here.
</p>
</div>
</div>
</div>
<div id="outline-container-org533ed50" class="outline-2">
<h2 id="org533ed50"><span class="section-number-2">11.</span> Page status handling</h2>
<div class="outline-text-2" id="text-11">
</div>
<div id="outline-container-orgb713692" class="outline-3">
<h3 id="orgb713692"><span class="section-number-3">11.1.</span> HTTP status code</h3>
<div class="outline-text-3" id="text-11-1">
<p>
HTTP response status codes are the error numbers show the status of a specific HTTP request. The responses are grouped in five classes:
</p>
<ul class="org-ul">
<li>Informational responses (100199)</li>
<li>Successful responses (200299)</li>
<li>Redirects (300399)</li>
<li>Client errors (400499)</li>
<li>Server errors (500599)</li>
</ul>
</div>
</div>
<div id="outline-container-orga7a3d06" class="outline-3">
<h3 id="orga7a3d06"><span class="section-number-3">11.2.</span> The default behaviour of status handling</h3>
<div class="outline-text-3" id="text-11-2">
<p>
On success, GNU Artanis returns the status code 200.
</p>

<p>
If there's any issue prevents GNU Artanis to generate requested result successfully, then it'll throw the relavent exception somewhere issue
happened. And finally it will be caught by the server-core. In theory, the status code other than 200 will trigger a system page generating
operation. By default, status pages are put in <b>/etc/artanis/pages</b>, but you may override it in <b>your_app_folder/sys/pages</b>. Each system page
named with the status code, say, <b>404.html</b>. So you may easily customize your preferred status page.
</p>
</div>
</div>
<div id="outline-container-org3f509d1" class="outline-3">
<h3 id="org3f509d1"><span class="section-number-3">11.3.</span> Dynamic status page generating</h3>
<div class="outline-text-3" id="text-11-3">
<p>
Sometimes you may need more complex status page generating. For example, you want to put a random public service advertising when the visitors
encountered a 404 (page missing). Then you can do it like this:
</p>
<div class="org-src-container">
<pre class="src src-scheme">(http-status status-code thunk-handler)
</pre>
</div>
<ul class="org-ul">
<li><b>status-code</b> must be an integer between 100~599.</li>
<li><b>Thunk</b> implies a function without any argument.</li>
</ul>
<p>
Let's see an example:
</p>

<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #66cdaa;">;; </span><span style="color: #66cdaa;">You may put this code in any controller module.</span>
(http-status 404
 (<span style="color: #4169e1;">lambda</span> ()
   (view-render <span style="color: #ff0000;">"psd_404"</span> (the-environment))))
</pre>
</div>

<p>
In this example, "psd" stands for public-service-advertising, and "psd_404" tells the <b>view-render</b> to find "psd_404.html" in
<b>your_app_folder/sys/pages/psd_404.html</b>. So you can render the HTML template to generate a status page. Of course, there're a few ways to
implement the similar idea. If you don't want to render template on the backend, you may generate a JSON and let the frontend framework to
generate it.
</p>
</div>
</div>
</div>
<div id="outline-container-org0b08188" class="outline-2">
<h2 id="org0b08188"><span class="section-number-2">12.</span> MVC</h2>
<div class="outline-text-2" id="text-12">
<p>
MVC is Model-View-Controller, the most classic architectural pattern for implementing
user interfaces.
It divides a given software application into three interconnected parts, so as to
separate internal representations of information from the ways that information is
presented to or accepted from the user.
</p>
</div>
