docs/manual.org
** Controllers/Views
Let's make a controller named /article/:
#+begin_src nil
art draw controller article show edit
#+end_src

/show/ and /edit/ are the name of methods for the controller named /article/.

This will generate both a *controller* and a *view* for /article/:
#+begin_src nil
drawing    controller article
working    Controllers `article.scm'
create     app/controllers/article.scm
working    Views `article'
create     app/views/article/show.html.tpl
create     app/views/article/edit.html.tpl
#+end_src

These three files are generated:
#+begin_src nil
app/controllers/article.scm
app/views/article/show.html.tpl
app/views/article/edit.html.tpl
#+end_src

Based on this, the controller /article/ will have two methods mapped to the URL rule, /show/ and /edit/.
As part of the /view/ component. An HTML template is generated for each method. For the /show/ method for example, the view file *show.html.tpl* is created.
For the /controller/ component, you get a /show/ method handler, as:
#+begin_src scheme
(article-define show
  (lambda (rc)
    "<h1>This is article#show</h1><p>Find me in app/views/article/show.html.tpl</p>"
    ;; TODO: add controller method `show'
    ;; uncomment this line if you want to render view from template
    ;; (view-render "show")
    ))
#+end_src
Of course, you're free to use or not use these templates. If you want to use the /view template/, just
uncomment the last line src_scheme[:exports code]{(view-render "show")}.

*NOTE:* The views template generated by MVC will defaultly announce FreeJS. The reason was well explained in [[ http://www.gnu.org/philosophy/javascript-trap.en.html][The Javascript Trap]].
It's optional, you may remove it with your free will, but I put it there in the hope that you can support free software with us.

For more detail about template in Views, please see [[Layouts and Rendering in GNU Artanis][Layouts and Rendering in GNU Artanis]].
** Models
Models contains operations of database.

*** Create models

A Model a is usually connected to the same named Controller. However, in practical, users may create multiple Models for one Controller. Hence, GNU Artanis creates Model outside Controller, rather than autogenerate a Model when creating Controller.

#+begin_src bash
art create mytest
cd mytest

# Create model
art draw model user
# drawing    model user
# working    Models `user.scm'

# check result
ls app/models/
# user.scm
#+end_src

In this case, we created a Model named **user**. A file named **user.scm** is in **app/models** now, let's open it:

#+begin_src scheme
(import (artanis mvc model))
;; Model user definition of mytest
;; Please add your license header here.
;; This file is generated automatically by GNU Artanis.
(create-artanis-model user) ; DO NOT REMOVE THIS LINE!!!
#+end_src

It's done! These code are self-explain.

Next, let's try to define an **user** table.

*** Define table in Model

In this example, we craete a table like this:

#+begin_src nil
+-------------------------------------------------------------+
| Field | Type        | Null | Key | Default | Extra          |
|-------+-------------+------+-----+---------+----------------|
| id    | auto        | NO   | PRI | NULL    | auto_increment |
| name  | char-field  | NO   |     | NULL    |                |
| email | char-field  | NO   |     | NULL    |                |
+-------------------------------------------------------------+
#+end_src

For Model definition syntax in GNU Artanis, we have:

#+begin_src scheme
(create-artanis-model
 user  ; model name
 (:deps) ; deps list
 (id auto (#:primary-key))
 (name char-field (#:not-null #:maxlen 128))
 (email char-field (#:not-null #:maxlen 128))
 )
#+end_src

**NOTE:** If you have definition, and you've imported in any controller, when booting GNU Artanis with src_scheme[:exports code](art work),
then the defined table will be created automatically in the specified database. Don't worry, it will be created only once.

**NOTE:** The Model name **must** be the same with Model file's name.

*** Tables dependencies

Since the tables will be auto-created when booting the server core, however, the MVC doesn't know the dependency chain. To help the auto-creation doing correct work, you may want to specify the table dependencies in the table definition:

For example, you have another Model named **article** which is designed for your blog system. Obviously, it's related to **user** table since every article requires at least one user as an author.

#+begin_src scheme
(create-artanis-model
 article  ; model name
 (:deps user) ; deps list
 (id auto (#:primary-key))
 (author_id tinyint (#:not-null))
 (title char-field (#:not-null #:maxlen 128))
 (timestamp bigint (#:unsigned #:not-null))
 )
#+end_src

You may realized we've added src_scheme[:exports code]((:deps user)) to hint the MVC system that **article** table should be created after **user** table. So when it meets **article** Model during booting, it'll make sure to create **user** then **article**.

**NOTE:**: src_scheme[:exports code]((:deps models_list ...))
**NOTE:** This feature is useful when you do DB migration.

*** Model API

The model definition API:

src_scheme[:exports code]((create-artanis-model model_name (:deps deps_list ...) fields_def ...))

The **fields_def** syntax is:

src_scheme[:exports code]((field_name type (options ...)))

