docs/manual.html
<div id="outline-container-orge90db9b" class="outline-3">
<h3 id="orge90db9b"><span class="section-number-3">12.1.</span> Controllers/Views</h3>
<div class="outline-text-3" id="text-12-1">
<p>
Let's make a controller named <i>article</i>:
</p>
<div class="org-src-container">
<pre class="src src-nil">art draw controller article show edit
</pre>
</div>

<p>
<i>show</i> and <i>edit</i> are the name of methods for the controller named <i>article</i>.
</p>

<p>
This will generate both a <b>controller</b> and a <b>view</b> for <i>article</i>:
</p>
<div class="org-src-container">
<pre class="src src-nil">drawing    controller article
working    Controllers `article.scm'
create     app/controllers/article.scm
working    Views `article'
create     app/views/article/show.html.tpl
create     app/views/article/edit.html.tpl
</pre>
</div>

<p>
These three files are generated:
</p>
<div class="org-src-container">
<pre class="src src-nil">app/controllers/article.scm
app/views/article/show.html.tpl
app/views/article/edit.html.tpl
</pre>
</div>

<p>
Based on this, the controller <i>article</i> will have two methods mapped to the URL rule, <i>show</i> and <i>edit</i>.
As part of the <i>view</i> component. An HTML template is generated for each method. For the <i>show</i> method for example, the view file <b>show.html.tpl</b> is created.
For the <i>controller</i> component, you get a <i>show</i> method handler, as:
</p>
<div class="org-src-container">
<pre class="src src-scheme">(article-define show
  (<span style="color: #4169e1;">lambda</span> (rc)
    <span style="color: #ff0000;">"&lt;h1&gt;This is article#show&lt;/h1&gt;&lt;p&gt;Find me in app/views/article/show.html.tpl&lt;/p&gt;"</span>
    <span style="color: #66cdaa;">;; </span><span style="color: #66cdaa;">TODO: add controller method `show'</span>
    <span style="color: #66cdaa;">;; </span><span style="color: #66cdaa;">uncomment this line if you want to render view from template</span>
    <span style="color: #66cdaa;">;; </span><span style="color: #66cdaa;">(view-render "show")</span>
    ))
</pre>
</div>
<p>
Of course, you're free to use or not use these templates. If you want to use the <i>view template</i>, just
uncomment the last line <code class="src src-scheme">(view-render <span style="color: #ff0000;">"show"</span>)</code>.
</p>

<p>
<b>NOTE:</b> The views template generated by MVC will defaultly announce FreeJS. The reason was well explained in [BROKEN LINK:  http://www.gnu.org/philosophy/javascript-trap.en.html].
It's optional, you may remove it with your free will, but I put it there in the hope that you can support free software with us.
</p>

<p>
For more detail about template in Views, please see <a href="#org8f45483">Layouts and Rendering in GNU Artanis</a>.
</p>
</div>
</div>
<div id="outline-container-orgf07d2ed" class="outline-3">
<h3 id="orgf07d2ed"><span class="section-number-3">12.2.</span> Models</h3>
<div class="outline-text-3" id="text-12-2">
<p>
Models contains operations of database.
</p>
</div>

<div id="outline-container-org8060817" class="outline-4">
<h4 id="org8060817"><span class="section-number-4">12.2.1.</span> Create models</h4>
<div class="outline-text-4" id="text-12-2-1">
<p>
A Model a is usually connected to the same named Controller. However, in practical, users may create multiple Models for one Controller. Hence, GNU Artanis creates Model outside Controller, rather than autogenerate a Model when creating Controller.
</p>

<div class="org-src-container">
<pre class="src src-bash">art create mytest
<span style="font-weight: bold;">cd</span> mytest

<span style="color: #66cdaa;"># </span><span style="color: #66cdaa;">Create model</span>
art draw model user
<span style="color: #66cdaa;"># </span><span style="color: #66cdaa;">drawing    model user</span>
<span style="color: #66cdaa;"># </span><span style="color: #66cdaa;">working    Models `user.scm'</span>

<span style="color: #66cdaa;"># </span><span style="color: #66cdaa;">check result</span>
ls app/models/
<span style="color: #66cdaa;"># </span><span style="color: #66cdaa;">user.scm</span>
</pre>
</div>

<p>
In this case, we created a Model named <b><b>user</b></b>. A file named <b><b>user.scm</b></b> is in <b><b>app/models</b></b> now, let's open it:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #4169e1;">import</span> (artanis mvc model))
<span style="color: #66cdaa;">;; </span><span style="color: #66cdaa;">Model user definition of mytest</span>
<span style="color: #66cdaa;">;; </span><span style="color: #66cdaa;">Please add your license header here.</span>
<span style="color: #66cdaa;">;; </span><span style="color: #66cdaa;">This file is generated automatically by GNU Artanis.</span>
(create-artanis-model user) <span style="color: #66cdaa;">; </span><span style="color: #66cdaa;">DO NOT REMOVE THIS LINE!!!</span>
</pre>
</div>

<p>
It's done! These code are self-explain.
</p>

<p>
Next, let's try to define an <b><b>user</b></b> table.
</p>
</div>
</div>

<div id="outline-container-org66c44e2" class="outline-4">
<h4 id="org66c44e2"><span class="section-number-4">12.2.2.</span> Define table in Model</h4>
<div class="outline-text-4" id="text-12-2-2">
<p>
In this example, we craete a table like this:
</p>

<div class="org-src-container">
<pre class="src src-nil">+-------------------------------------------------------------+
| Field | Type        | Null | Key | Default | Extra          |
|-------+-------------+------+-----+---------+----------------|
| id    | auto        | NO   | PRI | NULL    | auto_increment |
| name  | char-field  | NO   |     | NULL    |                |
| email | char-field  | NO   |     | NULL    |                |
+-------------------------------------------------------------+
</pre>
</div>

<p>
For Model definition syntax in GNU Artanis, we have:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(create-artanis-model
 user  <span style="color: #66cdaa;">; </span><span style="color: #66cdaa;">model name</span>
 (<span style="font-weight: bold;">:deps</span>) <span style="color: #66cdaa;">; </span><span style="color: #66cdaa;">deps list</span>
 (id auto (<span style="font-weight: bold;">#:primary-key</span>))
 (name char-field (<span style="font-weight: bold;">#:not-null</span> <span style="font-weight: bold;">#:maxlen</span> 128))
 (email char-field (<span style="font-weight: bold;">#:not-null</span> <span style="font-weight: bold;">#:maxlen</span> 128))
 )
</pre>
</div>

<p>
<b><b>NOTE:</b></b> If you have definition, and you've imported in any controller, when booting GNU Artanis with src_scheme[:exports code](art work),
then the defined table will be created automatically in the specified database. Don't worry, it will be created only once.
</p>

<p>
<b><b>NOTE:</b></b> The Model name <b><b>must</b></b> be the same with Model file's name.
</p>
</div>
</div>

<div id="outline-container-org908a060" class="outline-4">
<h4 id="org908a060"><span class="section-number-4">12.2.3.</span> Tables dependencies</h4>
<div class="outline-text-4" id="text-12-2-3">
<p>
Since the tables will be auto-created when booting the server core, however, the MVC doesn't know the dependency chain. To help the auto-creation doing correct work, you may want to specify the table dependencies in the table definition:
</p>

<p>
For example, you have another Model named <b><b>article</b></b> which is designed for your blog system. Obviously, it's related to <b><b>user</b></b> table since every article requires at least one user as an author.
</p>

<div class="org-src-container">
<pre class="src src-scheme">(create-artanis-model
 article  <span style="color: #66cdaa;">; </span><span style="color: #66cdaa;">model name</span>
 (<span style="font-weight: bold;">:deps</span> user) <span style="color: #66cdaa;">; </span><span style="color: #66cdaa;">deps list</span>
 (id auto (<span style="font-weight: bold;">#:primary-key</span>))
 (author_id tinyint (<span style="font-weight: bold;">#:not-null</span>))
 (title char-field (<span style="font-weight: bold;">#:not-null</span> <span style="font-weight: bold;">#:maxlen</span> 128))
 (timestamp bigint (<span style="font-weight: bold;">#:unsigned</span> <span style="font-weight: bold;">#:not-null</span>))
 )
</pre>
</div>

<p>
You may realized we've added src_scheme[:exports code]((:deps user)) to hint the MVC system that <b><b>article</b></b> table should be created after <b><b>user</b></b> table. So when it meets <b><b>article</b></b> Model during booting, it'll make sure to create <b><b>user</b></b> then <b><b>article</b></b>.
</p>

<p>
<b><b>NOTE:</b></b>: src_scheme[:exports code]((:deps models_list &#x2026;))
<b><b>NOTE:</b></b> This feature is useful when you do DB migration.
</p>
</div>
</div>

<div id="outline-container-org1478ee1" class="outline-4">
<h4 id="org1478ee1"><span class="section-number-4">12.2.4.</span> Model API</h4>
<div class="outline-text-4" id="text-12-2-4">
<p>
The model definition API:
</p>

<p>
src_scheme[:exports code]((create-artanis-model model_name (:deps deps_list &#x2026;) fields_def &#x2026;))
</p>

<p>
The <b><b>fields_def</b></b> syntax is:
</p>

<p>
src_scheme[:exports code]((field_name type (options &#x2026;)))
</p>
</div>

<ol class="org-ol">
