docs/manual.org
**** Field Type

To unify API amoung all the DB backend supported by GNU Artanis, we provide abstract types:

- auto: auto incremental index
- tiny-integer:
- small-integer:
- big-integer: 0~2^64
- text: long text
- boolean:
- float
- double
- char-field: varchar
  - you need to specify src_scheme[:exports code](#:maxlen positive_integer) in the options.
- date-field
  - These options imply src_scheme[:exports code](#:no-edit)
  - src_scheme[:exports code](#:auto-now)
  - src_scheme[:exports code](#:auto-now-once)

**NOTE:** if these types can't meet your requirements, just write the known type for your configured DB backend supported types, it will be passed directly to the backend, however, without the framework specific feature like type checking.

The **options** has specific syntax for different DB backend.

**** MySQL/MariaDB options

The specific options are:
- src_scheme[:exports code](#:not-null)
- src_scheme[:exports code](#:null)
- src_scheme[:exports code](#:default) to speficy default value.
- src_scheme[:exports code](#:unique)
- src_scheme[:exports code](#:unique-key)
- src_scheme[:exports code](#:primary-key)
- src_scheme[:exports code](#:key) to specify keys.
- src_scheme[:exports code](#:auto-incremental)
- src_scheme[:exports code](#:comment) for commenting.
- src_scheme[:exports code](#:column-format)
- src_scheme[:exports code](#:storage mode) DISK or MEMORY mode.
- src_scheme[:exports code](#:signed)
- src_scheme[:exports code](#:unsigned)
- src_scheme[:exports code](#:zerofill)

****  PostgreSQL options
PostgreSQL migration hasn't been supported yet...patches are welcome.

**** SQLite3 options

- src_scheme[:exports code](#:not-null)
- src_scheme[:exports code](#:null)
- src_scheme[:exports code](#:default value)
- src_scheme[:exports code](#:unique)
- src_scheme[:exports code](#:unique-key)
- src_scheme[:exports code](#:primary-key)
- src_scheme[:exports code](#:key)
- src_scheme[:exports code](#:auto-increment)
- src_scheme[:exports code](#:auto-now-once) for timestamp.

** Model mapping

If you defined a model, for example, an article table:

#+begin_src scheme
(create-artanis-model
 article  ; model name
 (:deps user) ; deps list
 (id auto (#:primary-key))
 (author_id tinyint (#:not-null))
 (title char-field (#:not-null #:maxlen 128))
 (timestamp bigint (#:unsigned #:not-null))
 )
#+end_src

There will be a closure named **$article** in this module, and could be exported. The **$** sign is auto added to the name of the table name. We call it **model mapping** so that you can control this table easily.

*** Table get

#+begin_src scheme
($article 'get #:columns (columns ...)
               #:functions '() ; put SQL functions here, e.g, '((count Article.name))
               #:ret 'all ; values: top | all | postive-number
               #:group-by '(column-name ...)
               #:order-by '(column-name ... asc) ;; or '(column-name ... desc)
               #:condition "" ; (where #:name "nala")
               #:foreach '() ; #:foreach '(city ("sz" "bj" "sh"))
               #:dump #f ; set #t if you want to check the SQL string
               #:mode 'raw ; raw to return all rows; getter to return a getter function)
#+end_src

*** Table set

You can update value to field in a natural way.

#+begin_src scheme
($article 'set #:key value ...)

;; for example
($article 'set #:title "new title" #:timestamp (current-time)
               #:condition (where #:id 1))
#+end_src

*** Table existance

Check table existance:

#+begin_src scheme
($article 'table-exists?)
#+end_src

Check fields existance:

#+begin_src scheme
($article 'exists? fields ...)
#+end_src

For the case-insensitively.
#+begin_src scheme
($article 'ci-exists? fields ...)
#+end_src

*** Table schema get

#+begin_src scheme
($article 'schema)
#+end_src

*** Table create

#+begin_src scheme
($article 'create fields-definitions ...)
#+end_src

*NOTE: This is the low-level API called by the model or migration to create a new table. It is not recommended you to use it directly.*

*** Table remove

#+begin_src scheme
($article 'remove)
#+end_src

*NOTE: This is the low-level API called by the model or migration to remove a table. It is not recommended you to use it directly.*

*** Table modify

#+begin_src scheme
($article 'mod definitions ...)
#+end_src

*NOTE: This is the low-level API called by the model or migration to modify a table. It is not recommended you to use it directly.*

*** Further reading

For modifying tables, you should read [[Migration][Migration]].

For other DB operation, please read [[FPRM (experimental)][FPRM]].
* Query String
A query string is a special part of a URL:

#+begin_src bash
http://example.com/over/there?name=ferret&color=purple
#+end_src

In this example, "name" and "color" are query strings with the values "ferret" and "purple" respectively.
It's useful to pass parameters to the server side like this.

GNU Artanis provides a convenient API to handle query strings.

