docs/manual.html
<li><a id="org7b37d81"></a>Field Type<br />
<div class="outline-text-5" id="text-12-2-4-1">
<p>
To unify API amoung all the DB backend supported by GNU Artanis, we provide abstract types:
</p>

<ul class="org-ul">
<li>auto: auto incremental index</li>
<li>tiny-integer:</li>
<li>small-integer:</li>
<li>big-integer: 0~2^64</li>
<li>text: long text</li>
<li>boolean:</li>
<li>float</li>
<li>double</li>
<li>char-field: varchar
<ul class="org-ul">
<li>you need to specify src_scheme[:exports code](#:maxlen positive_integer) in the options.</li>
</ul></li>
<li>date-field
<ul class="org-ul">
<li>These options imply src_scheme[:exports code](#:no-edit)</li>
<li>src_scheme[:exports code](#:auto-now)</li>
<li>src_scheme[:exports code](#:auto-now-once)</li>
</ul></li>
</ul>

<p>
<b><b>NOTE:</b></b> if these types can't meet your requirements, just write the known type for your configured DB backend supported types, it will be passed directly to the backend, however, without the framework specific feature like type checking.
</p>

<p>
The <b><b>options</b></b> has specific syntax for different DB backend.
</p>
</div>
</li>

<li><a id="org7add363"></a>MySQL/MariaDB options<br />
<div class="outline-text-5" id="text-12-2-4-2">
<p>
The specific options are:
</p>
<ul class="org-ul">
<li>src_scheme[:exports code](#:not-null)</li>
<li>src_scheme[:exports code](#:null)</li>
<li>src_scheme[:exports code](#:default) to speficy default value.</li>
<li>src_scheme[:exports code](#:unique)</li>
<li>src_scheme[:exports code](#:unique-key)</li>
<li>src_scheme[:exports code](#:primary-key)</li>
<li>src_scheme[:exports code](#:key) to specify keys.</li>
<li>src_scheme[:exports code](#:auto-incremental)</li>
<li>src_scheme[:exports code](#:comment) for commenting.</li>
<li>src_scheme[:exports code](#:column-format)</li>
<li>src_scheme[:exports code](#:storage mode) DISK or MEMORY mode.</li>
<li>src_scheme[:exports code](#:signed)</li>
<li>src_scheme[:exports code](#:unsigned)</li>
<li>src_scheme[:exports code](#:zerofill)</li>
</ul>
</div>
</li>

<li><a id="orgc11fcc7"></a>PostgreSQL options<br />
<div class="outline-text-5" id="text-12-2-4-3">
<p>
PostgreSQL migration hasn't been supported yet&#x2026;patches are welcome.
</p>
</div>
</li>

<li><a id="org13726a9"></a>SQLite3 options<br />
<div class="outline-text-5" id="text-12-2-4-4">
<ul class="org-ul">
<li>src_scheme[:exports code](#:not-null)</li>
<li>src_scheme[:exports code](#:null)</li>
<li>src_scheme[:exports code](#:default value)</li>
<li>src_scheme[:exports code](#:unique)</li>
<li>src_scheme[:exports code](#:unique-key)</li>
<li>src_scheme[:exports code](#:primary-key)</li>
<li>src_scheme[:exports code](#:key)</li>
<li>src_scheme[:exports code](#:auto-increment)</li>
<li>src_scheme[:exports code](#:auto-now-once) for timestamp.</li>
</ul>
</div>
</li>
</ol>
</div>
</div>

<div id="outline-container-org69b64f0" class="outline-3">
<h3 id="org69b64f0"><span class="section-number-3">12.3.</span> Model mapping</h3>
<div class="outline-text-3" id="text-12-3">
<p>
If you defined a model, for example, an article table:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(create-artanis-model
 article  <span style="color: #66cdaa;">; </span><span style="color: #66cdaa;">model name</span>
 (<span style="font-weight: bold;">:deps</span> user) <span style="color: #66cdaa;">; </span><span style="color: #66cdaa;">deps list</span>
 (id auto (<span style="font-weight: bold;">#:primary-key</span>))
 (author_id tinyint (<span style="font-weight: bold;">#:not-null</span>))
 (title char-field (<span style="font-weight: bold;">#:not-null</span> <span style="font-weight: bold;">#:maxlen</span> 128))
 (timestamp bigint (<span style="font-weight: bold;">#:unsigned</span> <span style="font-weight: bold;">#:not-null</span>))
 )
</pre>
</div>

<p>
There will be a closure named <b><b>$article</b></b> in this module, and could be exported. The <b><b>$</b></b> sign is auto added to the name of the table name. We call it <b><b>model mapping</b></b> so that you can control this table easily.
</p>
</div>

<div id="outline-container-org03383e5" class="outline-4">
<h4 id="org03383e5"><span class="section-number-4">12.3.1.</span> Table get</h4>
<div class="outline-text-4" id="text-12-3-1">
<div class="org-src-container">
<pre class="src src-scheme">($article 'get <span style="font-weight: bold;">#:columns</span> (columns ...)
               <span style="font-weight: bold;">#:functions</span> '() <span style="color: #66cdaa;">; </span><span style="color: #66cdaa;">put SQL functions here, e.g, '((count Article.name))</span>
               <span style="font-weight: bold;">#:ret</span> 'all <span style="color: #66cdaa;">; </span><span style="color: #66cdaa;">values: top | all | postive-number</span>
               <span style="font-weight: bold;">#:group-by</span> '(column-name ...)
               <span style="font-weight: bold;">#:order-by</span> '(column-name ... asc) <span style="color: #66cdaa;">;; </span><span style="color: #66cdaa;">or '(column-name ... desc)</span>
               <span style="font-weight: bold;">#:condition</span> <span style="color: #ff0000;">""</span> <span style="color: #66cdaa;">; </span><span style="color: #66cdaa;">(where #:name "nala")</span>
               <span style="font-weight: bold;">#:foreach</span> '() <span style="color: #66cdaa;">; </span><span style="color: #66cdaa;">#:foreach '(city ("sz" "bj" "sh"))</span>
               <span style="font-weight: bold;">#:dump</span> #f <span style="color: #66cdaa;">; </span><span style="color: #66cdaa;">set #t if you want to check the SQL string</span>
               <span style="font-weight: bold;">#:mode</span> 'raw <span style="color: #66cdaa;">; </span><span style="color: #66cdaa;">raw to return all rows; getter to return a getter function)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org5b3db74" class="outline-4">
<h4 id="org5b3db74"><span class="section-number-4">12.3.2.</span> Table set</h4>
<div class="outline-text-4" id="text-12-3-2">
<p>
You can update value to field in a natural way.
</p>

<div class="org-src-container">
<pre class="src src-scheme">($article 'set <span style="font-weight: bold;">#:key</span> value ...)

<span style="color: #66cdaa;">;; </span><span style="color: #66cdaa;">for example</span>
($article 'set <span style="font-weight: bold;">#:title</span> <span style="color: #ff0000;">"new title"</span> <span style="font-weight: bold;">#:timestamp</span> (current-time)
               <span style="font-weight: bold;">#:condition</span> (where <span style="font-weight: bold;">#:id</span> 1))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgcf7352c" class="outline-4">
<h4 id="orgcf7352c"><span class="section-number-4">12.3.3.</span> Table existance</h4>
<div class="outline-text-4" id="text-12-3-3">
<p>
Check table existance:
</p>

<div class="org-src-container">
<pre class="src src-scheme">($article 'table-exists?)
</pre>
</div>

<p>
Check fields existance:
</p>

<div class="org-src-container">
<pre class="src src-scheme">($article 'exists? fields ...)
</pre>
</div>

<p>
For the case-insensitively.
</p>
<div class="org-src-container">
<pre class="src src-scheme">($article 'ci-exists? fields ...)
</pre>
</div>
</div>
</div>

<div id="outline-container-orge953464" class="outline-4">
<h4 id="orge953464"><span class="section-number-4">12.3.4.</span> Table schema get</h4>
<div class="outline-text-4" id="text-12-3-4">
<div class="org-src-container">
<pre class="src src-scheme">($article 'schema)
</pre>
</div>
</div>
</div>

<div id="outline-container-org0395462" class="outline-4">
<h4 id="org0395462"><span class="section-number-4">12.3.5.</span> Table create</h4>
<div class="outline-text-4" id="text-12-3-5">
<div class="org-src-container">
<pre class="src src-scheme">($article 'create fields-definitions ...)
</pre>
</div>

<p>
<b>NOTE: This is the low-level API called by the model or migration to create a new table. It is not recommended you to use it directly.</b>
</p>
</div>
</div>

<div id="outline-container-orga8640f6" class="outline-4">
<h4 id="orga8640f6"><span class="section-number-4">12.3.6.</span> Table remove</h4>
<div class="outline-text-4" id="text-12-3-6">
<div class="org-src-container">
<pre class="src src-scheme">($article 'remove)
</pre>
</div>

<p>
<b>NOTE: This is the low-level API called by the model or migration to remove a table. It is not recommended you to use it directly.</b>
</p>
</div>
</div>

<div id="outline-container-org78def12" class="outline-4">
<h4 id="org78def12"><span class="section-number-4">12.3.7.</span> Table modify</h4>
<div class="outline-text-4" id="text-12-3-7">
<div class="org-src-container">
<pre class="src src-scheme">($article 'mod definitions ...)
</pre>
</div>

<p>
<b>NOTE: This is the low-level API called by the model or migration to modify a table. It is not recommended you to use it directly.</b>
</p>
</div>
</div>

<div id="outline-container-org8674dd9" class="outline-4">
<h4 id="org8674dd9"><span class="section-number-4">12.3.8.</span> Further reading</h4>
<div class="outline-text-4" id="text-12-3-8">
<p>
For modifying tables, you should read <a href="#orgbd38915">Migration</a>.
</p>

<p>
For other DB operation, please read <a href="#org1e98bca">FPRM</a>.
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-org7000d43" class="outline-2">
<h2 id="org7000d43"><span class="section-number-2">13.</span> Query String</h2>
<div class="outline-text-2" id="text-13">
<p>
A query string is a special part of a URL:
</p>

<div class="org-src-container">
<pre class="src src-bash">http://example.com/over/there?<span style="color: #00ff00;">name</span>=ferret&amp;<span style="color: #00ff00;">color</span>=purple
</pre>
</div>

<p>
In this example, "name" and "color" are query strings with the values "ferret" and "purple" respectively.
It's useful to pass parameters to the server side like this.
</p>

<p>
GNU Artanis provides a convenient API to handle query strings.
</p>
</div>
