docs/manual.org
** Query string from GET
The query string would be encoded in the URL on the GET method.

#+begin_src bash
http://example.com/over/there?name=ferret&color=purple
#+end_src
Please notice that URL-remapping supports regex. So you could register a URL rule like this:
#+begin_src scheme
(get "/there?"
  (lambda (rc)
    (get-from-qstr rc "name")))
#+end_src
Or it will throw 404 since URL-remapping failed to hit the rule with the query string.
** Query string from POST
The query string would be encoded in the HTTP body on the POST method.

There's only a slight difference when you pass query string by POST instead of with GET:
you don't need a URL rule using a regex, so the "?" is unnecessary here.
#+begin_src scheme
(post "/there" #:from-post 'qstr
      (lambda (rc)
        (:from-post rc 'get "name")))
#+end_src

Please notice that src_scheme[:exports code]{#:from-post 'qstr} is necessary when you're trying to
get data from POST. And you should use src_scheme[:exports code]{:from-post} to get related data
from query-string.

#+BEGIN_SRC scheme
#:from-post <mode>
#+END_SRC

The mode includes:
- src_scheme[:exports code]{#t} or src_scheme[:exports code]{'qstr}: handle query-string for you.
- src_scheme[:exports code]{'json}: returns a parsed json as hashtable.
- src_scheme[:exports code]{'qstr-safe}: similar to 'qstr, but try to eliminate evil HTML entities first.
- src_scheme[:exports code]{'bv}: returns the body as bytevector.
- src_scheme[:exports code]{'store rest ...}: It's for [[Upload files][Upload files]].

The reason to design :from-post is for the efficient purpose.
Artanis will not try to auto parse POST body as query-string for at least 2
reasons:
+ 1. It may not be query-string, maybe json, or uploaded file
+ 2. It may be long query-string, and could be deleyed to parse. This is
useful to avoid redundant parsing. However, each time you call
src_scheme[:exports code]{:from-post}, it will parse the query-string again, the correct way to
fetch multiple values is:
#+BEGIN_SRC scheme
(:from-post rc 'get-vals "key1" "key2" "key3")

;; For example:
;; let-values is imported from srfi-11
(let-values (((title sub-title old-passwd new-passwd)
              (:from-post rc 'get-vals "title" "sub-title"
                          "old-passwd" "new-passwd")))
  ..........
  )
#+END_SRC

BTW, you may get the parsed query-string as an assoc-list as well:
#+BEGIN_SRC scheme
(let ((qstr (:from-post rc 'get)))
  (assoc-ref qstr "key-1"))
#+END_SRC
* Layouts and Rendering in GNU Artanis
** Templating
Templating provides a way to mix programmatic code into HTML.
** Templating for Pythoners
If you're familiar with Django, which implemented a DSL(Domain Specific Language) to express presentation rather than program logic. Templating in GNU Artanis follows a different philosophy.

Templating in GNU Artanis, is just writing Scheme code in the HTML document. Why? Because of the philosophy of FP(Functional Programming), everything is a function. So, src_scheme[:exports code]{(filesizeformat size)} is easy enough to grasp for anyone with scheme experience. It's just a simple function calling in prefix-notation. There's no need to implement DSL like src_python[:exports code]{size|filesizeformat} to increase the complexity of code. Let alone the syntax is very different from Python.

The syntax src_python[:exports code]{size | filesizeformat} follows postfix-notation, used in stack-based languages, say Forth. Such a language used to delegate another programming paradigm named concatenative programming. It's very different from the paradigm of Scheme (functional programming), and the paradigm of Python (imperative programming).

The philosophy of GNU Artanis templating is to bring it into correspondence with the paradigm of the language. And reduce unnecessary complexities. [[http://en.wikipedia.org/wiki/KISS_principle][KISS]].
** Templating for Rubyists
Templating in GNU Artanis looks very similar to Rails.

The Rails code:

#+begin_src ruby
<% if( @fullscreen == 1 ) %>
<%= "<div class='full'><p>...</p></div>" %>
<% end %>
#+end_src

And the same function in GNU Artanis code:

#+begin_src scheme
<% (if (= fullscreen 1) %>
       <% "<div class='full'><p>...</p></div>" %>
       <% ) %>
#+end_src
** Templating APIs
#+begin_src scheme
(tpl->response filename/sxml [environment <- (the-environment)] [escape? <- #f])

(tpl->html filename/sxm [environment <- (the-environment)] [escape? <- #f])
#+end_src

/The difference is that tpl->html returns a string, but tpl->response returns an HTTP object response./

[environment] is the environment you want to use. We often ignore it. If you want to ref some vars defined outside your
template string, you need to pass this variable.

[escape?] If you want to char-escape the HTML with the returned string, set it to #t.

There are two main ways of writing templates:
