docs/manual.html

<div id="outline-container-orga30efaf" class="outline-3">
<h3 id="orga30efaf"><span class="section-number-3">13.1.</span> Query string from GET</h3>
<div class="outline-text-3" id="text-13-1">
<p>
The query string would be encoded in the URL on the GET method.
</p>

<div class="org-src-container">
<pre class="src src-bash">http://example.com/over/there?<span style="color: #00ff00;">name</span>=ferret&amp;<span style="color: #00ff00;">color</span>=purple
</pre>
</div>
<p>
Please notice that URL-remapping supports regex. So you could register a URL rule like this:
</p>
<div class="org-src-container">
<pre class="src src-scheme">(get <span style="color: #ff0000;">"/there?"</span>
  (<span style="color: #4169e1;">lambda</span> (rc)
    (get-from-qstr rc <span style="color: #ff0000;">"name"</span>)))
</pre>
</div>
<p>
Or it will throw 404 since URL-remapping failed to hit the rule with the query string.
</p>
</div>
</div>
<div id="outline-container-org2aee000" class="outline-3">
<h3 id="org2aee000"><span class="section-number-3">13.2.</span> Query string from POST</h3>
<div class="outline-text-3" id="text-13-2">
<p>
The query string would be encoded in the HTTP body on the POST method.
</p>

<p>
There's only a slight difference when you pass query string by POST instead of with GET:
you don't need a URL rule using a regex, so the "?" is unnecessary here.
</p>
<div class="org-src-container">
<pre class="src src-scheme">(post <span style="color: #ff0000;">"/there"</span> <span style="font-weight: bold;">#:from-post</span> 'qstr
      (<span style="color: #4169e1;">lambda</span> (rc)
        (<span style="font-weight: bold;">:from-post</span> rc 'get <span style="color: #ff0000;">"name"</span>)))
</pre>
</div>

<p>
Please notice that <code class="src src-scheme"><span style="font-weight: bold;">#:from-post</span> 'qstr</code> is necessary when you're trying to
get data from POST. And you should use <code class="src src-scheme"><span style="font-weight: bold;">:from-post</span></code> to get related data
from query-string.
</p>

<div class="org-src-container">
<pre class="src src-scheme"><span style="font-weight: bold;">#:from-post</span> <span style="color: #00ffff;">&lt;mode&gt;</span>
</pre>
</div>

<p>
The mode includes:
</p>
<ul class="org-ul">
<li><code class="src src-scheme">#t</code> or <code class="src src-scheme">'qstr</code>: handle query-string for you.</li>
<li><code class="src src-scheme">'json</code>: returns a parsed json as hashtable.</li>
<li><code class="src src-scheme">'qstr-safe</code>: similar to 'qstr, but try to eliminate evil HTML entities first.</li>
<li><code class="src src-scheme">'bv</code>: returns the body as bytevector.</li>
<li><code class="src src-scheme">'store rest ...</code>: It's for <a href="#org029726c">Upload files</a>.</li>
</ul>

<p>
The reason to design :from-post is for the efficient purpose.
Artanis will not try to auto parse POST body as query-string for at least 2
reasons:
</p>
<ul class="org-ul">
<li>1. It may not be query-string, maybe json, or uploaded file</li>
<li>2. It may be long query-string, and could be deleyed to parse. This is</li>
</ul>
<p>
useful to avoid redundant parsing. However, each time you call
<code class="src src-scheme"><span style="font-weight: bold;">:from-post</span></code>, it will parse the query-string again, the correct way to
fetch multiple values is:
</p>
<div class="org-src-container">
<pre class="src src-scheme">(<span style="font-weight: bold;">:from-post</span> rc 'get-vals <span style="color: #ff0000;">"key1"</span> <span style="color: #ff0000;">"key2"</span> <span style="color: #ff0000;">"key3"</span>)

<span style="color: #66cdaa;">;; </span><span style="color: #66cdaa;">For example:</span>
<span style="color: #66cdaa;">;; </span><span style="color: #66cdaa;">let-values is imported from srfi-11</span>
(<span style="color: #4169e1;">let-values</span> (((title sub-title old-passwd new-passwd)
              (<span style="font-weight: bold;">:from-post</span> rc 'get-vals <span style="color: #ff0000;">"title"</span> <span style="color: #ff0000;">"sub-title"</span>
                          <span style="color: #ff0000;">"old-passwd"</span> <span style="color: #ff0000;">"new-passwd"</span>)))
  ..........
  )
</pre>
</div>

<p>
BTW, you may get the parsed query-string as an assoc-list as well:
</p>
<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #4169e1;">let</span> ((qstr (<span style="font-weight: bold;">:from-post</span> rc 'get)))
  (assoc-ref qstr <span style="color: #ff0000;">"key-1"</span>))
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org8f45483" class="outline-2">
<h2 id="org8f45483"><span class="section-number-2">14.</span> Layouts and Rendering in GNU Artanis</h2>
<div class="outline-text-2" id="text-14">
</div>
<div id="outline-container-org2310195" class="outline-3">
<h3 id="org2310195"><span class="section-number-3">14.1.</span> Templating</h3>
<div class="outline-text-3" id="text-14-1">
<p>
Templating provides a way to mix programmatic code into HTML.
</p>
</div>
</div>
<div id="outline-container-org5011b6a" class="outline-3">
<h3 id="org5011b6a"><span class="section-number-3">14.2.</span> Templating for Pythoners</h3>
<div class="outline-text-3" id="text-14-2">
<p>
If you're familiar with Django, which implemented a DSL(Domain Specific Language) to express presentation rather than program logic. Templating in GNU Artanis follows a different philosophy.
</p>

<p>
Templating in GNU Artanis, is just writing Scheme code in the HTML document. Why? Because of the philosophy of FP(Functional Programming), everything is a function. So, <code class="src src-scheme">(filesizeformat size)</code> is easy enough to grasp for anyone with scheme experience. It's just a simple function calling in prefix-notation. There's no need to implement DSL like <code class="src src-python">size|filesizeformat</code> to increase the complexity of code. Let alone the syntax is very different from Python.
</p>

<p>
The syntax <code class="src src-python">size | filesizeformat</code> follows postfix-notation, used in stack-based languages, say Forth. Such a language used to delegate another programming paradigm named concatenative programming. It's very different from the paradigm of Scheme (functional programming), and the paradigm of Python (imperative programming).
</p>

<p>
The philosophy of GNU Artanis templating is to bring it into correspondence with the paradigm of the language. And reduce unnecessary complexities. <a href="http://en.wikipedia.org/wiki/KISS_principle">KISS</a>.
</p>
</div>
</div>
<div id="outline-container-orge2a928e" class="outline-3">
<h3 id="orge2a928e"><span class="section-number-3">14.3.</span> Templating for Rubyists</h3>
<div class="outline-text-3" id="text-14-3">
<p>
Templating in GNU Artanis looks very similar to Rails.
</p>

<p>
The Rails code:
</p>

<div class="org-src-container">
<pre class="src src-ruby">&lt;% <span style="color: #4169e1;">if</span>( <span style="color: #00ff00;">@fullscreen</span> == 1 ) <span style="color: #ff0000;">%&gt;</span>
<span style="color: #ff0000;">&lt;%= "&lt;div class='full'&gt;</span>&lt;<span style="font-weight: bold;">p</span>&gt;...&lt;<span style="color: #ff0000;">/p&gt;&lt;/</span>div&gt;<span style="color: #ff0000;">" %&gt;</span>
<span style="color: #ff0000;">&lt;% end %&gt;</span>
</pre>
</div>

<p>
And the same function in GNU Artanis code:
</p>

<div class="org-src-container">
<pre class="src src-scheme">&lt;% (<span style="color: #4169e1;">if</span> (= fullscreen 1) %&gt;
       &lt;% <span style="color: #ff0000;">"&lt;div class='full'&gt;&lt;p&gt;...&lt;/p&gt;&lt;/div&gt;"</span> %&gt;
       &lt;% ) %&gt;
</pre>
</div>
</div>
</div>
<div id="outline-container-orga114576" class="outline-3">
<h3 id="orga114576"><span class="section-number-3">14.4.</span> Templating APIs</h3>
<div class="outline-text-3" id="text-14-4">
<div class="org-src-container">
<pre class="src src-scheme">(tpl-&gt;response filename/sxml [environment &lt;- (the-environment)] [escape? &lt;- #f])

(tpl-&gt;html filename/sxm [environment &lt;- (the-environment)] [escape? &lt;- #f])
</pre>
</div>

<p>
<i>The difference is that tpl-&gt;html returns a string, but tpl-&gt;response returns an HTTP object response.</i>
</p>

<p>
[environment] is the environment you want to use. We often ignore it. If you want to ref some vars defined outside your
template string, you need to pass this variable.
</p>

<p>
[escape?] If you want to char-escape the HTML with the returned string, set it to #t.
</p>

<p>
There are two main ways of writing templates:
</p>
</div>
</div>
