docs/manual.org
** Embedded Templates
Example:
Write a tpl file named "my.tpl":
#+begin_src html
<html>
  <p> <%= "This is tpl test!" %> </p>
  <p> <% (format #t "And this is ~a" (getcwd)) %> </p>
  <p> <%= external-var %> </p>
</html>
#+end_src

The filename extension ".tpl" is mandatory when using the MVC. Since the MVC will find the template by detecting
controller name automatically.

If you don't use the MVC, and are rather writing all in one script
file loading GNU Artanis modules. Then you don't need to follow this rule.

*NOTE:* Don't wrap code in double-quotes, for example:
#+BEGIN_SRC html
<a href="<%= my-url %>">click me</a> <!-- Wrong! -->
<a href=<%= my-url %> >click me</a> <!-- Correct! -->
#+END_SRC

If you need to output a double-quoted string, please use src_scheme[:exports code]{object->string} to convert in Scheme first.
#+BEGIN_SRC html
<a href=<%= (object->string my-url) %> >click me</a> <!-- If my-url is not properly quoted -->
#+END_SRC

#+begin_src scheme
(get "/test"
  (lambda (rc)
    (let ((external-var 123))
      (tpl->response "my.tpl" (the-environment)))))
(run #:port 8080)
#+end_src

In this case, make sure to put my.tpl in the same path as your GNU Artanis code.

Since *external-var* is defined outside the file "my.tpl", and it's bound in /let/ with 123, you have to pass (the-environment). Or the template render will complain aobut not being able to find the variable *external-var*.

If you don't need to refer to any external vars, just use src_scheme[:exports code]{(tpl->response "file.tpl")}.

To test, access http://localhost:3000/test in your browser.

*** Template special commands
GNU Artanis provides special helper commands.

Please notice that GNU Artanis constrains the path of sources in the application directory for
security reasons. The resources files, CSS, JS etc, should be put int *pub* directory in
the application directory, or the client won't be able to access them.

These special commands are useful to expand the path for you, and they should be added
into the tamplate file, for example:
#+BEGIN_SRC html
<html>
  <head>
    <@icon favicon.ico %>
      <@js functions.js %>
        <@css blog.css %>
  </head>

  <@include sidebar.html %>

    <body>
      ...
    </body>
</html>
#+END_SRC

*NOTE:* The command name is prefixed with *@*, as, *@include*, *@css*, etc. Please do
not seperate the *@*, or it will throw exception.

You can include html files with the *include* command:
#+BEGIN_SRC scheme
;; @include is the command name, not <@ include filename %>
<@include filename.html %>
#+END_SRC
This will be expanded like this:
#+BEGIN_SRC bash
/current_toplevel/pub/filename.html
#+END_SRC
*NOTE:* Please make sure the included file is in the *pub* directory in the application
directory.

To refer to a CSS file:
#+BEGIN_SRC scheme
<@css filename.css %>
#+END_SRC
This will be expanded like this:
#+BEGIN_SRC html
<link rel="stylesheet" href="/css/filename.css">
#+END_SRC

To refer to a JS (javascript) file in the HTML head:
#+BEGIN_SRC scheme
<@js filename.js %>
#+END_SRC
This will be expanded like this:
#+BEGIN_SRC html
<script type="text/javascript" src="/js/filename.js"> </script>
#+END_SRC

To specify an icon for the domain:
#+BEGIN_SRC scheme
<@icon favicon.ico %>
#+END_SRC
This will be expanded like this:
#+BEGIN_SRC html
<link rel="icon" href="/img/favicon.ico" type="image/x-icon">
#+END_SRC

** SXML Templates
[[http://en.wikipedia.org/wiki/SXML][SXML]] is an alternative syntax for writing XML data, using the form of S-expressions.

SXML is to Scheme as JSON is to ECMAScript(the so-called Javascript). Maybe this explains it clearer.

One benefit of SXML is that it takes advantage of the quasiquote in Scheme. Please search in the internet "scheme quasiquote" for more details.

This is an SXML expression:
#+begin_src scheme
(tpl->response '(html (body (p (@ (id "content")) "hello world"))))
#+end_src

The above would result the following HTML code:
#+begin_src html
<html><body><p id="content">hello world</p></body></html>
#+end_src

Sometimes you may need quasiquote to refer to a variable, for example:

#+begin_src scheme
(let ((content "hello world"))
  (tpl->response `(html (body (p (@ (id "content")) ,content)))))
#+end_src
Here, the "html" block is being quoted with the backtick, which in combination with
a "," character before the variable name, makes the variable be referred to instead
of just passing a string.

* Databases
** DB init hooks
Sometimes you need to do some configurations before using DB, Artanis provide an API
for that, you should put it to ENTRY file before run the server.

For example, assuming you're using MySQL/MariaDB, and you need to configure it to UTF-8,
you should add these lines to you ENTRY file. Or if you're using minimal mode without
application folder, just put it before running the server.

#+BEGIN_SRC scheme
(run-when-DB-init!
 (lambda (conn)
   (DB-query conn "set names utf8;")))
#+END_SRC

*NOTE: Don't forget `!' here, it implies the side-effects in Scheme!*

