docs/manual.html
<div id="outline-container-orgc52c93f" class="outline-3">
<h3 id="orgc52c93f"><span class="section-number-3">14.5.</span> Embedded Templates</h3>
<div class="outline-text-3" id="text-14-5">
<p>
Example:
Write a tpl file named "my.tpl":
</p>
<div class="org-src-container">
<pre class="src src-html">&lt;<span style="color: #ffd700;">html</span>&gt;
  &lt;<span style="color: #ffd700;">p</span>&gt; &lt;%= <span style="color: #ff0000;">"This is tpl test!"</span> %&gt; &lt;/<span style="color: #ffd700;">p</span>&gt;
  &lt;<span style="color: #ffd700;">p</span>&gt; &lt;% (format #t <span style="color: #ff0000;">"And this is ~a"</span> (getcwd)) %&gt; &lt;/<span style="color: #ffd700;">p</span>&gt;
  &lt;<span style="color: #ffd700;">p</span>&gt; &lt;%= external-var %&gt; &lt;/<span style="color: #ffd700;">p</span>&gt;
&lt;/<span style="color: #ffd700;">html</span>&gt;
</pre>
</div>

<p>
The filename extension ".tpl" is mandatory when using the MVC. Since the MVC will find the template by detecting
controller name automatically.
</p>

<p>
If you don't use the MVC, and are rather writing all in one script
file loading GNU Artanis modules. Then you don't need to follow this rule.
</p>

<p>
<b>NOTE:</b> Don't wrap code in double-quotes, for example:
</p>
<div class="org-src-container">
<pre class="src src-html">&lt;<span style="color: #ffd700;">a</span> <span style="color: #00ff00;">href</span>=<span style="color: #ff0000;">"&lt;%= my-url %&gt;"</span>&gt;click me&lt;/<span style="color: #ffd700;">a</span>&gt; <span style="color: #66cdaa;">&lt;!-- </span><span style="color: #66cdaa;">Wrong!</span><span style="color: #66cdaa;"> --&gt;</span>
&lt;<span style="color: #ffd700;">a</span> href=&lt;%= my-url %&gt; &gt;click me&lt;/<span style="color: #ffd700;">a</span>&gt; <span style="color: #66cdaa;">&lt;!-- </span><span style="color: #66cdaa;">Correct!</span><span style="color: #66cdaa;"> --&gt;</span>
</pre>
</div>

<p>
If you need to output a double-quoted string, please use <code class="src src-scheme">object-&gt;string</code> to convert in Scheme first.
</p>
<div class="org-src-container">
<pre class="src src-html">&lt;<span style="color: #ffd700;">a</span> href=&lt;%= (object-&gt;string my-url) %&gt; &gt;click me&lt;/<span style="color: #ffd700;">a</span>&gt; <span style="color: #66cdaa;">&lt;!-- </span><span style="color: #66cdaa;">If my-url is not properly quoted</span><span style="color: #66cdaa;"> --&gt;</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-scheme">(get <span style="color: #ff0000;">"/test"</span>
  (<span style="color: #4169e1;">lambda</span> (rc)
    (<span style="color: #4169e1;">let</span> ((external-var 123))
      (tpl-&gt;response <span style="color: #ff0000;">"my.tpl"</span> (the-environment)))))
(run <span style="font-weight: bold;">#:port</span> 8080)
</pre>
</div>

<p>
In this case, make sure to put my.tpl in the same path as your GNU Artanis code.
</p>

<p>
Since <b>external-var</b> is defined outside the file "my.tpl", and it's bound in <i>let</i> with 123, you have to pass (the-environment). Or the template render will complain aobut not being able to find the variable <b>external-var</b>.
</p>

<p>
If you don't need to refer to any external vars, just use <code class="src src-scheme">(tpl-&gt;response <span style="color: #ff0000;">"file.tpl"</span>)</code>.
</p>

<p>
To test, access <a href="http://localhost:3000/test">http://localhost:3000/test</a> in your browser.
</p>
</div>

<div id="outline-container-orgf502fdf" class="outline-4">
<h4 id="orgf502fdf"><span class="section-number-4">14.5.1.</span> Template special commands</h4>
<div class="outline-text-4" id="text-14-5-1">
<p>
GNU Artanis provides special helper commands.
</p>

<p>
Please notice that GNU Artanis constrains the path of sources in the application directory for
security reasons. The resources files, CSS, JS etc, should be put int <b>pub</b> directory in
the application directory, or the client won't be able to access them.
</p>

<p>
These special commands are useful to expand the path for you, and they should be added
into the tamplate file, for example:
</p>
<div class="org-src-container">
<pre class="src src-html">&lt;<span style="color: #ffd700;">html</span>&gt;
  &lt;<span style="color: #ffd700;">head</span>&gt;
    &lt;@icon favicon.ico %&gt;
      &lt;@js functions.js %&gt;
        &lt;@css blog.css %&gt;
  &lt;/<span style="color: #ffd700;">head</span>&gt;

  &lt;@include sidebar.html %&gt;

    &lt;<span style="color: #ffd700;">body</span>&gt;
      ...
    &lt;/<span style="color: #ffd700;">body</span>&gt;
&lt;/<span style="color: #ffd700;">html</span>&gt;
</pre>
</div>

<p>
<b>NOTE:</b> The command name is prefixed with <b>@</b>, as, <b>@include</b>, <b>@css</b>, etc. Please do
not seperate the <b>@</b>, or it will throw exception.
</p>

<p>
You can include html files with the <b>include</b> command:
</p>
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #66cdaa;">;; </span><span style="color: #66cdaa;">@include is the command name, not &lt;@ include filename %&gt;</span>
&lt;@include filename.html %&gt;
</pre>
</div>
<p>
This will be expanded like this:
</p>
<div class="org-src-container">
<pre class="src src-bash">/current_toplevel/pub/filename.html
</pre>
</div>
<p>
<b>NOTE:</b> Please make sure the included file is in the <b>pub</b> directory in the application
directory.
</p>

<p>
To refer to a CSS file:
</p>
<div class="org-src-container">
<pre class="src src-scheme">&lt;@css filename.css %&gt;
</pre>
</div>
<p>
This will be expanded like this:
</p>
<div class="org-src-container">
<pre class="src src-html">&lt;<span style="color: #ffd700;">link</span> <span style="color: #00ff00;">rel</span>=<span style="color: #ff0000;">"stylesheet"</span> <span style="color: #00ff00;">href</span>=<span style="color: #ff0000;">"/css/filename.css"</span>&gt;
</pre>
</div>

<p>
To refer to a JS (javascript) file in the HTML head:
</p>
<div class="org-src-container">
<pre class="src src-scheme">&lt;@js filename.js %&gt;
</pre>
</div>
<p>
This will be expanded like this:
</p>
<div class="org-src-container">
<pre class="src src-html">&lt;<span style="color: #ffd700;">script</span> <span style="color: #00ff00;">type</span>=<span style="color: #ff0000;">"text/javascript"</span> <span style="color: #00ff00;">src</span>=<span style="color: #ff0000;">"/js/filename.js"</span>&gt; &lt;/<span style="color: #ffd700;">script</span>&gt;
</pre>
</div>

<p>
To specify an icon for the domain:
</p>
<div class="org-src-container">
<pre class="src src-scheme">&lt;@icon favicon.ico %&gt;
</pre>
</div>
<p>
This will be expanded like this:
</p>
<div class="org-src-container">
<pre class="src src-html">&lt;<span style="color: #ffd700;">link</span> <span style="color: #00ff00;">rel</span>=<span style="color: #ff0000;">"icon"</span> <span style="color: #00ff00;">href</span>=<span style="color: #ff0000;">"/img/favicon.ico"</span> <span style="color: #00ff00;">type</span>=<span style="color: #ff0000;">"image/x-icon"</span>&gt;
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgfddd8cf" class="outline-3">
<h3 id="orgfddd8cf"><span class="section-number-3">14.6.</span> SXML Templates</h3>
<div class="outline-text-3" id="text-14-6">
<p>
<a href="http://en.wikipedia.org/wiki/SXML">SXML</a> is an alternative syntax for writing XML data, using the form of S-expressions.
</p>

<p>
SXML is to Scheme as JSON is to ECMAScript(the so-called Javascript). Maybe this explains it clearer.
</p>

<p>
One benefit of SXML is that it takes advantage of the quasiquote in Scheme. Please search in the internet "scheme quasiquote" for more details.
</p>

<p>
This is an SXML expression:
</p>
<div class="org-src-container">
<pre class="src src-scheme">(tpl-&gt;response '(html (body (p (@ (id <span style="color: #ff0000;">"content"</span>)) <span style="color: #ff0000;">"hello world"</span>))))
</pre>
</div>

<p>
The above would result the following HTML code:
</p>
<div class="org-src-container">
<pre class="src src-html">&lt;<span style="color: #ffd700;">html</span>&gt;&lt;<span style="color: #ffd700;">body</span>&gt;&lt;<span style="color: #ffd700;">p</span> <span style="color: #00ff00;">id</span>=<span style="color: #ff0000;">"content"</span>&gt;hello world&lt;/<span style="color: #ffd700;">p</span>&gt;&lt;/<span style="color: #ffd700;">body</span>&gt;&lt;/<span style="color: #ffd700;">html</span>&gt;
</pre>
</div>

<p>
Sometimes you may need quasiquote to refer to a variable, for example:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #4169e1;">let</span> ((content <span style="color: #ff0000;">"hello world"</span>))
  (tpl-&gt;response `(html (body (p (@ (id <span style="color: #ff0000;">"content"</span>)) ,content)))))
</pre>
</div>
<p>
Here, the "html" block is being quoted with the backtick, which in combination with
a "," character before the variable name, makes the variable be referred to instead
of just passing a string.
</p>
</div>
</div>
</div>

<div id="outline-container-org37d7d68" class="outline-2">
<h2 id="org37d7d68"><span class="section-number-2">15.</span> Databases</h2>
<div class="outline-text-2" id="text-15">
</div>
<div id="outline-container-org9432ba5" class="outline-3">
<h3 id="org9432ba5"><span class="section-number-3">15.1.</span> DB init hooks</h3>
<div class="outline-text-3" id="text-15-1">
<p>
Sometimes you need to do some configurations before using DB, Artanis provide an API
for that, you should put it to ENTRY file before run the server.
</p>

<p>
For example, assuming you're using MySQL/MariaDB, and you need to configure it to UTF-8,
you should add these lines to you ENTRY file. Or if you're using minimal mode without
application folder, just put it before running the server.
</p>

<div class="org-src-container">
<pre class="src src-scheme">(run-when-DB-init!
 (<span style="color: #4169e1;">lambda</span> (conn)
   (DB-query conn <span style="color: #ff0000;">"set names utf8;"</span>)))
</pre>
</div>

<p>
<b>NOTE: Don't forget `!' here, it implies the side-effects in Scheme!</b>
</p>
</div>
</div>
