docs/manual.org
** DB connection pool
GNU Artanis will create a connection pool when you run src_bash[:exports code]{art work}.
Its size is decided by src_config[:exports code]{db.poolsize}.
The pool is increasing by default for development and test.
It is strongly recommended you to set src_config[:exports code]{db.pool} to src_config[:exports code]{fixed} when you deploy.
The increasing pool will cause the effects that is similar to the memory leak. If you set it to fixed, then the request handler will be
safely scheduled when there's no available DB connection, and it will be awake when it's available.
** Migration
Migrations provide a way to do complicated modification of tables in a database by GNU Artanis.
Here's an example.

First, draw a migration:
#+begin_src nil
# art draw migration person
drawing    migration person
working    Migration `20151107040209_person.scm'
#+end_src
You'll see something similar like above.

Then you'd edit the file db/migration/20151107040209_person.scm:
#+begin_src scheme
(migrate-up
 (create-table
  'person
  '(id auto (#:primary-key))
  '(name char-field (#:not-null #:maxlen 10))
  '(age tiny-integer (#:not-null))
  '(email char-field (#:maxlen 20))))

(migrate-down
 (drop-table 'person))
#+end_src

Then you run the *up* command for migration:
#+begin_src nil
art migrate up person
#+end_src

Then migrate-up function will be called, and this will create a table named /person/:
#+begin_src nil
+-------+---------------------+------+-----+---------+----------------+
| Field | Type                | Null | Key | Default | Extra          |
+-------+---------------------+------+-----+---------+----------------+
| id    | bigint(20) unsigned | NO   | PRI | NULL    | auto_increment |
| name  | varchar(10)         | NO   |     | NULL    |                |
| age   | tinyint(4)          | NO   |     | NULL    |                |
| email | varchar(20)         | YES  |     | NULL    |                |
+-------+---------------------+------+-----+---------+----------------+
#+end_src

If you run the *down* command of migration, as:
#+begin_src nil
art migrate down person
#+end_src
The table /person/ will be dropped.
** ORM problem
ORM stands for Object Relational Mapping, which is a popular approach to handle relational DB nowadays, especially for Object-Oriented Programming.

Of course, Guile has it's own Object System named [[https://www.gnu.org/software/guile/manual/html_node/GOOPS.html#GOOPS][GOOPS]]. Users can use OOP with it. And it's possible to implement ORM in GNU Artanis as well.

However, FP fans realized that they don't have to use OOP if they can use FP features reasonably.

Besides, there're some critics about ORM:
+ [[http://martinfowler.com/bliki/OrmHate.html][ORM Hate]]

+ [[http://blogs.tedneward.com/2006/06/26/The+Vietnam+Of+Computer+Science.aspx][Vietnam of Computer Science]]

+ [[http://blog.codinghorror.com/object-relational-mapping-is-the-vietnam-of-computer-science/][Object-Relational Mapping is the Vietnam of Computer Science]]

Here are some known ways to solve ORM related problems:

+ 1. */Give up ORM/*.


+ 2. */Give up relational storage model/*. Don't use a relational DB. Use another DB style, such as No-SQL. Well, this way is not cool when you must use a relational DB.


+ 3. */Manual mapping/*. Write SQL code directly. It's fine sometimes. But the code increases when things get complicated. Refactoring and reusing would be worth to consider.


+ 4. */Limited ORM/*. Limiting the utility of ORM. And use ORM to solve part of your work rather than whole, depends on you. This may avoid some problems.


+ 5. */SQL related DSL/*. Design a new language. Microsoft's LINQ is such a case.


+ 6. */Integration of relational concepts into frameworks/*. Well, harder than 5, but worth to try.


+ 7. */Stateless/*. This is the critical hit to counter complexity and unreliability.

Basically, GNU Artanis has no ORM yet, and maybe never will. GNU Artanis is trying to experiment new ways to solve the problems of ORM.

GNU Artanis provides three ways to complete this mission. All of them, are *experimental* at present.

+ SSQL (1,3,5)

+ FPRM (4,7)

+ SQL Mapping (1,3,6)
** SSQL
The concept of SSQL is to write SQL in [[https://en.wikipedia.org/wiki/S-expression][s-expression]].

Usage:
#+begin_src scheme
(->sql sql-statement)
(where #:key val ... [literal string])
(having #:key val ... [literal string])
(/or conds ...)
(/and conds ...)
#+end_src

For example:
#+begin_src scheme
(->sql select * from 'Persons (where #:city "Tokyo"))
(->sql select '(age name) from 'Persons (where "age < 30"))
#+end_src
The SQL update command is quite different to SQL grammar. Example:
#+BEGIN_SRC scheme
(->sql update 'table set (list (list phone_number "08080001234")) (where #:name "john"))
#+END_SRC
** FPRM (experimental)
FPRM stands for Functional Programming Relational Mapping. It's a new word I invented. But it's not new concept. FP here indicates *stateless*.

/FPRM is still experimental and work-in-progress./
*** Connect to DB server
#+begin_src scheme
;; usage 1:
(connect-db dbd init-str)

;; usage 2:
(connect-db dbd #:db-name "artanis" #:db-username "root" #:db-passwd ""
            #:proto "tcp" #:host "localhost" #:port 3306)
#+end_src

+ *dbd* is a string. It must match any of these: "mysql", "postgresql", or "sqlite3".


+ *init-str* is a string for DB init, for example:
#+begin_src scheme
(connect-db "mysql" "root:123:artanis:tcp:localhost:3306")
#+end_src

+ src_scheme[:exports code]{#:db-name} specifies the DB name.


+ src_scheme[:exports code]{#:db-username} specifies the DB username.


+ src_scheme[:exports code]{#:proto} specifies the socket protocol, which is related to the DB server of your choice.


+ src_scheme[:exports code]{#:host} specifies the host name.


+ src_scheme[:exports code]{#:port} specifies the socket port.
