docs/manual.html

<div id="outline-container-org7d93196" class="outline-3">
<h3 id="org7d93196"><span class="section-number-3">15.2.</span> DB connection pool</h3>
<div class="outline-text-3" id="text-15-2">
<p>
GNU Artanis will create a connection pool when you run <code class="src src-bash">art work</code>.
Its size is decided by <code class="src src-config">db.poolsize</code>.
The pool is increasing by default for development and test.
It is strongly recommended you to set <code class="src src-config">db.pool</code> to <code class="src src-config">fixed</code> when you deploy.
The increasing pool will cause the effects that is similar to the memory leak. If you set it to fixed, then the request handler will be
safely scheduled when there's no available DB connection, and it will be awake when it's available.
</p>
</div>
</div>
<div id="outline-container-orgbd38915" class="outline-3">
<h3 id="orgbd38915"><span class="section-number-3">15.3.</span> Migration</h3>
<div class="outline-text-3" id="text-15-3">
<p>
Migrations provide a way to do complicated modification of tables in a database by GNU Artanis.
Here's an example.
</p>

<p>
First, draw a migration:
</p>
<div class="org-src-container">
<pre class="src src-nil"># art draw migration person
drawing    migration person
working    Migration `20151107040209_person.scm'
</pre>
</div>
<p>
You'll see something similar like above.
</p>

<p>
Then you'd edit the file db/migration/20151107040209_person.scm:
</p>
<div class="org-src-container">
<pre class="src src-scheme">(migrate-up
 (create-table
  'person
  '(id auto (<span style="font-weight: bold;">#:primary-key</span>))
  '(name char-field (<span style="font-weight: bold;">#:not-null</span> <span style="font-weight: bold;">#:maxlen</span> 10))
  '(age tiny-integer (<span style="font-weight: bold;">#:not-null</span>))
  '(email char-field (<span style="font-weight: bold;">#:maxlen</span> 20))))

(migrate-down
 (drop-table 'person))
</pre>
</div>

<p>
Then you run the <b>up</b> command for migration:
</p>
<div class="org-src-container">
<pre class="src src-nil">art migrate up person
</pre>
</div>

<p>
Then migrate-up function will be called, and this will create a table named <i>person</i>:
</p>
<div class="org-src-container">
<pre class="src src-nil">+-------+---------------------+------+-----+---------+----------------+
| Field | Type                | Null | Key | Default | Extra          |
+-------+---------------------+------+-----+---------+----------------+
| id    | bigint(20) unsigned | NO   | PRI | NULL    | auto_increment |
| name  | varchar(10)         | NO   |     | NULL    |                |
| age   | tinyint(4)          | NO   |     | NULL    |                |
| email | varchar(20)         | YES  |     | NULL    |                |
+-------+---------------------+------+-----+---------+----------------+
</pre>
</div>

<p>
If you run the <b>down</b> command of migration, as:
</p>
<div class="org-src-container">
<pre class="src src-nil">art migrate down person
</pre>
</div>
<p>
The table <i>person</i> will be dropped.
</p>
</div>
</div>
<div id="outline-container-orga063699" class="outline-3">
<h3 id="orga063699"><span class="section-number-3">15.4.</span> ORM problem</h3>
<div class="outline-text-3" id="text-15-4">
<p>
ORM stands for Object Relational Mapping, which is a popular approach to handle relational DB nowadays, especially for Object-Oriented Programming.
</p>

<p>
Of course, Guile has it's own Object System named <a href="https://www.gnu.org/software/guile/manual/html_node/GOOPS.html#GOOPS">GOOPS</a>. Users can use OOP with it. And it's possible to implement ORM in GNU Artanis as well.
</p>

<p>
However, FP fans realized that they don't have to use OOP if they can use FP features reasonably.
</p>

<p>
Besides, there're some critics about ORM:
</p>
<ul class="org-ul">
<li><a href="http://martinfowler.com/bliki/OrmHate.html">ORM Hate</a></li>

<li><a href="http://blogs.tedneward.com/2006/06/26/The+Vietnam+Of+Computer+Science.aspx">Vietnam of Computer Science</a></li>

<li><a href="http://blog.codinghorror.com/object-relational-mapping-is-the-vietnam-of-computer-science/">Object-Relational Mapping is the Vietnam of Computer Science</a></li>
</ul>

<p>
Here are some known ways to solve ORM related problems:
</p>

<ul class="org-ul">
<li>1. <b><i>Give up ORM</i></b>.</li>
</ul>


<ul class="org-ul">
<li>2. <b><i>Give up relational storage model</i></b>. Don't use a relational DB. Use another DB style, such as No-SQL. Well, this way is not cool when you must use a relational DB.</li>
</ul>


<ul class="org-ul">
<li>3. <b><i>Manual mapping</i></b>. Write SQL code directly. It's fine sometimes. But the code increases when things get complicated. Refactoring and reusing would be worth to consider.</li>
</ul>


<ul class="org-ul">
<li>4. <b><i>Limited ORM</i></b>. Limiting the utility of ORM. And use ORM to solve part of your work rather than whole, depends on you. This may avoid some problems.</li>
</ul>


<ul class="org-ul">
<li>5. <b><i>SQL related DSL</i></b>. Design a new language. Microsoft's LINQ is such a case.</li>
</ul>


<ul class="org-ul">
<li>6. <b><i>Integration of relational concepts into frameworks</i></b>. Well, harder than 5, but worth to try.</li>
</ul>


<ul class="org-ul">
<li>7. <b><i>Stateless</i></b>. This is the critical hit to counter complexity and unreliability.</li>
</ul>

<p>
Basically, GNU Artanis has no ORM yet, and maybe never will. GNU Artanis is trying to experiment new ways to solve the problems of ORM.
</p>

<p>
GNU Artanis provides three ways to complete this mission. All of them, are <b>experimental</b> at present.
</p>

<ul class="org-ul">
<li>SSQL (1,3,5)</li>

<li>FPRM (4,7)</li>

<li>SQL Mapping (1,3,6)</li>
</ul>
</div>
</div>
<div id="outline-container-org8890e84" class="outline-3">
<h3 id="org8890e84"><span class="section-number-3">15.5.</span> SSQL</h3>
<div class="outline-text-3" id="text-15-5">
<p>
The concept of SSQL is to write SQL in <a href="https://en.wikipedia.org/wiki/S-expression">s-expression</a>.
</p>

<p>
Usage:
</p>
<div class="org-src-container">
<pre class="src src-scheme">(-&gt;sql sql-statement)
(where <span style="font-weight: bold;">#:key</span> val ... [literal string])
(having <span style="font-weight: bold;">#:key</span> val ... [literal string])
(/or conds ...)
(/and conds ...)
</pre>
</div>

<p>
For example:
</p>
<div class="org-src-container">
<pre class="src src-scheme">(-&gt;sql select * from 'Persons (where <span style="font-weight: bold;">#:city</span> <span style="color: #ff0000;">"Tokyo"</span>))
(-&gt;sql select '(age name) from 'Persons (where <span style="color: #ff0000;">"age &lt; 30"</span>))
</pre>
</div>
<p>
The SQL update command is quite different to SQL grammar. Example:
</p>
<div class="org-src-container">
<pre class="src src-scheme">(-&gt;sql update 'table set (list (list phone_number <span style="color: #ff0000;">"08080001234"</span>)) (where <span style="font-weight: bold;">#:name</span> <span style="color: #ff0000;">"john"</span>))
</pre>
</div>
</div>
</div>
<div id="outline-container-org1e98bca" class="outline-3">
<h3 id="org1e98bca"><span class="section-number-3">15.6.</span> FPRM (experimental)</h3>
<div class="outline-text-3" id="text-15-6">
<p>
FPRM stands for Functional Programming Relational Mapping. It's a new word I invented. But it's not new concept. FP here indicates <b>stateless</b>.
</p>

<p>
<i>FPRM is still experimental and work-in-progress.</i>
</p>
</div>
<div id="outline-container-org1336e8a" class="outline-4">
<h4 id="org1336e8a"><span class="section-number-4">15.6.1.</span> Connect to DB server</h4>
<div class="outline-text-4" id="text-15-6-1">
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #66cdaa;">;; </span><span style="color: #66cdaa;">usage 1:</span>
(connect-db dbd init-str)

<span style="color: #66cdaa;">;; </span><span style="color: #66cdaa;">usage 2:</span>
(connect-db dbd <span style="font-weight: bold;">#:db-name</span> <span style="color: #ff0000;">"artanis"</span> <span style="font-weight: bold;">#:db-username</span> <span style="color: #ff0000;">"root"</span> <span style="font-weight: bold;">#:db-passwd</span> <span style="color: #ff0000;">""</span>
            <span style="font-weight: bold;">#:proto</span> <span style="color: #ff0000;">"tcp"</span> <span style="font-weight: bold;">#:host</span> <span style="color: #ff0000;">"localhost"</span> <span style="font-weight: bold;">#:port</span> 3306)
</pre>
</div>

<ul class="org-ul">
<li><b>dbd</b> is a string. It must match any of these: "mysql", "postgresql", or "sqlite3".</li>
</ul>


<ul class="org-ul">
<li><b>init-str</b> is a string for DB init, for example:</li>
</ul>
<div class="org-src-container">
<pre class="src src-scheme">(connect-db <span style="color: #ff0000;">"mysql"</span> <span style="color: #ff0000;">"root:123:artanis:tcp:localhost:3306"</span>)
</pre>
</div>

<ul class="org-ul">
<li><code class="src src-scheme"><span style="font-weight: bold;">#:db-name</span></code> specifies the DB name.</li>
</ul>


<ul class="org-ul">
<li><code class="src src-scheme"><span style="font-weight: bold;">#:db-username</span></code> specifies the DB username.</li>
</ul>


<ul class="org-ul">
<li><code class="src src-scheme"><span style="font-weight: bold;">#:proto</span></code> specifies the socket protocol, which is related to the DB server of your choice.</li>
</ul>


<ul class="org-ul">
<li><code class="src src-scheme"><span style="font-weight: bold;">#:host</span></code> specifies the host name.</li>
</ul>


<ul class="org-ul">
<li><code class="src src-scheme"><span style="font-weight: bold;">#:port</span></code> specifies the socket port.</li>
</ul>
</div>
</div>
