docs/manual.org
*** Map DB table
This step will generate an new instance (as a closure) mapped to database table or view.
In ORM, it is often called an [[http://www.martinfowler.com/eaaCatalog/activeRecord.html][Active Record.]] It maps the database view to a class object.

There are two main differences to SSQL:
+ FPRM doesn't create an object for each table. It maps the whole database, and generates an SQL for each table as you use it. So it might be lighter compared to an ORM object.
+ FPRM doesn't maintain any states at all. It's stateless as an object (Not in the database).

These two points may decrease the power of FPRM, but our main philosophy in GNU Artanis is that
+ /The best way to control DB is SQL, don't bother with other guile schemes./

That means we're not going to develop a complicated ORM in GNU Artanis, but a promising way to interact with SQL easily.
This is what [[SQL Mapping (experimental)][SQL Mapping]] provided. FPRM aims to reduce states & complexity to provide reliability. And SQL-Mapping will provide a convenient way
to handle complex SQL queries for better performance and security (SQL-Injection, etc).

#+begin_src scheme
(define m (map-table-from-DB rc/conn))
#+end_src

*rc/conn* can be a route-context or a DB connection.

map-table-from-DB returns a function, named *m* here for simplicity.
*** Create table
#+begin_src scheme
(m 'create table-name defs #:if-exists? #f #:primary-keys '() #:engine #f)
#+end_src

+ *table-name* specifies the name of the DB table.


+ *defs* is a list to define the type of columns. For example:
#+begin_src scheme
'((name varchar 10) (age integer) (email varchar 20))
#+end_src


+ src_scheme[:exports code]{#:if-exists?} has two kinds of possible options:
  + '*overwrite* and '*drop*, which will overwrite the existing table.
  + '*ignore* means to ignore the table when it already exists.


+ src_scheme[:exports code]{#:primary-keys} specifies the primary keys in the created table.


+ src_scheme[:exports code]{#:engine} specifies the DB engine. It depends on what dbd you chose.
*** Get columns from table
#+begin_src scheme
(m 'get table-name #:columns '(*) #:functions '() #:ret 'all
   #:group-by #f #:order-by #f)
#+end_src

+ src_scheme[:exports code]{#:column} is the list of columns to get.


+ src_scheme[:exports code]{#:functions} is a function to call, e.g:
#+begin_src scheme
#:functions '((count Persons.Lastname))
#+end_src


+ src_scheme[:exports code]{#:ret} specifies how to return the result, there are three options:
  + 'all for returning all results
  + 'top for returning the first result
  + integer (larger than 0), to give it the end of a range from 0 to this number to give as result.


+ src_scheme[:exports code]{#:group-by} used in conjunction with the aggregate functions to group the result-set by one or more columns.


+ src_scheme[:exports code]{#:order-by} used to sort the result-set by one or more columns.


For example, to get Lastname and City column, and return the first result.
#+begin_src scheme
(m 'get 'Persons #:columns '(Lastname City) #:ret 'top)
#+end_src
*** Set values to table
#+begin_src scheme
(m 'set table-name . kargs)
#+end_src

*kargs* is a var-list that takes key-value arguments.

For example:
#+begin_src scheme
(m 'set 'Persons #:name "nala" #:age 99 #:email "nala@artanis.com")
#+end_src

*** Drop a table
#+begin_src scheme
(m 'drop table-name)
#+end_src
*** Check existence of table
#+begin_src scheme
;; case sensitive
(m 'exists? table-name . columns)
;; or for case-insensitive
(m 'ci-exists? table-name . columns)
#+end_src

For example:
#+begin_src scheme
(m 'exists? 'Persons 'city 'lastname)
#+end_src
*** Get schema of a table
#+begin_src scheme
(m 'schema table-name)
#+end_src

/NOTE: all the returned names of the schema will be in lowercase./
** SQL Mapping (experimental)
To be continued ...
* RESTful API
GNU Artanis provides a command src_bash[:exports code]{art api} to generate RESTful API skeleton, and the API version can be managed.

#+BEGIN_SRC bash
art api -c

creating   restful API v1
create     app/api/v1.scm
#+END_SRC

The generated file *app/api/v1.scm* will contain such a line:
#+BEGIN_SRC scheme
(define-restful-api v1) ; DO NOT REMOVE THIS LINE!!!
#+END_SRC

*v1* is the default version, if you may specify your prefered API version, for example, *v3*:
#+BEGIN_SRC bash
art api -c -v v3
#+END_SRC
src_bash[:exports code]{-c} means to create.

You should use src_scheme[:exports code]{api-define} to define the RESTful API:
#+BEGIN_SRC scheme
(api-define rule handler)
#+END_SRC

src_scheme[:exports code]{api-define} is an overloaded method of the controller define function. So you may use it like what you do with the controller in MVC. Here's a pseudo example:
#+BEGIN_SRC scheme
(define (auth-err)
  (scm->json `((status ,status) (reason "Auth error!"))))

(api-define article/list
  (options #:mime 'json #:with-auth auth-err)
  (lambda (rc) ...))
#+END_SRC
Although the registered URL is src_scheme[:exports code]{"article/list"}, the actual API would be src_scheme[:exports code]{"v1/article/list"}, depends on the specified API version.
