docs/manual.html
<div id="outline-container-org6f2e990" class="outline-4">
<h4 id="org6f2e990"><span class="section-number-4">15.6.2.</span> Map DB table</h4>
<div class="outline-text-4" id="text-15-6-2">
<p>
This step will generate an new instance (as a closure) mapped to database table or view.
In ORM, it is often called an <a href="http://www.martinfowler.com/eaaCatalog/activeRecord.html">Active Record.</a> It maps the database view to a class object.
</p>

<p>
There are two main differences to SSQL:
</p>
<ul class="org-ul">
<li>FPRM doesn't create an object for each table. It maps the whole database, and generates an SQL for each table as you use it. So it might be lighter compared to an ORM object.</li>
<li>FPRM doesn't maintain any states at all. It's stateless as an object (Not in the database).</li>
</ul>

<p>
These two points may decrease the power of FPRM, but our main philosophy in GNU Artanis is that
</p>
<ul class="org-ul">
<li><i>The best way to control DB is SQL, don't bother with other guile schemes.</i></li>
</ul>

<p>
That means we're not going to develop a complicated ORM in GNU Artanis, but a promising way to interact with SQL easily.
This is what <a href="#org59ddff9">SQL Mapping</a> provided. FPRM aims to reduce states &amp; complexity to provide reliability. And SQL-Mapping will provide a convenient way
to handle complex SQL queries for better performance and security (SQL-Injection, etc).
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #4169e1;">define</span> <span style="color: #ffd700;">m</span> (map-table-from-DB rc/conn))
</pre>
</div>

<p>
<b>rc/conn</b> can be a route-context or a DB connection.
</p>

<p>
map-table-from-DB returns a function, named <b>m</b> here for simplicity.
</p>
</div>
</div>
<div id="outline-container-orge2f8907" class="outline-4">
<h4 id="orge2f8907"><span class="section-number-4">15.6.3.</span> Create table</h4>
<div class="outline-text-4" id="text-15-6-3">
<div class="org-src-container">
<pre class="src src-scheme">(m 'create table-name defs <span style="font-weight: bold;">#:if-exists?</span> #f <span style="font-weight: bold;">#:primary-keys</span> '() <span style="font-weight: bold;">#:engine</span> #f)
</pre>
</div>

<ul class="org-ul">
<li><b>table-name</b> specifies the name of the DB table.</li>
</ul>


<ul class="org-ul">
<li><b>defs</b> is a list to define the type of columns. For example:</li>
</ul>
<div class="org-src-container">
<pre class="src src-scheme">'((name varchar 10) (age integer) (email varchar 20))
</pre>
</div>


<ul class="org-ul">
<li><code class="src src-scheme"><span style="font-weight: bold;">#:if-exists?</span></code> has two kinds of possible options:
<ul class="org-ul">
<li>'<b>overwrite</b> and '<b>drop</b>, which will overwrite the existing table.</li>
<li>'<b>ignore</b> means to ignore the table when it already exists.</li>
</ul></li>
</ul>


<ul class="org-ul">
<li><code class="src src-scheme"><span style="font-weight: bold;">#:primary-keys</span></code> specifies the primary keys in the created table.</li>
</ul>


<ul class="org-ul">
<li><code class="src src-scheme"><span style="font-weight: bold;">#:engine</span></code> specifies the DB engine. It depends on what dbd you chose.</li>
</ul>
</div>
</div>
<div id="outline-container-orgca33e78" class="outline-4">
<h4 id="orgca33e78"><span class="section-number-4">15.6.4.</span> Get columns from table</h4>
<div class="outline-text-4" id="text-15-6-4">
<div class="org-src-container">
<pre class="src src-scheme">(m 'get table-name <span style="font-weight: bold;">#:columns</span> '(*) <span style="font-weight: bold;">#:functions</span> '() <span style="font-weight: bold;">#:ret</span> 'all
   <span style="font-weight: bold;">#:group-by</span> #f <span style="font-weight: bold;">#:order-by</span> #f)
</pre>
</div>

<ul class="org-ul">
<li><code class="src src-scheme"><span style="font-weight: bold;">#:column</span></code> is the list of columns to get.</li>
</ul>


<ul class="org-ul">
<li><code class="src src-scheme"><span style="font-weight: bold;">#:functions</span></code> is a function to call, e.g:</li>
</ul>
<div class="org-src-container">
<pre class="src src-scheme"><span style="font-weight: bold;">#:functions</span> '((count Persons.Lastname))
</pre>
</div>


<ul class="org-ul">
<li><code class="src src-scheme"><span style="font-weight: bold;">#:ret</span></code> specifies how to return the result, there are three options:
<ul class="org-ul">
<li>'all for returning all results</li>
<li>'top for returning the first result</li>
<li>integer (larger than 0), to give it the end of a range from 0 to this number to give as result.</li>
</ul></li>
</ul>


<ul class="org-ul">
<li><code class="src src-scheme"><span style="font-weight: bold;">#:group-by</span></code> used in conjunction with the aggregate functions to group the result-set by one or more columns.</li>
</ul>


<ul class="org-ul">
<li><code class="src src-scheme"><span style="font-weight: bold;">#:order-by</span></code> used to sort the result-set by one or more columns.</li>
</ul>


<p>
For example, to get Lastname and City column, and return the first result.
</p>
<div class="org-src-container">
<pre class="src src-scheme">(m 'get 'Persons <span style="font-weight: bold;">#:columns</span> '(Lastname City) <span style="font-weight: bold;">#:ret</span> 'top)
</pre>
</div>
</div>
</div>
<div id="outline-container-orga2667a4" class="outline-4">
<h4 id="orga2667a4"><span class="section-number-4">15.6.5.</span> Set values to table</h4>
<div class="outline-text-4" id="text-15-6-5">
<div class="org-src-container">
<pre class="src src-scheme">(m 'set table-name . kargs)
</pre>
</div>

<p>
<b>kargs</b> is a var-list that takes key-value arguments.
</p>

<p>
For example:
</p>
<div class="org-src-container">
<pre class="src src-scheme">(m 'set 'Persons <span style="font-weight: bold;">#:name</span> <span style="color: #ff0000;">"nala"</span> <span style="font-weight: bold;">#:age</span> 99 <span style="font-weight: bold;">#:email</span> <span style="color: #ff0000;">"nala@artanis.com"</span>)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgcbbc83b" class="outline-4">
<h4 id="orgcbbc83b"><span class="section-number-4">15.6.6.</span> Drop a table</h4>
<div class="outline-text-4" id="text-15-6-6">
<div class="org-src-container">
<pre class="src src-scheme">(m 'drop table-name)
</pre>
</div>
</div>
</div>
<div id="outline-container-org3543c22" class="outline-4">
<h4 id="org3543c22"><span class="section-number-4">15.6.7.</span> Check existence of table</h4>
<div class="outline-text-4" id="text-15-6-7">
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #66cdaa;">;; </span><span style="color: #66cdaa;">case sensitive</span>
(m 'exists? table-name . columns)
<span style="color: #66cdaa;">;; </span><span style="color: #66cdaa;">or for case-insensitive</span>
(m 'ci-exists? table-name . columns)
</pre>
</div>

<p>
For example:
</p>
<div class="org-src-container">
<pre class="src src-scheme">(m 'exists? 'Persons 'city 'lastname)
</pre>
</div>
</div>
</div>
<div id="outline-container-org69fc13f" class="outline-4">
<h4 id="org69fc13f"><span class="section-number-4">15.6.8.</span> Get schema of a table</h4>
<div class="outline-text-4" id="text-15-6-8">
<div class="org-src-container">
<pre class="src src-scheme">(m 'schema table-name)
</pre>
</div>

<p>
<i>NOTE: all the returned names of the schema will be in lowercase.</i>
</p>
</div>
</div>
</div>
<div id="outline-container-org59ddff9" class="outline-3">
<h3 id="org59ddff9"><span class="section-number-3">15.7.</span> SQL Mapping (experimental)</h3>
<div class="outline-text-3" id="text-15-7">
<p>
To be continued &#x2026;
</p>
</div>
</div>
</div>
<div id="outline-container-org10423ad" class="outline-2">
<h2 id="org10423ad"><span class="section-number-2">16.</span> RESTful API</h2>
<div class="outline-text-2" id="text-16">
<p>
GNU Artanis provides a command <code class="src src-bash">art api</code> to generate RESTful API skeleton, and the API version can be managed.
</p>

<div class="org-src-container">
<pre class="src src-bash">art api -c

creating   restful API v1
create     app/api/v1.scm
</pre>
</div>

<p>
The generated file <b>app/api/v1.scm</b> will contain such a line:
</p>
<div class="org-src-container">
<pre class="src src-scheme">(define-restful-api v1) <span style="color: #66cdaa;">; </span><span style="color: #66cdaa;">DO NOT REMOVE THIS LINE!!!</span>
</pre>
</div>

<p>
<b>v1</b> is the default version, if you may specify your prefered API version, for example, <b>v3</b>:
</p>
<div class="org-src-container">
<pre class="src src-bash">art api -c -v v3
</pre>
</div>
<p>
<code class="src src-bash">-c</code> means to create.
</p>

<p>
You should use <code class="src src-scheme">api-define</code> to define the RESTful API:
</p>
<div class="org-src-container">
<pre class="src src-scheme">(api-define rule handler)
</pre>
</div>

<p>
<code class="src src-scheme">api-define</code> is an overloaded method of the controller define function. So you may use it like what you do with the controller in MVC. Here's a pseudo example:
</p>
<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #4169e1;">define</span> (<span style="color: #ffd700;">auth-err</span>)
  (scm-&gt;json `((status ,status) (reason <span style="color: #ff0000;">"Auth error!"</span>))))

(api-define article/list
  (options <span style="font-weight: bold;">#:mime</span> 'json <span style="font-weight: bold;">#:with-auth</span> auth-err)
  (<span style="color: #4169e1;">lambda</span> (rc) ...))
</pre>
</div>
<p>
Although the registered URL is <code class="src src-scheme"><span style="color: #ff0000;">"article/list"</span></code>, the actual API would be <code class="src src-scheme"><span style="color: #ff0000;">"v1/article/list"</span></code>, depends on the specified API version.
</p>
</div>
</div>
