docs/manual.org
* MIME
src_scheme[:exports code]{#:mime} method is used to return the proper MIME type in the HTTP response.
#+begin_src scheme
#:mime type ; for registering type
(:mime rc body) ; to emit the reponse with the proper MIME
#+end_src
** JSON
GNU Artanis integrates the third-party module [[https://github.com/aconchillo/guile-json][guile-json]] to parse json.
You can use the #:mime method to handle JSON:
#+begin_src scheme
(get "/json" #:mime 'json
     (lambda (rc)
       (let ((j (scm->json-string '(("name" . "nala") ("age" . 15)))))
         (:mime rc j))))
#+end_src

For example:
#+begin_src scheme
(define my-json
  '((name . nala) (age . 15)
    (read_list
     ("book1" "The interpreter and structure of Artanis")
     ("book2" "The art of Artanis programming"))))
(scm->json-string my-json) ; scm->json will print a json string
;; ==> {"name" : "nala",
;;      "age" : 15,
;;      "read_list" : {"book2" : "The art of Artanis programming",
;;                     "book1" : "The interpreter and structure of Artanis"}}
#+end_src

src_scheme[:exports code]{scm->json} will return a hash-table to represent a JSON object.

If you need to format JSON as a string to return to the client, please use src_scheme[:exports code]{scm->json-string}.
** CSV
GNU Artanis integrates the third-party module [[https://github.com/NalaGinrut/guile-csv][guile-csv]] to parse csv.
You can use the #:mime method to handle CSV:
#+begin_src scheme
(get "/csv" #:mime 'csv
     (lambda (rc)
       (:mime rc '(("a" "1") ("b" "2")))))
#+end_src
** XML
In Scheme, XML is handled with SXML. Another way would be to append the text to a common string.
#+begin_src scheme
(get "/xml" #:mime 'xml
     (lambda (rc)
       (:mime rc '(*TOP* (WEIGHT (@ (unit "pound"))
                                 (NET (@ (certified "certified")) "67")
                                 (GROSS "95"))))))
#+end_src

The rendered result to the client will be:
#+begin_src xml
<WEIGHT unit="pound">
  <NET certified="certified">67</NET>
  <GROSS>95</GROSS>
</WEIGHT>
#+end_src

** SXML
You can use SXML to replace XML for exchanging data format. This way saves some bandwidth.
#+begin_src scheme
(get "/sxml" #:mime 'sxml
     (lambda (rc)
       (:mime rc '((a 1) (b 2)))))
#+end_src
* Upload files
If you want to be able to upload files, store-uploaded-files is your friend.
** Receive an upload from the client
The typical configuration of an uploading WebAPI looks like this:

#+BEGIN_SRC scheme
(post "/upload" #:from-post '(store #:path "upload" #:sync #f)
      (lambda (rc)
        (case (:from-post rc 'store)
          ((success) (response-emit "upload succeeded!"))
          ((none) (response-emit "No uploaded files!"))
          (else (response-emit "Impossible! please report bug!")))))
#+END_SRC

However, you may use the low-level API for more configurations as well:
#+begin_src scheme
(store-uploaded-files rc #:path (current-upload-path)
                      #:uid #f
                      #:gid #f
                      #:simple-ret? #t
                      #:mode #o664
                      #:path-mode #o775
                      #:sync #f)
#+end_src

*rc* is the route-context.

src_scheme[:exports code]{#:path} is the specified path to put uploaded files.

src_scheme[:exports code]{#:uid} is new UID for the uploaded files, #f uses the default UID.

src_scheme[:exports code]{#:gid} specifies the GID.

src_scheme[:exports code]{#:simple-ret?} specifies the mode of return:
+ if #t, there're only two possible return value, 'success for success, 'none for nothing has been done.
+ if #f, and while it's successful, it returns a list to show more details: (success size-list filename-list).

src_scheme[:exports code]{#:mode} chmod files to mode.

src_scheme[:exports code]{#:path-mode} chmod upload path to mode.

src_scheme[:exports code]{#:sync} sync while storing files.
** Send an upload to a Server
Although GNU Artanis is often used in server-side, we provide this function for users to upload files from the client.
#+begin_src scheme
(upload-files-to uri pattern)
#+end_src

*uri* is standard HTTP URL:
#+begin_src nil
scheme://[user:password@]domain:port/path?query_string#fragment_id
#+end_src

*pattern* should be:  ((file filelist ...) (data datalist ...)), for example:
#+begin_src scheme
(upload-files-to "ftp://nala:123@myupload.com/"
                 '((data ("data1" "hello world"))
                   (file ("file1" "filename") ("file2" "filename2"))))
#+end_src
