docs/manual.html
<div id="outline-container-org52aa787" class="outline-2">
<h2 id="org52aa787"><span class="section-number-2">17.</span> MIME</h2>
<div class="outline-text-2" id="text-17">
<p>
<code class="src src-scheme"><span style="font-weight: bold;">#:mime</span></code> method is used to return the proper MIME type in the HTTP response.
</p>
<div class="org-src-container">
<pre class="src src-scheme"><span style="font-weight: bold;">#:mime</span> type <span style="color: #66cdaa;">; </span><span style="color: #66cdaa;">for registering type</span>
(<span style="font-weight: bold;">:mime</span> rc body) <span style="color: #66cdaa;">; </span><span style="color: #66cdaa;">to emit the reponse with the proper MIME</span>
</pre>
</div>
</div>
<div id="outline-container-org032262f" class="outline-3">
<h3 id="org032262f"><span class="section-number-3">17.1.</span> JSON</h3>
<div class="outline-text-3" id="text-17-1">
<p>
GNU Artanis integrates the third-party module <a href="https://github.com/aconchillo/guile-json">guile-json</a> to parse json.
You can use the #:mime method to handle JSON:
</p>
<div class="org-src-container">
<pre class="src src-scheme">(get <span style="color: #ff0000;">"/json"</span> <span style="font-weight: bold;">#:mime</span> 'json
     (<span style="color: #4169e1;">lambda</span> (rc)
       (<span style="color: #4169e1;">let</span> ((j (scm-&gt;json-string '((<span style="color: #ff0000;">"name"</span> . <span style="color: #ff0000;">"nala"</span>) (<span style="color: #ff0000;">"age"</span> . 15)))))
         (<span style="font-weight: bold;">:mime</span> rc j))))
</pre>
</div>

<p>
For example:
</p>
<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #4169e1;">define</span> <span style="color: #ffd700;">my-json</span>
  '((name . nala) (age . 15)
    (read_list
     (<span style="color: #ff0000;">"book1"</span> <span style="color: #ff0000;">"The interpreter and structure of Artanis"</span>)
     (<span style="color: #ff0000;">"book2"</span> <span style="color: #ff0000;">"The art of Artanis programming"</span>))))
(scm-&gt;json-string my-json) <span style="color: #66cdaa;">; </span><span style="color: #66cdaa;">scm-&gt;json will print a json string</span>
<span style="color: #66cdaa;">;; </span><span style="color: #66cdaa;">==&gt; {"name" : "nala",</span>
<span style="color: #66cdaa;">;;      </span><span style="color: #66cdaa;">"age" : 15,</span>
<span style="color: #66cdaa;">;;      </span><span style="color: #66cdaa;">"read_list" : {"book2" : "The art of Artanis programming",</span>
<span style="color: #66cdaa;">;;                     </span><span style="color: #66cdaa;">"book1" : "The interpreter and structure of Artanis"}}</span>
</pre>
</div>

<p>
<code class="src src-scheme">scm-&gt;json</code> will return a hash-table to represent a JSON object.
</p>

<p>
If you need to format JSON as a string to return to the client, please use <code class="src src-scheme">scm-&gt;json-string</code>.
</p>
</div>
</div>
<div id="outline-container-org64e7385" class="outline-3">
<h3 id="org64e7385"><span class="section-number-3">17.2.</span> CSV</h3>
<div class="outline-text-3" id="text-17-2">
<p>
GNU Artanis integrates the third-party module <a href="https://github.com/NalaGinrut/guile-csv">guile-csv</a> to parse csv.
You can use the #:mime method to handle CSV:
</p>
<div class="org-src-container">
<pre class="src src-scheme">(get <span style="color: #ff0000;">"/csv"</span> <span style="font-weight: bold;">#:mime</span> 'csv
     (<span style="color: #4169e1;">lambda</span> (rc)
       (<span style="font-weight: bold;">:mime</span> rc '((<span style="color: #ff0000;">"a"</span> <span style="color: #ff0000;">"1"</span>) (<span style="color: #ff0000;">"b"</span> <span style="color: #ff0000;">"2"</span>)))))
</pre>
</div>
</div>
</div>
<div id="outline-container-org01013e0" class="outline-3">
<h3 id="org01013e0"><span class="section-number-3">17.3.</span> XML</h3>
<div class="outline-text-3" id="text-17-3">
<p>
In Scheme, XML is handled with SXML. Another way would be to append the text to a common string.
</p>
<div class="org-src-container">
<pre class="src src-scheme">(get <span style="color: #ff0000;">"/xml"</span> <span style="font-weight: bold;">#:mime</span> 'xml
     (<span style="color: #4169e1;">lambda</span> (rc)
       (<span style="font-weight: bold;">:mime</span> rc '(*TOP* (WEIGHT (@ (unit <span style="color: #ff0000;">"pound"</span>))
                                 (NET (@ (certified <span style="color: #ff0000;">"certified"</span>)) <span style="color: #ff0000;">"67"</span>)
                                 (GROSS <span style="color: #ff0000;">"95"</span>))))))
</pre>
</div>

<p>
The rendered result to the client will be:
</p>
<div class="org-src-container">
<pre class="src src-xml">&lt;<span style="color: #ffd700;">WEIGHT</span> <span style="color: #00ff00;">unit</span>=<span style="color: #ff0000;">"pound"</span>&gt;
  &lt;<span style="color: #ffd700;">NET</span> <span style="color: #00ff00;">certified</span>=<span style="color: #ff0000;">"certified"</span>&gt;67&lt;/<span style="color: #ffd700;">NET</span>&gt;
  &lt;<span style="color: #ffd700;">GROSS</span>&gt;95&lt;/<span style="color: #ffd700;">GROSS</span>&gt;
&lt;/<span style="color: #ffd700;">WEIGHT</span>&gt;
</pre>
</div>
</div>
</div>

<div id="outline-container-org9b67c0f" class="outline-3">
<h3 id="org9b67c0f"><span class="section-number-3">17.4.</span> SXML</h3>
<div class="outline-text-3" id="text-17-4">
<p>
You can use SXML to replace XML for exchanging data format. This way saves some bandwidth.
</p>
<div class="org-src-container">
<pre class="src src-scheme">(get <span style="color: #ff0000;">"/sxml"</span> <span style="font-weight: bold;">#:mime</span> 'sxml
     (<span style="color: #4169e1;">lambda</span> (rc)
       (<span style="font-weight: bold;">:mime</span> rc '((a 1) (b 2)))))
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org029726c" class="outline-2">
<h2 id="org029726c"><span class="section-number-2">18.</span> Upload files</h2>
<div class="outline-text-2" id="text-18">
<p>
If you want to be able to upload files, store-uploaded-files is your friend.
</p>
</div>
<div id="outline-container-org9a4ab1b" class="outline-3">
<h3 id="org9a4ab1b"><span class="section-number-3">18.1.</span> Receive an upload from the client</h3>
<div class="outline-text-3" id="text-18-1">
<p>
The typical configuration of an uploading WebAPI looks like this:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(post <span style="color: #ff0000;">"/upload"</span> <span style="font-weight: bold;">#:from-post</span> '(store <span style="font-weight: bold;">#:path</span> <span style="color: #ff0000;">"upload"</span> <span style="font-weight: bold;">#:sync</span> #f)
      (<span style="color: #4169e1;">lambda</span> (rc)
        (<span style="color: #4169e1;">case</span> (<span style="font-weight: bold;">:from-post</span> rc 'store)
          ((success) (response-emit <span style="color: #ff0000;">"upload succeeded!"</span>))
          ((none) (response-emit <span style="color: #ff0000;">"No uploaded files!"</span>))
          (<span style="color: #4169e1;">else</span> (response-emit <span style="color: #ff0000;">"Impossible! please report bug!"</span>)))))
</pre>
</div>

<p>
However, you may use the low-level API for more configurations as well:
</p>
<div class="org-src-container">
<pre class="src src-scheme">(store-uploaded-files rc <span style="font-weight: bold;">#:path</span> (current-upload-path)
                      <span style="font-weight: bold;">#:uid</span> #f
                      <span style="font-weight: bold;">#:gid</span> #f
                      <span style="font-weight: bold;">#:simple-ret?</span> #t
                      <span style="font-weight: bold;">#:mode</span> #o664
                      <span style="font-weight: bold;">#:path-mode</span> #o775
                      <span style="font-weight: bold;">#:sync</span> #f)
</pre>
</div>

<p>
<b>rc</b> is the route-context.
</p>

<p>
<code class="src src-scheme"><span style="font-weight: bold;">#:path</span></code> is the specified path to put uploaded files.
</p>

<p>
<code class="src src-scheme"><span style="font-weight: bold;">#:uid</span></code> is new UID for the uploaded files, #f uses the default UID.
</p>

<p>
<code class="src src-scheme"><span style="font-weight: bold;">#:gid</span></code> specifies the GID.
</p>

<p>
<code class="src src-scheme"><span style="font-weight: bold;">#:simple-ret?</span></code> specifies the mode of return:
</p>
<ul class="org-ul">
<li>if #t, there're only two possible return value, 'success for success, 'none for nothing has been done.</li>
<li>if #f, and while it's successful, it returns a list to show more details: (success size-list filename-list).</li>
</ul>

<p>
<code class="src src-scheme"><span style="font-weight: bold;">#:mode</span></code> chmod files to mode.
</p>

<p>
<code class="src src-scheme"><span style="font-weight: bold;">#:path-mode</span></code> chmod upload path to mode.
</p>

<p>
<code class="src src-scheme"><span style="font-weight: bold;">#:sync</span></code> sync while storing files.
</p>
</div>
</div>
<div id="outline-container-orge68b066" class="outline-3">
<h3 id="orge68b066"><span class="section-number-3">18.2.</span> Send an upload to a Server</h3>
<div class="outline-text-3" id="text-18-2">
<p>
Although GNU Artanis is often used in server-side, we provide this function for users to upload files from the client.
</p>
<div class="org-src-container">
<pre class="src src-scheme">(upload-files-to uri pattern)
</pre>
</div>

<p>
<b>uri</b> is standard HTTP URL:
</p>
<div class="org-src-container">
<pre class="src src-nil">scheme://[user:password@]domain:port/path?query_string#fragment_id
</pre>
</div>

<p>
<b>pattern</b> should be:  ((file filelist &#x2026;) (data datalist &#x2026;)), for example:
</p>
<div class="org-src-container">
<pre class="src src-scheme">(upload-files-to <span style="color: #ff0000;">"ftp://nala:123@myupload.com/"</span>
                 '((data (<span style="color: #ff0000;">"data1"</span> <span style="color: #ff0000;">"hello world"</span>))
                   (file (<span style="color: #ff0000;">"file1"</span> <span style="color: #ff0000;">"filename"</span>) (<span style="color: #ff0000;">"file2"</span> <span style="color: #ff0000;">"filename2"</span>))))
</pre>
</div>
</div>
</div>
</div>
