docs/manual.org
* Sessions
You can use src_scheme[:exports code]{#:session mode} to define a URL rule handler.
#+begin_src scheme
(post "/auth" #:session mode
      (lambda (rc) ...))
#+end_src

*mode* can be:
+ #t or 'spawn, to spawn a new session, the name of the SID is "sid" by default.
+ `(spawn ,sid) to specify the name of the sid to spawn.
+ `(spawn ,sid ,proc) to specify the name of the sid and a proc to *define your own session spawner*.

And the APIs of the session is :session
#+begin_src scheme
(:session rc cmd)
#+end_src

*cmd* can be:
+  'check to check the session with name "sid".
+  `(check ,sid) to check the session with a specified sid name.
+  'check-and-spawn to check "sid" first, if it doesn't exist, then spawn new.
+  `(check-and-spawn ,sid) to do the same as above, but with specifying the sid name.
+  `(check-and-spawn-and-keep ,sid) to check, then spawn, then keep, specifying the sid name.
+  'spawn to spawn a session with the name "sid".
+  'spawn-and-keep to spawn a session then keep with the name "sid".
+  'drop to remove the current session by "sid".
+  `(drop ,sid) to remove the session by the specifed sid.

** Session backend
Artanis provide several backends for implementing sessions in the lower-level. Please take a look
at the description of src_scheme[:exports code]{session.backend} in your artanis.conf.
* Cookies
You can use src_scheme[:exports code]{#:cookies mode} to define a URL rule handler.
#+begin_src scheme
(get "/certain-rule" #:cookies mode
     (lambda (rc) ...))
#+end_src

*mode* can be:
+ ('names names ...) to create cookie objects with specified names.
+ ('custom (names ...) maker setter getter modifier) to specify a more complicated customized cookie handler.

Cookie object is used to create/modify the cookie that will return to the client automatically. This is the instance of a cookie which can be controlled in server-side.

If you want to get the cookie from the client, you should use src_scheme[:exports code]{:cookies-value}.

And the APIs:
#+begin_src scheme
(:cookies-set! rc cookie-name key val)

(:cookies-ref rc cookie-name key)

(:cookies-setattr! rc cookie-name #:expir #f #:domain #f
                   #:path #f #:secure #f #:http-only #f)

(:cookies-remove! rc key) ; remove cookie from client
(:cookies-value rc name) ; get cookie from the client
#+end_src

For example:
#+begin_src scheme
(get "/cookie" #:cookies '(names cc)
     (lambda (rc)
       (:cookies-set! rc 'cc "sid" "123321")
       "ok"))

(get "/cookie/:expires" #:cookies '(names cc)
     (lambda (rc)
       ;; link the cookie object with actual cookie
       (:cookies-set! rc 'cc "sid" (:cookies-value rc "sid"))
       (:cookies-setattr! rc 'cc #:expir (string->number (params rc "expires")))
       "ok"))
#+end_src

You should link the actual cookie "sid" to the created cookie 'cc, then you can control it. Otherwise it doesn't work.


You can use these commands in your console to see the results:
#+begin_src nil
curl --head localhost:3000/cookie
# and
curl --head localhost:3000/cookie/120
#+end_src

* Authentication
** Init Authentication
GNU Artanis provides flexible mechanism for authentication.

You can use src_scheme[:exports code]{#:auth mode} to define a URL rule handler.
#+begin_src scheme
(get "/certain-rule" #:auth mode
     (lambda (rc) ...))
#+end_src

*mode* can be:
+ SQL as [[String Template][string template]]. You can write your own custom SQL string to fetch & check your username and password.
+ src_scheme[:exports code]{('basic (lambda (rc user passwd) ...))} init Basic Authentication mode. /user/ is the username, and /passwd/ is the password.
+ src_scheme[:exports code]{('table table-name username-field passwd-field)} init a common Authentication mode. *The passwd will be encrypted by the default algorithm*.
+ src_scheme[:exports code]{('table table-name username-field passwd-field crypto-proc)} similar to the above item, but encrypt passwd with crypto-proc.
+ src_scheme[:exports code]{(table-name crypto-proc)}, so the passwd field will be "passwd" and username will be "username" by default.You can encrypt the passwd with crypto-proc.

Available crypto-proc helper functions listed here:
#+BEGIN_SRC scheme
(string->md5 <string>)
(string->sha-1 <string>)
(string->sha-224 <string>)
(string->sha-256 <string>)
(string->sha-384 <string>)
(string->sha-512 <string>)
#+END_SRC

NOTE: Please make sure that the src_scheme[:exports code]{username-field} and src_scheme[:exports code]{passwd-field} must be the same with
the field name specifed in the submit form of you web page code.

For example, if there is a form on you page:
#+BEGIN_SRC html
<input type="password" name="passwd">
#+END_SRC

Please notice that name of password input was specified to src_scheme[:exports code]{"passwd"}.

Then you should write authentication like this:

#+BEGIN_SRC scheme
(post "/auth" #:auth '(table user "user" "passwd") #:session #t
      (lambda (rc) ...))
#+END_SRC

Please notice that the src_scheme[:exports code]{"passwd"} here is the same with what you specified in the form.
