docs/manual.html
<div id="outline-container-org4981a57" class="outline-2">
<h2 id="org4981a57"><span class="section-number-2">19.</span> Sessions</h2>
<div class="outline-text-2" id="text-19">
<p>
You can use <code class="src src-scheme"><span style="font-weight: bold;">#:session</span> mode</code> to define a URL rule handler.
</p>
<div class="org-src-container">
<pre class="src src-scheme">(post <span style="color: #ff0000;">"/auth"</span> <span style="font-weight: bold;">#:session</span> mode
      (<span style="color: #4169e1;">lambda</span> (rc) ...))
</pre>
</div>

<p>
<b>mode</b> can be:
</p>
<ul class="org-ul">
<li>#t or 'spawn, to spawn a new session, the name of the SID is "sid" by default.</li>
<li>`(spawn ,sid) to specify the name of the sid to spawn.</li>
<li>`(spawn ,sid ,proc) to specify the name of the sid and a proc to <b>define your own session spawner</b>.</li>
</ul>

<p>
And the APIs of the session is :session
</p>
<div class="org-src-container">
<pre class="src src-scheme">(<span style="font-weight: bold;">:session</span> rc cmd)
</pre>
</div>

<p>
<b>cmd</b> can be:
</p>
<ul class="org-ul">
<li>'check to check the session with name "sid".</li>
<li>`(check ,sid) to check the session with a specified sid name.</li>
<li>'check-and-spawn to check "sid" first, if it doesn't exist, then spawn new.</li>
<li>`(check-and-spawn ,sid) to do the same as above, but with specifying the sid name.</li>
<li>`(check-and-spawn-and-keep ,sid) to check, then spawn, then keep, specifying the sid name.</li>
<li>'spawn to spawn a session with the name "sid".</li>
<li>'spawn-and-keep to spawn a session then keep with the name "sid".</li>
<li>'drop to remove the current session by "sid".</li>
<li>`(drop ,sid) to remove the session by the specifed sid.</li>
</ul>
</div>

<div id="outline-container-orgf431690" class="outline-3">
<h3 id="orgf431690"><span class="section-number-3">19.1.</span> Session backend</h3>
<div class="outline-text-3" id="text-19-1">
<p>
Artanis provide several backends for implementing sessions in the lower-level. Please take a look
at the description of <code class="src src-scheme">session.backend</code> in your artanis.conf.
</p>
</div>
</div>
</div>
<div id="outline-container-orga094eb3" class="outline-2">
<h2 id="orga094eb3"><span class="section-number-2">20.</span> Cookies</h2>
<div class="outline-text-2" id="text-20">
<p>
You can use <code class="src src-scheme"><span style="font-weight: bold;">#:cookies</span> mode</code> to define a URL rule handler.
</p>
<div class="org-src-container">
<pre class="src src-scheme">(get <span style="color: #ff0000;">"/certain-rule"</span> <span style="font-weight: bold;">#:cookies</span> mode
     (<span style="color: #4169e1;">lambda</span> (rc) ...))
</pre>
</div>

<p>
<b>mode</b> can be:
</p>
<ul class="org-ul">
<li>('names names &#x2026;) to create cookie objects with specified names.</li>
<li>('custom (names &#x2026;) maker setter getter modifier) to specify a more complicated customized cookie handler.</li>
</ul>

<p>
Cookie object is used to create/modify the cookie that will return to the client automatically. This is the instance of a cookie which can be controlled in server-side.
</p>

<p>
If you want to get the cookie from the client, you should use <code class="src src-scheme"><span style="font-weight: bold;">:cookies-value</span></code>.
</p>

<p>
And the APIs:
</p>
<div class="org-src-container">
<pre class="src src-scheme">(<span style="font-weight: bold;">:cookies-set!</span> rc cookie-name key val)

(<span style="font-weight: bold;">:cookies-ref</span> rc cookie-name key)

(<span style="font-weight: bold;">:cookies-setattr!</span> rc cookie-name <span style="font-weight: bold;">#:expir</span> #f <span style="font-weight: bold;">#:domain</span> #f
                   <span style="font-weight: bold;">#:path</span> #f <span style="font-weight: bold;">#:secure</span> #f <span style="font-weight: bold;">#:http-only</span> #f)

(<span style="font-weight: bold;">:cookies-remove!</span> rc key) <span style="color: #66cdaa;">; </span><span style="color: #66cdaa;">remove cookie from client</span>
(<span style="font-weight: bold;">:cookies-value</span> rc name) <span style="color: #66cdaa;">; </span><span style="color: #66cdaa;">get cookie from the client</span>
</pre>
</div>

<p>
For example:
</p>
<div class="org-src-container">
<pre class="src src-scheme">(get <span style="color: #ff0000;">"/cookie"</span> <span style="font-weight: bold;">#:cookies</span> '(names cc)
     (<span style="color: #4169e1;">lambda</span> (rc)
       (<span style="font-weight: bold;">:cookies-set!</span> rc 'cc <span style="color: #ff0000;">"sid"</span> <span style="color: #ff0000;">"123321"</span>)
       <span style="color: #ff0000;">"ok"</span>))

(get <span style="color: #ff0000;">"/cookie/:expires"</span> <span style="font-weight: bold;">#:cookies</span> '(names cc)
     (<span style="color: #4169e1;">lambda</span> (rc)
       <span style="color: #66cdaa;">;; </span><span style="color: #66cdaa;">link the cookie object with actual cookie</span>
       (<span style="font-weight: bold;">:cookies-set!</span> rc 'cc <span style="color: #ff0000;">"sid"</span> (<span style="font-weight: bold;">:cookies-value</span> rc <span style="color: #ff0000;">"sid"</span>))
       (<span style="font-weight: bold;">:cookies-setattr!</span> rc 'cc <span style="font-weight: bold;">#:expir</span> (string-&gt;number (params rc <span style="color: #ff0000;">"expires"</span>)))
       <span style="color: #ff0000;">"ok"</span>))
</pre>
</div>

<p>
You should link the actual cookie "sid" to the created cookie 'cc, then you can control it. Otherwise it doesn't work.
</p>


<p>
You can use these commands in your console to see the results:
</p>
<div class="org-src-container">
<pre class="src src-nil">curl --head localhost:3000/cookie
# and
curl --head localhost:3000/cookie/120
</pre>
</div>
</div>
</div>

<div id="outline-container-org6b6ba58" class="outline-2">
<h2 id="org6b6ba58"><span class="section-number-2">21.</span> Authentication</h2>
<div class="outline-text-2" id="text-21">
</div>
<div id="outline-container-org9f2f02b" class="outline-3">
<h3 id="org9f2f02b"><span class="section-number-3">21.1.</span> Init Authentication</h3>
<div class="outline-text-3" id="text-21-1">
<p>
GNU Artanis provides flexible mechanism for authentication.
</p>

<p>
You can use <code class="src src-scheme"><span style="font-weight: bold;">#:auth</span> mode</code> to define a URL rule handler.
</p>
<div class="org-src-container">
<pre class="src src-scheme">(get <span style="color: #ff0000;">"/certain-rule"</span> <span style="font-weight: bold;">#:auth</span> mode
     (<span style="color: #4169e1;">lambda</span> (rc) ...))
</pre>
</div>

<p>
<b>mode</b> can be:
</p>
<ul class="org-ul">
<li>SQL as <a href="#org5923817">string template</a>. You can write your own custom SQL string to fetch &amp; check your username and password.</li>
<li><code class="src src-scheme">('basic (<span style="color: #4169e1;">lambda</span> (rc user passwd) ...))</code> init Basic Authentication mode. <i>user</i> is the username, and <i>passwd</i> is the password.</li>
<li><code class="src src-scheme">('table table-name username-field passwd-field)</code> init a common Authentication mode. <b>The passwd will be encrypted by the default algorithm</b>.</li>
<li><code class="src src-scheme">('table table-name username-field passwd-field crypto-proc)</code> similar to the above item, but encrypt passwd with crypto-proc.</li>
<li><code class="src src-scheme">(table-name crypto-proc)</code>, so the passwd field will be "passwd" and username will be "username" by default.You can encrypt the passwd with crypto-proc.</li>
</ul>

<p>
Available crypto-proc helper functions listed here:
</p>
<div class="org-src-container">
<pre class="src src-scheme">(string-&gt;md5 <span style="color: #00ffff;">&lt;string&gt;</span>)
(string-&gt;sha-1 <span style="color: #00ffff;">&lt;string&gt;</span>)
(string-&gt;sha-224 <span style="color: #00ffff;">&lt;string&gt;</span>)
(string-&gt;sha-256 <span style="color: #00ffff;">&lt;string&gt;</span>)
(string-&gt;sha-384 <span style="color: #00ffff;">&lt;string&gt;</span>)
(string-&gt;sha-512 <span style="color: #00ffff;">&lt;string&gt;</span>)
</pre>
</div>

<p>
NOTE: Please make sure that the <code class="src src-scheme">username-field</code> and <code class="src src-scheme">passwd-field</code> must be the same with
the field name specifed in the submit form of you web page code.
</p>

<p>
For example, if there is a form on you page:
</p>
<div class="org-src-container">
<pre class="src src-html">&lt;<span style="color: #ffd700;">input</span> <span style="color: #00ff00;">type</span>=<span style="color: #ff0000;">"password"</span> <span style="color: #00ff00;">name</span>=<span style="color: #ff0000;">"passwd"</span>&gt;
</pre>
</div>

<p>
Please notice that name of password input was specified to <code class="src src-scheme"><span style="color: #ff0000;">"passwd"</span></code>.
</p>

<p>
Then you should write authentication like this:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(post <span style="color: #ff0000;">"/auth"</span> <span style="font-weight: bold;">#:auth</span> '(table user <span style="color: #ff0000;">"user"</span> <span style="color: #ff0000;">"passwd"</span>) <span style="font-weight: bold;">#:session</span> #t
      (<span style="color: #4169e1;">lambda</span> (rc) ...))
</pre>
</div>

<p>
Please notice that the <code class="src src-scheme"><span style="color: #ff0000;">"passwd"</span></code> here is the same with what you specified in the form.
</p>
</div>
</div>
