docs/manual.org
** Basic Authentication
The HTTP Basic authentication (BA) implementation is the simplest technique for enforcing access control
to web resources, as it doesn't require cookies, session identifiers, or login pages. But rather uses
static, standard HTTP headers, which means that no extra handshakes are necessary for the connection.

The BA mechanism provides no protection for the transmitted credentials. They are merely
encoded with Base64, but not encrypted or hashed in any way. For that reason, Basic Authentication
is typically used over HTTPS.

/*GNU Artanis doesn't support HTTPS at present. There are plans to support it in the future.*/

Let's see a simple example:
#+begin_src scheme
(define (my-checker rc user passwd)
  (and (string=? user "jack") (string=? passwd "123")))

(post "/bauth" #:auth `(basic ,my-checker)
      (lambda (rc)
        (if (:auth rc)
            "auth ok"
            (throw-auth-needed))))
#+end_src

Another simple way to provide authentication is to compare the passsword stored in a database table:
#+BEGIN_SRC scheme
(post "/bauth" #:auth `(basic Person username passwd)
      (lambda (rc) ... ))
#+END_SRC

NOTE: Assuming *username* and *passwd* are columns of the Person table.


You have to define your own checker with the anonymous function src_scheme[:exports code]{(lambda (rc u p) ...)}. #t to show success, and #f to fail.

APIs:

+ src_scheme[:exports code]{(:auth rc)} will check if Basic Authentication succeeded, #f if not.
+ src_scheme[:exports code]{(throw-auth-needed)} is a useful helper function to ask for auth in client side.
** Common Authentication
There are multiple authentication methods that can be used by developers. Most of them are sort of tricky hacks. Here are the most common.

The most common, and relatively safe way to authenticate, is to use the POST method, and check the username and passwd from a table in the DB.

There are several ways to provide authentication.

The simplest case is for [[String Template][String Template]]:
#+BEGIN_SRC scheme
#:auth "string-template"
#+END_SRC

If you save the account data in a database table, then you can use the table mode:
#+BEGIN_SRC scheme
#:auth `(table ,table-name [,username-field] [,passwd-field] [,salt-field] [,hmac])
#+END_SRC

NOTE: The square-braced *[args]* above are optional.

The default values for the optional items are:
+ username-field: username
+ passwd-field: passwd
+ salt-field: salt

TODO: remove the brackets for salt-field, as it says below that it's not optional.
And specify whether "optional" means that can be skipped or set to #f to use the default value.

*GNU Artanis requires a salted password, it's not optional.*

So please prepare a field in a table for the salt string. It's your responsibility to generate a
salt string, please see [[Random String Generator][Random String Generator]]. When authenticating, please specify the
salt field name in the salt-field argument.

For hmac item, please see [[HMAC][HMAC]].

** Login Authentication
Usually, when doing a login, you will need both src_scheme[:exports code]{#:auth} and src_scheme[:exports code]{#:session} options for a long time session.
The first step is to authenticate, if it's successful, then spawn a new session for this request.

Here is a simple example:

#+begin_src scheme
(post "/auth"
 #:auth '(table user "user" "passwd")
 #:session #t
 (lambda (rc)
   (cond
    ((:session rc 'check) "auth ok (session)")
    ((:auth rc)
     (:session rc 'spawn)
     "auth ok")
    (else (redirect-to rc "/login?login_failed=true")))))
#+end_src

*NOTE: The passwd will be encrypted by the default algorithm.*

** Authenticate checking
If certain page requires authencation first, then how to check it properly?

In GNU Artanis, the *session-id* is the only token to check if the client has already been authenticated.
By default, the *session-id* is named as *SID* in cookies.
You may use src_scheme[:exports code]{#:with-auth} to do all the works automatically for you.

#+BEGIN_SRC scheme
(get "/dashboard"
  #:with-auth <options>
  (lambda (rc)
    (view-render "dashboard" (the-environment))))
#+END_SRC

For example, assuming you have a page */dashboard* requires login, then you may set src_scheme[:exports code]{#:with-auth} with
certain option. We will explain this option later. Each time user visit */dashboard* page, GNU Artanis will check if there's
valid *session-id* from client's cookies, if yes, then run the handler to generate the response; if no, then jump to the related
auth failed handler, depends on the option you specified.

Here's available *options*:
+ src_scheme[:exports code]{#t} means the default failure activity: redirect to */login* page.
+ URL in string, specify the login page URL. For example, src_scheme[:exports code]{#:with-auth "/admin/login"}.
+ src_scheme[:exports code]{'status} will return a 401 page with status code 401, which could be checked by cilent.
+ *Thunk* can be used to generate customized response by users. A thunk is a function without parameter.
  For example, src_scheme[:exports code]{#:with-auth (lambda () (scm->json-string '((status . 401) (reason . "No auth"))))}.
  This is useful to customize your protocol in JSON for RESTful API.

*NOTE:* Different from other [[Shortcuts][shortcuts]], there's no src_scheme[:exports code]{:with-auth} *apply* for user customized operations
inside the handler. If you use src_scheme[:exports code]{#:with-auth}, then all related works are handled by GNU Artanis.

** Customized Authentication
#+BEGIN_SRC scheme
;; (define (checker username passwd) ...)
#:auth `(post ,username ,passwd ,checker)
#+END_SRC
This mode will parse and return *username* and *password* by the specified field name in query-string.
What matters here is that you can write your own checker for customization.
** Websocket Authentication
See [[Websocket authentication][Websocket authencation]]
