docs/manual.html
<div id="outline-container-orgba1adfb" class="outline-3">
<h3 id="orgba1adfb"><span class="section-number-3">21.2.</span> Basic Authentication</h3>
<div class="outline-text-3" id="text-21-2">
<p>
The HTTP Basic authentication (BA) implementation is the simplest technique for enforcing access control
to web resources, as it doesn't require cookies, session identifiers, or login pages. But rather uses
static, standard HTTP headers, which means that no extra handshakes are necessary for the connection.
</p>

<p>
The BA mechanism provides no protection for the transmitted credentials. They are merely
encoded with Base64, but not encrypted or hashed in any way. For that reason, Basic Authentication
is typically used over HTTPS.
</p>

<p>
<i><b>GNU Artanis doesn't support HTTPS at present. There are plans to support it in the future.</b></i>
</p>

<p>
Let's see a simple example:
</p>
<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #4169e1;">define</span> (<span style="color: #ffd700;">my-checker</span> rc user passwd)
  (<span style="color: #4169e1;">and</span> (string=? user <span style="color: #ff0000;">"jack"</span>) (string=? passwd <span style="color: #ff0000;">"123"</span>)))

(post <span style="color: #ff0000;">"/bauth"</span> <span style="font-weight: bold;">#:auth</span> `(basic ,my-checker)
      (<span style="color: #4169e1;">lambda</span> (rc)
        (<span style="color: #4169e1;">if</span> (<span style="font-weight: bold;">:auth</span> rc)
            <span style="color: #ff0000;">"auth ok"</span>
            (throw-auth-needed))))
</pre>
</div>

<p>
Another simple way to provide authentication is to compare the passsword stored in a database table:
</p>
<div class="org-src-container">
<pre class="src src-scheme">(post <span style="color: #ff0000;">"/bauth"</span> <span style="font-weight: bold;">#:auth</span> `(basic Person username passwd)
      (<span style="color: #4169e1;">lambda</span> (rc) ... ))
</pre>
</div>

<p>
NOTE: Assuming <b>username</b> and <b>passwd</b> are columns of the Person table.
</p>


<p>
You have to define your own checker with the anonymous function <code class="src src-scheme">(<span style="color: #4169e1;">lambda</span> (rc u p) ...)</code>. #t to show success, and #f to fail.
</p>

<p>
APIs:
</p>

<ul class="org-ul">
<li><code class="src src-scheme">(<span style="font-weight: bold;">:auth</span> rc)</code> will check if Basic Authentication succeeded, #f if not.</li>
<li><code class="src src-scheme">(throw-auth-needed)</code> is a useful helper function to ask for auth in client side.</li>
</ul>
</div>
</div>
<div id="outline-container-org392e484" class="outline-3">
<h3 id="org392e484"><span class="section-number-3">21.3.</span> Common Authentication</h3>
<div class="outline-text-3" id="text-21-3">
<p>
There are multiple authentication methods that can be used by developers. Most of them are sort of tricky hacks. Here are the most common.
</p>

<p>
The most common, and relatively safe way to authenticate, is to use the POST method, and check the username and passwd from a table in the DB.
</p>

<p>
There are several ways to provide authentication.
</p>

<p>
The simplest case is for <a href="#org5923817">String Template</a>:
</p>
<div class="org-src-container">
<pre class="src src-scheme"><span style="font-weight: bold;">#:auth</span> <span style="color: #ff0000;">"string-template"</span>
</pre>
</div>

<p>
If you save the account data in a database table, then you can use the table mode:
</p>
<div class="org-src-container">
<pre class="src src-scheme"><span style="font-weight: bold;">#:auth</span> `(table ,table-name [,username-field] [,passwd-field] [,salt-field] [,hmac])
</pre>
</div>

<p>
NOTE: The square-braced <b>[args]</b> above are optional.
</p>

<p>
The default values for the optional items are:
</p>
<ul class="org-ul">
<li>username-field: username</li>
<li>passwd-field: passwd</li>
<li>salt-field: salt</li>
</ul>

<p>
TODO: remove the brackets for salt-field, as it says below that it's not optional.
And specify whether "optional" means that can be skipped or set to #f to use the default value.
</p>

<p>
<b>GNU Artanis requires a salted password, it's not optional.</b>
</p>

<p>
So please prepare a field in a table for the salt string. It's your responsibility to generate a
salt string, please see <a href="#org0295962">Random String Generator</a>. When authenticating, please specify the
salt field name in the salt-field argument.
</p>

<p>
For hmac item, please see <a href="#org302091d">HMAC</a>.
</p>
</div>
</div>

<div id="outline-container-org548c654" class="outline-3">
<h3 id="org548c654"><span class="section-number-3">21.4.</span> Login Authentication</h3>
<div class="outline-text-3" id="text-21-4">
<p>
Usually, when doing a login, you will need both <code class="src src-scheme"><span style="font-weight: bold;">#:auth</span></code> and <code class="src src-scheme"><span style="font-weight: bold;">#:session</span></code> options for a long time session.
The first step is to authenticate, if it's successful, then spawn a new session for this request.
</p>

<p>
Here is a simple example:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(post <span style="color: #ff0000;">"/auth"</span>
 <span style="font-weight: bold;">#:auth</span> '(table user <span style="color: #ff0000;">"user"</span> <span style="color: #ff0000;">"passwd"</span>)
 <span style="font-weight: bold;">#:session</span> #t
 (<span style="color: #4169e1;">lambda</span> (rc)
   (<span style="color: #4169e1;">cond</span>
    ((<span style="font-weight: bold;">:session</span> rc 'check) <span style="color: #ff0000;">"auth ok (session)"</span>)
    ((<span style="font-weight: bold;">:auth</span> rc)
     (<span style="font-weight: bold;">:session</span> rc 'spawn)
     <span style="color: #ff0000;">"auth ok"</span>)
    (<span style="color: #4169e1;">else</span> (redirect-to rc <span style="color: #ff0000;">"/login?login_failed=true"</span>)))))
</pre>
</div>

<p>
<b>NOTE: The passwd will be encrypted by the default algorithm.</b>
</p>
</div>
</div>

<div id="outline-container-org4a3c586" class="outline-3">
<h3 id="org4a3c586"><span class="section-number-3">21.5.</span> Authenticate checking</h3>
<div class="outline-text-3" id="text-21-5">
<p>
If certain page requires authencation first, then how to check it properly?
</p>

<p>
In GNU Artanis, the <b>session-id</b> is the only token to check if the client has already been authenticated.
By default, the <b>session-id</b> is named as <b>SID</b> in cookies.
You may use <code class="src src-scheme"><span style="font-weight: bold;">#:with-auth</span></code> to do all the works automatically for you.
</p>

<div class="org-src-container">
<pre class="src src-scheme">(get <span style="color: #ff0000;">"/dashboard"</span>
  <span style="font-weight: bold;">#:with-auth</span> <span style="color: #00ffff;">&lt;options&gt;</span>
  (<span style="color: #4169e1;">lambda</span> (rc)
    (view-render <span style="color: #ff0000;">"dashboard"</span> (the-environment))))
</pre>
</div>

<p>
For example, assuming you have a page <b>/dashboard</b> requires login, then you may set <code class="src src-scheme"><span style="font-weight: bold;">#:with-auth</span></code> with
certain option. We will explain this option later. Each time user visit <b>/dashboard</b> page, GNU Artanis will check if there's
valid <b>session-id</b> from client's cookies, if yes, then run the handler to generate the response; if no, then jump to the related
auth failed handler, depends on the option you specified.
</p>

<p>
Here's available <b>options</b>:
</p>
<ul class="org-ul">
<li><code class="src src-scheme">#t</code> means the default failure activity: redirect to <b>/login</b> page.</li>
<li>URL in string, specify the login page URL. For example, <code class="src src-scheme"><span style="font-weight: bold;">#:with-auth</span> <span style="color: #ff0000;">"/admin/login"</span></code>.</li>
<li><code class="src src-scheme">'status</code> will return a 401 page with status code 401, which could be checked by cilent.</li>
<li><b>Thunk</b> can be used to generate customized response by users. A thunk is a function without parameter.
For example, <code class="src src-scheme"><span style="font-weight: bold;">#:with-auth</span> (<span style="color: #4169e1;">lambda</span> () (scm-&gt;json-string '((status . 401) (reason . <span style="color: #ff0000;">"No auth"</span>))))</code>.
This is useful to customize your protocol in JSON for RESTful API.</li>
</ul>

<p>
<b>NOTE:</b> Different from other <a href="#orge1c4e4b">shortcuts</a>, there's no <code class="src src-scheme"><span style="font-weight: bold;">:with-auth</span></code> <b>apply</b> for user customized operations
inside the handler. If you use <code class="src src-scheme"><span style="font-weight: bold;">#:with-auth</span></code>, then all related works are handled by GNU Artanis.
</p>
</div>
</div>

<div id="outline-container-orge8d48bc" class="outline-3">
<h3 id="orge8d48bc"><span class="section-number-3">21.6.</span> Customized Authentication</h3>
<div class="outline-text-3" id="text-21-6">
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #66cdaa;">;; </span><span style="color: #66cdaa;">(define (checker username passwd) ...)</span>
<span style="font-weight: bold;">#:auth</span> `(post ,username ,passwd ,checker)
</pre>
</div>
<p>
This mode will parse and return <b>username</b> and <b>password</b> by the specified field name in query-string.
What matters here is that you can write your own checker for customization.
</p>
</div>
</div>
<div id="outline-container-org7f13a48" class="outline-3">
<h3 id="org7f13a48"><span class="section-number-3">21.7.</span> Websocket Authentication</h3>
<div class="outline-text-3" id="text-21-7">
<p>
See <a href="#orgb415ea3">Websocket authencation</a>
</p>
</div>
</div>
