docs/manual.org
** HMAC
[[https://en.wikipedia.org/wiki/HMAC][HMAC]] is a hash-based message authentication code.
It's dangerous to store the passwd in a raw string.
A safer way is to salt then hash with a strong cryptograpic hash function when storing the passwd.

The default salt is a random string got from the operating system.
And the default cryptographic hash function is SHA256.
You can set your own HMAC function, as in this example:

#+begin_src scheme
(define (my-hmac passwd salt)
  (string->sha-512 (format #f "~a-~a-~a" passwd salt (current-time))))

(post "/auth" #:auth `(table user "user" "passwd" "salt" ,my-hmac)
      ...... )
#+end_src

The default HMAC function is:
#+BEGIN_SRC scheme
(define (default-hmac passwd salt)
  (string->sha-256 (string-append passwd salt)))
#+END_SRC

For more on hash functions, please refer to [[Cryptographic hash functions][Cryptographic hash functions]].
* Cache
** On web caching
Web caching is very important nowadays. This section discusses proper web
caching. It is not a full product guide document, but it may help to understand how to
cache data in GNU Artanis.

(to be continued...)
** Cache APIs
You can use src_scheme[:exports code]{#:cache mode} to define a URL rule handler.
#+begin_src scheme
(get "/certain-rule" #:cache mode
     (lambda (rc) ...))
#+end_src

*/NOTE/*: the default value of "maxage" (3600 seconds) is defined by src_scheme[:exports code]{cache.maxage} in src_scheme[:exports code]{/etc/artanis/artanis.conf}.

*mode* can be:
+ src_scheme[:exports code]{#t} to enable caching the page.
+ src_scheme[:exports code]{#f} to disable caching the page explicitly. It's the default value.
+ src_scheme[:exports code]{('static [maxage <- 3600])} to be used for static files. The URL rule must be a real path to a static file.
+ src_scheme[:exports code]{(filename [maxage <- 3600])} to cache a static file. This is useful when you don't want to reveal the actual path of the static file, but use a fake URL for it.
+ src_scheme[:exports code]{('public filename [maxage <- 3600])} to allow proxies cache the content of specified static file. If HTTP authentication is required, responses are automatically set to "private".
+ src_scheme[:exports code]{('private filename [maxage <- 3600])} to not allow proxies cache the content of specified static file.

Let's set a simple cache setting for dynamic content:
#+begin_src scheme
(get "/new" #:cache #t
     (lambda (rc)
       (:cache rc "hello world")))
#+end_src

If you want to cache a static file, and permit proxies cache the content:
#+begin_src scheme
(get "/hide" #:cache '(public "/some.html")
     (lambda (rc)
       (:cache rc)))
#+end_src

But, if your current URL rule is used for authentication (once you use src_scheme[:exports code]{#:auth}), the cache will be changed to *private* even if you specify *public*.
#+begin_src scheme
(get "/pauth"
  #:auth `(basic ,(lambda (rc u p) (and (string=? u "nala")
                                        (string=? p "123"))))
  #:cache '(public "/some.html") ; will be changed to 'private' forcely.
  (lambda (rc) (:cache rc)))
#+end_src

* Shortcuts
** What is shortcuts?
/shortcuts/ are a series of special functions. They're used to simplify the complex
operations, according to the configuration specified by the related keyword, set
after a URL-rule.

It was named /OHT/ which stands for /Optional Handler Table/, which indicates the basic
principle to be implemented. But it was too hard to remember. So let's just call it /shortcut/.

Anyway, you may find them in the module [[https://gitlab.com/NalaGinrut/artanis/blob/master/artanis/oht.scm][(artanis oht)]].

It's good practice to use /shortcuts/ as possible and avoid calling low-level APIs.

Each shortcut consists of 2 parts: *config* and *apply*.

*config* is to configure a certain service for the specific URL rule. This configuration
will only be availble to this URL rule, and independent to other registered URL rules.

*apply* is used to call specific functions related to your configuration in the *config* step.
The first argument of the *apply* method must be a src_scheme[:exports code]{route-context} ([[Route context][route context]]).

** Database connection

This is a useful feature to use when you connect to a database.
The shortcut provides a way to interact with the raw connection.
The connection is fetched from the connection pool, which is created
at GNU Artanis's start up.

#+BEGIN_SRC scheme
;; config
#:conn #t

;; apply
(:conn <route-context> [sql])
#+END_SRC

+ The second argument is optional, if it's missing, then src_scheme[:exports code]{:conn}
  will return the raw connection after applying src_scheme[:exports code]{(:conn rc)}.
  + NOTE: If you haven't set src_scheme[:exports code]{#:conn #t}, and applied
    src_scheme[:exports code]{(:conn rc)}, then src_scheme[:exports code]{(rc-conn rc)}
    will return src_scheme[:exports code]{#f}. This is why you shouldn't use low-level
    src_scheme[:exports code]{(rc-conn rc)}.
+ If you pass a second argument, it should be a valid SQL query string.
  The returned value is described in [[DB connection pool][DB connection pool]].
  + You can create the SQL query string with [[SSQL][SSQL]].

** Raw SQL

This shortcut is useful for a simple one-shot query.

#+BEGIN_SRC scheme
;; config
#:raw-sql sql

;; apply
(:raw-sql <route-context> mode)
#+END_SRC

*Sql* must be a valid SQL query string.

*Mode* is one of:
+ 'all for getting all the results.
+ 'top for getting the first result.
+ A positive integer to indicate how many results should be returned.

