docs/manual.html
<div id="outline-container-org302091d" class="outline-3">
<h3 id="org302091d"><span class="section-number-3">21.8.</span> HMAC</h3>
<div class="outline-text-3" id="text-21-8">
<p>
<a href="https://en.wikipedia.org/wiki/HMAC">HMAC</a> is a hash-based message authentication code.
It's dangerous to store the passwd in a raw string.
A safer way is to salt then hash with a strong cryptograpic hash function when storing the passwd.
</p>

<p>
The default salt is a random string got from the operating system.
And the default cryptographic hash function is SHA256.
You can set your own HMAC function, as in this example:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #4169e1;">define</span> (<span style="color: #ffd700;">my-hmac</span> passwd salt)
  (string-&gt;sha-512 (format #f <span style="color: #ff0000;">"~a-~a-~a"</span> passwd salt (current-time))))

(post <span style="color: #ff0000;">"/auth"</span> <span style="font-weight: bold;">#:auth</span> `(table user <span style="color: #ff0000;">"user"</span> <span style="color: #ff0000;">"passwd"</span> <span style="color: #ff0000;">"salt"</span> ,my-hmac)
      ...... )
</pre>
</div>

<p>
The default HMAC function is:
</p>
<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #4169e1;">define</span> (<span style="color: #ffd700;">default-hmac</span> passwd salt)
  (string-&gt;sha-256 (string-append passwd salt)))
</pre>
</div>

<p>
For more on hash functions, please refer to <a href="#orgf80fe5c">Cryptographic hash functions</a>.
</p>
</div>
</div>
</div>
<div id="outline-container-orgd80fecc" class="outline-2">
<h2 id="orgd80fecc"><span class="section-number-2">22.</span> Cache</h2>
<div class="outline-text-2" id="text-22">
</div>
<div id="outline-container-orgeca8b7e" class="outline-3">
<h3 id="orgeca8b7e"><span class="section-number-3">22.1.</span> On web caching</h3>
<div class="outline-text-3" id="text-22-1">
<p>
Web caching is very important nowadays. This section discusses proper web
caching. It is not a full product guide document, but it may help to understand how to
cache data in GNU Artanis.
</p>

<p>
(to be continued&#x2026;)
</p>
</div>
</div>
<div id="outline-container-org9b18438" class="outline-3">
<h3 id="org9b18438"><span class="section-number-3">22.2.</span> Cache APIs</h3>
<div class="outline-text-3" id="text-22-2">
<p>
You can use <code class="src src-scheme"><span style="font-weight: bold;">#:cache</span> mode</code> to define a URL rule handler.
</p>
<div class="org-src-container">
<pre class="src src-scheme">(get <span style="color: #ff0000;">"/certain-rule"</span> <span style="font-weight: bold;">#:cache</span> mode
     (<span style="color: #4169e1;">lambda</span> (rc) ...))
</pre>
</div>

<p>
<b><i>NOTE</i></b>: the default value of "maxage" (3600 seconds) is defined by <code class="src src-scheme">cache.maxage</code> in <code class="src src-scheme">/etc/artanis/artanis.conf</code>.
</p>

<p>
<b>mode</b> can be:
</p>
<ul class="org-ul">
<li><code class="src src-scheme">#t</code> to enable caching the page.</li>
<li><code class="src src-scheme">#f</code> to disable caching the page explicitly. It's the default value.</li>
<li><code class="src src-scheme">('static [maxage &lt;- 3600])</code> to be used for static files. The URL rule must be a real path to a static file.</li>
<li><code class="src src-scheme">(filename [maxage &lt;- 3600])</code> to cache a static file. This is useful when you don't want to reveal the actual path of the static file, but use a fake URL for it.</li>
<li><code class="src src-scheme">('public filename [maxage &lt;- 3600])</code> to allow proxies cache the content of specified static file. If HTTP authentication is required, responses are automatically set to "private".</li>
<li><code class="src src-scheme">('private filename [maxage &lt;- 3600])</code> to not allow proxies cache the content of specified static file.</li>
</ul>

<p>
Let's set a simple cache setting for dynamic content:
</p>
<div class="org-src-container">
<pre class="src src-scheme">(get <span style="color: #ff0000;">"/new"</span> <span style="font-weight: bold;">#:cache</span> #t
     (<span style="color: #4169e1;">lambda</span> (rc)
       (<span style="font-weight: bold;">:cache</span> rc <span style="color: #ff0000;">"hello world"</span>)))
</pre>
</div>

<p>
If you want to cache a static file, and permit proxies cache the content:
</p>
<div class="org-src-container">
<pre class="src src-scheme">(get <span style="color: #ff0000;">"/hide"</span> <span style="font-weight: bold;">#:cache</span> '(public <span style="color: #ff0000;">"/some.html"</span>)
     (<span style="color: #4169e1;">lambda</span> (rc)
       (<span style="font-weight: bold;">:cache</span> rc)))
</pre>
</div>

<p>
But, if your current URL rule is used for authentication (once you use <code class="src src-scheme"><span style="font-weight: bold;">#:auth</span></code>), the cache will be changed to <b>private</b> even if you specify <b>public</b>.
</p>
<div class="org-src-container">
<pre class="src src-scheme">(get <span style="color: #ff0000;">"/pauth"</span>
  <span style="font-weight: bold;">#:auth</span> `(basic ,(<span style="color: #4169e1;">lambda</span> (rc u p) (<span style="color: #4169e1;">and</span> (string=? u <span style="color: #ff0000;">"nala"</span>)
                                        (string=? p <span style="color: #ff0000;">"123"</span>))))
  <span style="font-weight: bold;">#:cache</span> '(public <span style="color: #ff0000;">"/some.html"</span>) <span style="color: #66cdaa;">; </span><span style="color: #66cdaa;">will be changed to 'private' forcely.</span>
  (<span style="color: #4169e1;">lambda</span> (rc) (<span style="font-weight: bold;">:cache</span> rc)))
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orge1c4e4b" class="outline-2">
<h2 id="orge1c4e4b"><span class="section-number-2">23.</span> Shortcuts</h2>
<div class="outline-text-2" id="text-23">
</div>
<div id="outline-container-orgfef5175" class="outline-3">
<h3 id="orgfef5175"><span class="section-number-3">23.1.</span> What is shortcuts?</h3>
<div class="outline-text-3" id="text-23-1">
<p>
<i>shortcuts</i> are a series of special functions. They're used to simplify the complex
operations, according to the configuration specified by the related keyword, set
after a URL-rule.
</p>

<p>
It was named <i>OHT</i> which stands for <i>Optional Handler Table</i>, which indicates the basic
principle to be implemented. But it was too hard to remember. So let's just call it <i>shortcut</i>.
</p>

<p>
Anyway, you may find them in the module <a href="https://gitlab.com/NalaGinrut/artanis/blob/master/artanis/oht.scm">(artanis oht)</a>.
</p>

<p>
It's good practice to use <i>shortcuts</i> as possible and avoid calling low-level APIs.
</p>

<p>
Each shortcut consists of 2 parts: <b>config</b> and <b>apply</b>.
</p>

<p>
<b>config</b> is to configure a certain service for the specific URL rule. This configuration
will only be availble to this URL rule, and independent to other registered URL rules.
</p>

<p>
<b>apply</b> is used to call specific functions related to your configuration in the <b>config</b> step.
The first argument of the <b>apply</b> method must be a <code class="src src-scheme">route-context</code> (<a href="#org044c7e5">route context</a>).
</p>
</div>
</div>

<div id="outline-container-orgef3748c" class="outline-3">
<h3 id="orgef3748c"><span class="section-number-3">23.2.</span> Database connection</h3>
<div class="outline-text-3" id="text-23-2">
<p>
This is a useful feature to use when you connect to a database.
The shortcut provides a way to interact with the raw connection.
The connection is fetched from the connection pool, which is created
at GNU Artanis's start up.
</p>

<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #66cdaa;">;; </span><span style="color: #66cdaa;">config</span>
<span style="font-weight: bold;">#:conn</span> #t

<span style="color: #66cdaa;">;; </span><span style="color: #66cdaa;">apply</span>
(<span style="font-weight: bold;">:conn</span> <span style="color: #00ffff;">&lt;route-context&gt;</span> [sql])
</pre>
</div>

<ul class="org-ul">
<li>The second argument is optional, if it's missing, then <code class="src src-scheme"><span style="font-weight: bold;">:conn</span></code>
will return the raw connection after applying <code class="src src-scheme">(<span style="font-weight: bold;">:conn</span> rc)</code>.
<ul class="org-ul">
<li>NOTE: If you haven't set <code class="src src-scheme"><span style="font-weight: bold;">#:conn</span> #t</code>, and applied
<code class="src src-scheme">(<span style="font-weight: bold;">:conn</span> rc)</code>, then <code class="src src-scheme">(rc-conn rc)</code>
will return <code class="src src-scheme">#f</code>. This is why you shouldn't use low-level
<code class="src src-scheme">(rc-conn rc)</code>.</li>
</ul></li>
<li>If you pass a second argument, it should be a valid SQL query string.
The returned value is described in <a href="#org7d93196">DB connection pool</a>.
<ul class="org-ul">
<li>You can create the SQL query string with <a href="#org8890e84">SSQL</a>.</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org5392ea3" class="outline-3">
<h3 id="org5392ea3"><span class="section-number-3">23.3.</span> Raw SQL</h3>
<div class="outline-text-3" id="text-23-3">
<p>
This shortcut is useful for a simple one-shot query.
</p>

<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #66cdaa;">;; </span><span style="color: #66cdaa;">config</span>
<span style="font-weight: bold;">#:raw-sql</span> sql

<span style="color: #66cdaa;">;; </span><span style="color: #66cdaa;">apply</span>
(<span style="font-weight: bold;">:raw-sql</span> <span style="color: #00ffff;">&lt;route-context&gt;</span> mode)
</pre>
</div>

<p>
<b>Sql</b> must be a valid SQL query string.
</p>

<p>
<b>Mode</b> is one of:
</p>
<ul class="org-ul">
<li>'all for getting all the results.</li>
<li>'top for getting the first result.</li>
<li>A positive integer to indicate how many results should be returned.</li>
</ul>
</div>
</div>
