docs/manual.org
** String template

This is a shortcut for [[String Template][string template]]. Sometimes it's useful when you just need a quick way to
use a string template. It doesn't support multi templates, so if you do need to, please use
the traditional [[String Template]].

#+BEGIN_SRC scheme
;; config
#:str "string template"

;; apply
(:str <route-context> key-values ...)
#+END_SRC

Please checkout [[String Template][string template]] to find out how to use the /string-template/ and /key-values/.

** SQL-Mapping shortcut (unfinished)

This is related to [[SQL Mapping (experimental)][SQL-Mapping]], which is still experimental, maybe you should wait for
the next version if you wish to use it.

#+BEGIN_SRC scheme
;; config
#:sql-mapping config-patterns

;; apply
(:sql-mapping <route-context> command ...)
#+END_SRC

*config-patterns* can be any of:
+ src_scheme[:exports code]{#t} enable the simple sql-mapping.
+ src_scheme[:exports code]{`(path ,path ,name)}
  Fetch the sql-mapping with /name/ in the specified /path/.
  + /name/ must be an object of the symbol type.
  + /path/ must be an object of the string type, and an existing path in your filesystem.
+ src_scheme[:exports code]{`(add ,name ,sql-template)}
  Fetch the sql-mapping with /name/ rendered from /sql-template/.
  + /name/ should be an object of the symbol type.
  + /sql-template/ is described in more detail in [[SQL Mapping (experimental)][SQL-Mapping]].

** Authentication shortcut
See [[Authentication][Authentication]].
* Websocket (Experimental)
** Websocket introduction
Websockets are becoming more and more important for modern web development.
GNU Artanis is trying to provide an industrial strength and efficient Websocket implementation.
Websockets are important for GNU Artanis's design. Please see [[Principles][Principles]] for more details.

** Websocket basic usage

In GNU Artanis, a Websocket handling is triggered by setting it on a specific URL.
You should use src_scheme[:exports code]{#:websocket} to configure the Websocket.
Here's the API definition:
#+BEGIN_SRC scheme
#:websocket (proto protocol-name ['inexclusive])
#+END_SRC
*'inexclusive* is optional. By default, each Websocket connection only servs one client.
However, sometimes we do need to multicast the messages to several clients. Enable *'inexclusive* is the
easiest way, but it may cause the similar issue to file-description-leaking. There're two suggestions:
- Set and check security token to prevent malicious programs establish massive connections.
- If you want to do muticasting as in pub/sub, then use different token or named-pipe to subscribe. And maintain
  a subscribers table for multicasting.

Here's a simple example for common cases:
#+BEGIN_SRC scheme
(use-modules (artanis artanis))

(get "/echo" #:websocket '(proto echo)
     (lambda (rc)
       (:websocket rc 'payload)))

(run #:port 3000)
#+END_SRC

In this simple test, we choose the simplest *echo* protocol of the Websocket.
This will return back the string sent from the client.
Let's also write a simple javascript function for the web frontend:

#+BEGIN_SRC js
function WebSocketTest()
{
    if ("WebSocket" in window)
    {
        document.write("<p>WebSocket is supported by your Browser!</p>");

        // Let us open a web socket
        var ws = new WebSocket("ws://localhost:3000/echo");

        ws.onopen = function()
        {
            // Web Socket is connected, send data using send()
            ws.send("hello world");
            document.write("<p>Message is sent...</p>");
        };

        ws.onmessage = function (evt)
        {
            var received_msg = evt.data;
            document.write("<p>hello welcome...</p>");
        };

        ws.onclose = function()
        {
            // websocket is closed.
            document.write("<p>Connection is closed...</p>");
        };

        window.onbeforeunload = function(event) {
            socket.close();
        };
    }
    else
    {
        // Your browser doesn't support WebSockets
        document.write("<p>WebSocket NOT supported by your Browser!</p>");
    }
}
#+END_SRC

