docs/manual.html

<div id="outline-container-org876c05b" class="outline-3">
<h3 id="org876c05b"><span class="section-number-3">23.4.</span> String template</h3>
<div class="outline-text-3" id="text-23-4">
<p>
This is a shortcut for <a href="#org5923817">string template</a>. Sometimes it's useful when you just need a quick way to
use a string template. It doesn't support multi templates, so if you do need to, please use
the traditional <a href="#org5923817">27.1</a>.
</p>

<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #66cdaa;">;; </span><span style="color: #66cdaa;">config</span>
<span style="font-weight: bold;">#:str</span> <span style="color: #ff0000;">"string template"</span>

<span style="color: #66cdaa;">;; </span><span style="color: #66cdaa;">apply</span>
(<span style="font-weight: bold;">:str</span> <span style="color: #00ffff;">&lt;route-context&gt;</span> key-values ...)
</pre>
</div>

<p>
Please checkout <a href="#org5923817">string template</a> to find out how to use the <i>string-template</i> and <i>key-values</i>.
</p>
</div>
</div>

<div id="outline-container-org64cdbf3" class="outline-3">
<h3 id="org64cdbf3"><span class="section-number-3">23.5.</span> SQL-Mapping shortcut (unfinished)</h3>
<div class="outline-text-3" id="text-23-5">
<p>
This is related to <a href="#org59ddff9">SQL-Mapping</a>, which is still experimental, maybe you should wait for
the next version if you wish to use it.
</p>

<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #66cdaa;">;; </span><span style="color: #66cdaa;">config</span>
<span style="font-weight: bold;">#:sql-mapping</span> config-patterns

<span style="color: #66cdaa;">;; </span><span style="color: #66cdaa;">apply</span>
(<span style="font-weight: bold;">:sql-mapping</span> <span style="color: #00ffff;">&lt;route-context&gt;</span> command ...)
</pre>
</div>

<p>
<b>config-patterns</b> can be any of:
</p>
<ul class="org-ul">
<li><code class="src src-scheme">#t</code> enable the simple sql-mapping.</li>
<li><code class="src src-scheme">`(path ,path ,name)</code>
Fetch the sql-mapping with <i>name</i> in the specified <i>path</i>.
<ul class="org-ul">
<li><i>name</i> must be an object of the symbol type.</li>
<li><i>path</i> must be an object of the string type, and an existing path in your filesystem.</li>
</ul></li>
<li><code class="src src-scheme">`(add ,name ,sql-template)</code>
Fetch the sql-mapping with <i>name</i> rendered from <i>sql-template</i>.
<ul class="org-ul">
<li><i>name</i> should be an object of the symbol type.</li>
<li><i>sql-template</i> is described in more detail in <a href="#org59ddff9">SQL-Mapping</a>.</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org221ee4a" class="outline-3">
<h3 id="org221ee4a"><span class="section-number-3">23.6.</span> Authentication shortcut</h3>
<div class="outline-text-3" id="text-23-6">
<p>
See <a href="#org6b6ba58">Authentication</a>.
</p>
</div>
</div>
</div>
<div id="outline-container-orgf88fdc8" class="outline-2">
<h2 id="orgf88fdc8"><span class="section-number-2">24.</span> Websocket (Experimental)</h2>
<div class="outline-text-2" id="text-24">
</div>
<div id="outline-container-org5de36db" class="outline-3">
<h3 id="org5de36db"><span class="section-number-3">24.1.</span> Websocket introduction</h3>
<div class="outline-text-3" id="text-24-1">
<p>
Websockets are becoming more and more important for modern web development.
GNU Artanis is trying to provide an industrial strength and efficient Websocket implementation.
Websockets are important for GNU Artanis's design. Please see <a href="#org61783da">Principles</a> for more details.
</p>
</div>
</div>

<div id="outline-container-orgd80994e" class="outline-3">
<h3 id="orgd80994e"><span class="section-number-3">24.2.</span> Websocket basic usage</h3>
<div class="outline-text-3" id="text-24-2">
<p>
In GNU Artanis, a Websocket handling is triggered by setting it on a specific URL.
You should use <code class="src src-scheme"><span style="font-weight: bold;">#:websocket</span></code> to configure the Websocket.
Here's the API definition:
</p>
<div class="org-src-container">
<pre class="src src-scheme"><span style="font-weight: bold;">#:websocket</span> (proto protocol-name ['inexclusive])
</pre>
</div>
<p>
<b>'inexclusive</b> is optional. By default, each Websocket connection only servs one client.
However, sometimes we do need to multicast the messages to several clients. Enable <b>'inexclusive</b> is the
easiest way, but it may cause the similar issue to file-description-leaking. There're two suggestions:
</p>
<ul class="org-ul">
<li>Set and check security token to prevent malicious programs establish massive connections.</li>
<li>If you want to do muticasting as in pub/sub, then use different token or named-pipe to subscribe. And maintain
a subscribers table for multicasting.</li>
</ul>

<p>
Here's a simple example for common cases:
</p>
<div class="org-src-container">
<pre class="src src-scheme">(use-modules (artanis artanis))

(get <span style="color: #ff0000;">"/echo"</span> <span style="font-weight: bold;">#:websocket</span> '(proto echo)
     (<span style="color: #4169e1;">lambda</span> (rc)
       (<span style="font-weight: bold;">:websocket</span> rc 'payload)))

(run <span style="font-weight: bold;">#:port</span> 3000)
</pre>
</div>

<p>
In this simple test, we choose the simplest <b>echo</b> protocol of the Websocket.
This will return back the string sent from the client.
Let's also write a simple javascript function for the web frontend:
</p>

<div class="org-src-container">
<pre class="src src-js"><span style="color: #4169e1;">function</span> <span style="color: #ffd700;">WebSocketTest</span>()
{
    <span style="color: #4169e1;">if</span> (<span style="color: #ff0000;">"WebSocket"</span> <span style="color: #4169e1;">in</span> window)
    {
        document.write(<span style="color: #ff0000;">"&lt;p&gt;WebSocket is supported by your Browser!&lt;/p&gt;"</span>);

        <span style="color: #66cdaa;">// </span><span style="color: #66cdaa;">Let us open a web socket</span>
        <span style="color: #4169e1;">var</span> <span style="color: #00ff00;">ws</span> = <span style="color: #4169e1;">new</span> <span style="color: #00ffff;">WebSocket</span>(<span style="color: #ff0000;">"ws://localhost:3000/echo"</span>);

        ws.onopen = <span style="color: #4169e1;">function</span>()
        {
            <span style="color: #66cdaa;">// </span><span style="color: #66cdaa;">Web Socket is connected, send data using send()</span>
            ws.send(<span style="color: #ff0000;">"hello world"</span>);
            document.write(<span style="color: #ff0000;">"&lt;p&gt;Message is sent...&lt;/p&gt;"</span>);
        };

        ws.onmessage = <span style="color: #4169e1;">function</span> (<span style="color: #00ff00;">evt</span>)
        {
            <span style="color: #4169e1;">var</span> <span style="color: #00ff00;">received_msg</span> = evt.data;
            document.write(<span style="color: #ff0000;">"&lt;p&gt;hello welcome...&lt;/p&gt;"</span>);
        };

        ws.onclose = <span style="color: #4169e1;">function</span>()
        {
            <span style="color: #66cdaa;">// </span><span style="color: #66cdaa;">websocket is closed.</span>
            document.write(<span style="color: #ff0000;">"&lt;p&gt;Connection is closed...&lt;/p&gt;"</span>);
        };

        window.onbeforeunload = <span style="color: #4169e1;">function</span>(<span style="color: #00ff00;">event</span>) {
            socket.close();
        };
    }
    <span style="color: #4169e1;">else</span>
    {
        <span style="color: #66cdaa;">// </span><span style="color: #66cdaa;">Your browser doesn't support WebSockets</span>
        document.write(<span style="color: #ff0000;">"&lt;p&gt;WebSocket NOT supported by your Browser!&lt;/p&gt;"</span>);
    }
}
</pre>
</div>
</div>
</div>
