docs/manual.org
** Websocket named-pipe
Artanis provides the named-pipe based on Websocket, which is very useful to interact between the client and server.
/NOTE: The Websocket named-pipe is very useful to implement server-push messaging./

Here is the critical API:
#+BEGIN_SRC scheme
(named-pipe-subscribe <route-context>)
#+END_SRC

Let's try a simple example:
#+BEGIN_SRC scheme
(get "/robot" #:websocket '(proto echo) named-pipe-subscribe)
#+END_SRC

Here we register a WebAPI named src_conf[:exports code]{"/robot"}, and configure it a Websocket API by
src_conf[:exports code]{#:websocket '(proto echo)}. As you may see, we specify its protocol to a simple echo protocal,
it is to say, it will redirect what it receives. Each time it receives a message, it will redirect the message to the
specified named-pipe, and the subscriber of that named-pipe will get the message instantly. The name of the pipe is specified
by the client like this:
#+BEGIN_SRC js
var ws = new WebSocket("ws://localhost:3000/robot?artanis_named_pipe=robot-1");
#+END_SRC
The query-string src_conf[:exports code]{"artanis_named_pipe"} is a special key in Artanis, you MUST use this key to specify the
pipe name. Here we specify the pipe name as src_conf[:exports code]{"robot-1"}.

Now we setup the named-pipe, however, we still need to setup another WebAPI to let the client send message:
#+BEGIN_SRC scheme
(get "/welcome/:whom/:what" #:websocket 'send-only
     (lambda (rc)
       (:websocket rc 'send (params rc "whom") (params rc "what"))
       "ok"))
#+END_SRC
The configure src_conf[:exports code]{"#:websocket 'send-only"} means this API is only for sending, so that it's half-duplex.
And another critical Websocket API here:
#+BEGIN_SRC scheme
(:websocket <route-context> 'send <pipe-name> <data>)
#+END_SRC

Each time you send data from the WebAPI, for example:
#+BEGIN_SRC bash
curl localhost:3000/welcome/robot-1/nala
#+END_SRC
In our simple example of [[https://gitlab.com/NalaGinrut/artanis/blob/master/examples/websocket-named-pipe.html][Websocket named-pipe test]], you should run
The named-pipe will receive the message src_scheme[:exports code]{"nala"},
and the page on the browser will print src_scheme[:exports code]{"hello welcome...nala"} instantly.

** Websocket APIs

*NOTE: The Websocket is in a very preliminary stage. It only support echo.*

*** Websocket configuration
#+BEGIN_SRC scheme
#:websocket `(proto ,protocol_name)
#+END_SRC
*protocol_name* can be:
+ *'echo* for a simple echo test.
  *NOTE:* More protocols will be added in the future.

  #+BEGIN_SRC scheme
#:websocket simple_pattern
  #+END_SRC
  *simple_pattern* can be:
  + *#t* or *'raw* will enable a WebSocket on this URL without specifying the protocol.
    So you will get the raw data from the decoded payload.

  #+BEGIN_SRC scheme
#:websocket `(redirect ,ip/usk)
  #+END_SRC
  This is used for redirecting a Websocket stream to another address.
  ip/usk is an ip or a unix-socket. The string regexp pattern has to match:
  + src_scheme[:exports code]{^ip://(?:[0-9]{1,3}\\.){3}[0-9]{1,3}(:[0-9]{1,5})?$}
  + src_scheme[:exports code]{^unix://[a-zA-Z-_0-9]+\\.socket$}

  #+BEGIN_SRC scheme
#:websocket `(proxy ,protocol)
  #+END_SRC
  Setup a proxy with a specific protocol handler.
  Unlike the regular proxy approach, the proxy in Artanis doesn't
  need a listening port. Since it's always 80/443 or a custom port.
  The client has to have websocket support. And be able to access the specified URL
  to establish a websocket connection. The rest is the same as with a regular proxy.

*** Websocket application

#+BEGIN_SRC scheme
(:websocket <route-context> command)
#+END_SRC
*command* can be:
+ *'payload* to get the decoded data from the client. It's decoded from Websocket frame automatically.
  So you don't have to parse the frame.

** Websocket frame

GNU Artanis provides a Websocket data frame struct, as defined in [[https://tools.ietf.org/html/rfc6455][RFC6455]].

The frame will not be decoded or parsed into a record-type, but will be kept as the binary
frame read from the client, and use bitwise operations to fetch fields.
This kind of `lazy' design saves much time as it doesn't parse unused fields, and makes
it easier to redirect without any serialization.
If users want to get a certain field, Artanis provides APIs for fetching them.
Users can decide how to parse the frames by themselves, which we think is more efficient.

Here are the APIs you can use:

#+BEGIN_SRC scheme
(websocket-frame? <websocket-frame>)
#+END_SRC

#+BEGIN_SRC scheme
;; parser: bytevector -> custom data frame
(websocket-frame-parser <websocket-frame>)
#+END_SRC

*websocket-frame-parser* is the registered reader for the protocol specified by the
src_scheme[:exports code]{#:websocket} configuration. The protocol is customizable based on protobuf.
/NOTE: Custom protocols support hasn't been implemented yet./

#+BEGIN_SRC scheme
(websocket-frame-head <websocket-frame>)
(websocket-frame-final-fragment? <websocket-frame>)
(websocket-frame-opcode <websocket-frame>)
(websocket-frame-payload <websocket-frame>)
(websocket-frame-mask <websocket-frame>)
#+END_SRC
To get the Websocket frame information. See [[https://tools.ietf.org/html/rfc6455#page-27][Data framing]] for details.
+ *head* returns the first 2 bytes in the data frame.
+ *final-fragment* returns true if it's the last frame in a session.
+ *opcode* returns the opcode in the frame. Refer to [[Websocket opcode][Websocket opcode]].
+ *payload* returns the actual encoded data.
+ *mask* returns the frame mask.

