docs/manual.html

<div id="outline-container-org934b19e" class="outline-3">
<h3 id="org934b19e"><span class="section-number-3">24.3.</span> Websocket named-pipe</h3>
<div class="outline-text-3" id="text-24-3">
<p>
Artanis provides the named-pipe based on Websocket, which is very useful to interact between the client and server.
<i>NOTE: The Websocket named-pipe is very useful to implement server-push messaging.</i>
</p>

<p>
Here is the critical API:
</p>
<div class="org-src-container">
<pre class="src src-scheme">(named-pipe-subscribe <span style="color: #00ffff;">&lt;route-context&gt;</span>)
</pre>
</div>

<p>
Let's try a simple example:
</p>
<div class="org-src-container">
<pre class="src src-scheme">(get <span style="color: #ff0000;">"/robot"</span> <span style="font-weight: bold;">#:websocket</span> '(proto echo) named-pipe-subscribe)
</pre>
</div>

<p>
Here we register a WebAPI named <code class="src src-conf"><span style="color: #ff0000;">"/robot"</span></code>, and configure it a Websocket API by
<code class="src src-conf"><span style="color: #66cdaa;">#</span><span style="color: #66cdaa;">:websocket '(proto echo)</span></code>. As you may see, we specify its protocol to a simple echo protocal,
it is to say, it will redirect what it receives. Each time it receives a message, it will redirect the message to the
specified named-pipe, and the subscriber of that named-pipe will get the message instantly. The name of the pipe is specified
by the client like this:
</p>
<div class="org-src-container">
<pre class="src src-js"><span style="color: #4169e1;">var</span> <span style="color: #00ff00;">ws</span> = <span style="color: #4169e1;">new</span> <span style="color: #00ffff;">WebSocket</span>(<span style="color: #ff0000;">"ws://localhost:3000/robot?artanis_named_pipe=robot-1"</span>);
</pre>
</div>
<p>
The query-string <code class="src src-conf"><span style="color: #ff0000;">"artanis_named_pipe"</span></code> is a special key in Artanis, you MUST use this key to specify the
pipe name. Here we specify the pipe name as <code class="src src-conf"><span style="color: #ff0000;">"robot-1"</span></code>.
</p>

<p>
Now we setup the named-pipe, however, we still need to setup another WebAPI to let the client send message:
</p>
<div class="org-src-container">
<pre class="src src-scheme">(get <span style="color: #ff0000;">"/welcome/:whom/:what"</span> <span style="font-weight: bold;">#:websocket</span> 'send-only
     (<span style="color: #4169e1;">lambda</span> (rc)
       (<span style="font-weight: bold;">:websocket</span> rc 'send (params rc <span style="color: #ff0000;">"whom"</span>) (params rc <span style="color: #ff0000;">"what"</span>))
       <span style="color: #ff0000;">"ok"</span>))
</pre>
</div>
<p>
The configure <code class="src src-conf"><span style="color: #ff0000;">"#:websocket 'send-only"</span></code> means this API is only for sending, so that it's half-duplex.
And another critical Websocket API here:
</p>
<div class="org-src-container">
<pre class="src src-scheme">(<span style="font-weight: bold;">:websocket</span> <span style="color: #00ffff;">&lt;route-context&gt;</span> 'send <span style="color: #00ffff;">&lt;pipe-name&gt;</span> <span style="color: #00ffff;">&lt;data&gt;</span>)
</pre>
</div>

<p>
Each time you send data from the WebAPI, for example:
</p>
<div class="org-src-container">
<pre class="src src-bash">curl localhost:3000/welcome/robot-1/nala
</pre>
</div>
<p>
In our simple example of <a href="https://gitlab.com/NalaGinrut/artanis/blob/master/examples/websocket-named-pipe.html">Websocket named-pipe test</a>, you should run
The named-pipe will receive the message <code class="src src-scheme"><span style="color: #ff0000;">"nala"</span></code>,
and the page on the browser will print <code class="src src-scheme"><span style="color: #ff0000;">"hello welcome...nala"</span></code> instantly.
</p>
</div>
</div>

<div id="outline-container-orge6737cd" class="outline-3">
<h3 id="orge6737cd"><span class="section-number-3">24.4.</span> Websocket APIs</h3>
<div class="outline-text-3" id="text-24-4">
<p>
<b>NOTE: The Websocket is in a very preliminary stage. It only support echo.</b>
</p>
</div>

<div id="outline-container-org8e45583" class="outline-4">
<h4 id="org8e45583"><span class="section-number-4">24.4.1.</span> Websocket configuration</h4>
<div class="outline-text-4" id="text-24-4-1">
<div class="org-src-container">
<pre class="src src-scheme"><span style="font-weight: bold;">#:websocket</span> `(proto ,protocol_name)
</pre>
</div>
<p>
<b>protocol_name</b> can be:
</p>
<ul class="org-ul">
<li><p>
<b>'echo</b> for a simple echo test.
<b>NOTE:</b> More protocols will be added in the future.
</p>

<div class="org-src-container">
<pre class="src src-scheme"><span style="font-weight: bold;">#:websocket</span> simple_pattern
</pre>
</div>
<p>
<b>simple_pattern</b> can be:
</p>
<ul class="org-ul">
<li><b>#t</b> or <b>'raw</b> will enable a WebSocket on this URL without specifying the protocol.
So you will get the raw data from the decoded payload.</li>
</ul>

<div class="org-src-container">
<pre class="src src-scheme"><span style="font-weight: bold;">#:websocket</span> `(redirect ,ip/usk)
</pre>
</div>
<p>
This is used for redirecting a Websocket stream to another address.
ip/usk is an ip or a unix-socket. The string regexp pattern has to match:
</p>
<ul class="org-ul">
<li><code class="src src-scheme">^ip://(?:[0-9]{1,3}\\.){3}[0-9]{1,3}(:[0-9]{1,5})?$</code></li>
<li><code class="src src-scheme">^unix://[a-zA-Z-_0-9]+\\.socket$</code></li>
</ul>

<div class="org-src-container">
<pre class="src src-scheme"><span style="font-weight: bold;">#:websocket</span> `(proxy ,protocol)
</pre>
</div>
<p>
Setup a proxy with a specific protocol handler.
Unlike the regular proxy approach, the proxy in Artanis doesn't
need a listening port. Since it's always 80/443 or a custom port.
The client has to have websocket support. And be able to access the specified URL
to establish a websocket connection. The rest is the same as with a regular proxy.
</p></li>
</ul>
</div>
</div>

<div id="outline-container-org5c604ca" class="outline-4">
<h4 id="org5c604ca"><span class="section-number-4">24.4.2.</span> Websocket application</h4>
<div class="outline-text-4" id="text-24-4-2">
<div class="org-src-container">
<pre class="src src-scheme">(<span style="font-weight: bold;">:websocket</span> <span style="color: #00ffff;">&lt;route-context&gt;</span> command)
</pre>
</div>
<p>
<b>command</b> can be:
</p>
<ul class="org-ul">
<li><b>'payload</b> to get the decoded data from the client. It's decoded from Websocket frame automatically.
So you don't have to parse the frame.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org78927d6" class="outline-3">
<h3 id="org78927d6"><span class="section-number-3">24.5.</span> Websocket frame</h3>
<div class="outline-text-3" id="text-24-5">
<p>
GNU Artanis provides a Websocket data frame struct, as defined in <a href="https://tools.ietf.org/html/rfc6455">RFC6455</a>.
</p>

<p>
The frame will not be decoded or parsed into a record-type, but will be kept as the binary
frame read from the client, and use bitwise operations to fetch fields.
This kind of `lazy' design saves much time as it doesn't parse unused fields, and makes
it easier to redirect without any serialization.
If users want to get a certain field, Artanis provides APIs for fetching them.
Users can decide how to parse the frames by themselves, which we think is more efficient.
</p>

<p>
Here are the APIs you can use:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(websocket-frame? <span style="color: #00ffff;">&lt;websocket-frame&gt;</span>)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #66cdaa;">;; </span><span style="color: #66cdaa;">parser: bytevector -&gt; custom data frame</span>
(websocket-frame-parser <span style="color: #00ffff;">&lt;websocket-frame&gt;</span>)
</pre>
</div>

<p>
<b>websocket-frame-parser</b> is the registered reader for the protocol specified by the
<code class="src src-scheme"><span style="font-weight: bold;">#:websocket</span></code> configuration. The protocol is customizable based on protobuf.
<i>NOTE: Custom protocols support hasn't been implemented yet.</i>
</p>

<div class="org-src-container">
<pre class="src src-scheme">(websocket-frame-head <span style="color: #00ffff;">&lt;websocket-frame&gt;</span>)
(websocket-frame-final-fragment? <span style="color: #00ffff;">&lt;websocket-frame&gt;</span>)
(websocket-frame-opcode <span style="color: #00ffff;">&lt;websocket-frame&gt;</span>)
(websocket-frame-payload <span style="color: #00ffff;">&lt;websocket-frame&gt;</span>)
(websocket-frame-mask <span style="color: #00ffff;">&lt;websocket-frame&gt;</span>)
</pre>
</div>
<p>
To get the Websocket frame information. See <a href="https://tools.ietf.org/html/rfc6455#page-27">Data framing</a> for details.
</p>
<ul class="org-ul">
<li><b>head</b> returns the first 2 bytes in the data frame.</li>
<li><b>final-fragment</b> returns true if it's the last frame in a session.</li>
<li><b>opcode</b> returns the opcode in the frame. Refer to <a href="#org5addbcd">Websocket opcode</a>.</li>
<li><b>payload</b> returns the actual encoded data.</li>
<li><b>mask</b> returns the frame mask.</li>
</ul>
</div>
</div>
