docs/manual.org
** Websocket opcode

Opcode defines the interpretation of "Payload data". If an unknown opcode is received,
the receiving endpoint's WebSocket connection will fail.

#+BEGIN_SRC scheme
;;  check if it's a continuation frame
(is-continue-frame? opcode)

;;  check if it's text frame
(is-text-frame? opcode)

;; check if it's binary frame
(is-binary-frame? opcode)

;; check if it's control frame
(is-control-frame? opcode)
(is-non-control-frame? opcode)

;;  websocket requires closing
(is-close-frame? opcode)

;;  check if it's a ping frame
(is-ping-frame? opcode)

;;  check if it's a pong frame
(is-pong-frame? opcode)

;;  %xB-F are reserved for further control frames
(is-reserved-frame? opcode)

#+END_SRC
** Websocket authentication
The Websocket authentication hasn't been unsupported yet.
* Ragnarok server core
** Ragnarok introduction
Since version 0.2, GNU Artanis has started to use a strong server core for high concurrency.
Its name is Ragnarok.
In the philosophy of the design of GNU Artanis, everything is meant to be flexible and customizable.
The server core is no exception. In case Ragnarok doesn't suit your needs, you're free to use something else.

Ragnarok doesn't use any popular library for handling events (libev/libuv etc ...).
It's a brand new server core based on epoll and [[https://en.wikipedia.org/wiki/Delimited_continuation][delimited continuations]].

** Principles
A basic characteristic of Ragnarok is the use of co-routines. These co-routines are implemented with [[https://en.wikipedia.org/wiki/Delimited_continuation][delimited continuations]].
There are no OS/kernel controlled threads, like pthread, for scheduling /request-handlers/ in Ragnarok.
All the tasks are scheduled by a userland scheduler. And the task is nothing but just a special continuation.
The key difference between this and a regular [[https://en.wikipedia.org/wiki/Call-with-current-continuation#Criticism][full-stack continuation]], is that you can set
limits with precision, instead of having to capture the whole stack.

For researchers, there is a paper published on [[http://www.schemeworkshop.org/2016/][ICFP Scheme Workshop 2016 conference]] to explain the principle and
the design of GNU Artanis:

[[https://github.com/NalaGinrut/artanis/raw/gh-pages/research/scheme16/art2016.pdf][Multi-purpose web framework design based on websockets over HTTP Gateway]].

(to be continued ...)

** Features
In Artanis, the request handling can be scheduled even when the socket buffer is full (depends on src_conf[:exports code]{server.bufsize}).
And let other handlers deal with the requests. Just like the scheduling of an OS, but in userland.

If you have issues with the buffer when scheduling, there's no way to flush before it breaks,
since we can't tell if the scheduling is caused by the buffering or the blocking.

Ragnarok takes advantage of src_conf[:exports code]{SO_REUSEPORT} introduced in GNU/Linux 3.9 to provide a feature
named src_conf[:exports code]{server.multi} which can be enabled in the config. This feature allows users to start several
Artanis instances listening to the same port, to take advantage of multi core CPUs, and the Linux Kernel managing the events.

(to be continued ...)

** Ragnarok APIs
You can use these APIs to customize your own server core.

(to be continued ...)
* Key-Value Database
** LPC
LPC stands for Lightweight Persistent Cache. It's the easiest way to use key-value DB in Artanis.

For example:
#+BEGIN_SRC scheme
(get "/certain_rule" #:lpc <backend> (lambda (rc) ...))
#+END_SRC

The backend includes:
- src_scheme[:exports code]{#t} or src_scheme[:exports code]{'redis}
- src_scheme[:exports code]{'json}

After configured, it's easy to use it:
#+BEGIN_SRC scheme
;; Setter
(:lpc rc 'set <key> <val>)

;; Getter
(:lpc rc 'get <key>)
;; or
(:lpc rc 'ref <key>)
#+END_SRC

In default, the key will be prefixed automatically:
#+BEGIN_SRC scheme
(string-append "__artanis_lpc_" (get-conf '(db name)) "_" key)
#+END_SRC

* I18n
i18n stands for internationalization, which is a process of designing a software application so that it can be adapted to various languages and regions without engineering changes.

** Basic API to get language set from client
There're three basic APIs for i18n in GNU Artanis:

*** I18n from URL
#+BEGIN_SRC scheme
(get "/index/:lang"
  #:i18n "lang"
  (lamba (rc) ...))
#+END_SRC

- If the key in the URL is src_scheme[:exports code]{":my_lang"}, then you should configure it as src_scheme[:exports code]{"#:i18n my_lang"}.

*** I18n from cookie
#+BEGIN_SRC scheme
(get "/index"
  #:i18n '(cookie "lang")
  (lambda (rc) ...))
#+END_SRC

- If the key in the cookie is src_scheme[:exports code]{"my_lang"}, then you should configure it as src_scheme[:exports code]{#:i18n '(cookie "my_lang")}.

*** I18n from HTTP header
#+BEGIN_SRC scheme
(get "/index"
  #:i18n 'header
  (lambda (rc) ...))
#+END_SRC

- The language set in the HTTP header is src_scheme[:exports code]{"Accept-Language"}.
- If there's multiple languages, GNU Artanis will choose the first one.
- Note that the language is in the format of RFC 4646 (e.g. ja-JP) GNU Artanis will convert it to the format of GNU Gettext (e.g. ja_JP).

** Translation mode

*** With GNU Gettext
#+BEGIN_SRC conf
session.i18n = locale
#+END_SRC

You must put related translation into **sys/i18n/locale** directory. The directory structure should be like this: src_scheme[:exports code](lang_COUNTRY/LC_MESSAGES/domain.mo).

About PO and MO files, please read [[https://www.gnu.org/software/gettext/manual/html_node/index.html#SEC_Contents][GNU Gettext's manual]].

*** With JSON
#+BEGIN_SRC conf
session.i18n = json
#+END_SRC

You must put related translation into **sys/i18n/json** directory. The directory structure should be like this: src_scheme[:exports code](lang_COUNTRY.json).

*** With SXML

#+BEGIN_SRC conf
session.i18n = sxml
#+END_SRC

You must put related translation into **sys/i18n/sxml** directory. The directory structure should be like this: src_scheme[:exports code](lang_COUNTRY.scm).

** I18n best practice

Please read GNU Artanis blog post about [[https://artanis.dev/blog/how-to-make-i18n-properly.html][how to make i18n properly]].

* Utils
*The functions listed below require the [[https://gitlab.com/NalaGinrut/artanis/blob/master/artanis/utils.scm][(artanis utils)]] module.*
