docs/manual.html

<div id="outline-container-org5addbcd" class="outline-3">
<h3 id="org5addbcd"><span class="section-number-3">24.6.</span> Websocket opcode</h3>
<div class="outline-text-3" id="text-24-6">
<p>
Opcode defines the interpretation of "Payload data". If an unknown opcode is received,
the receiving endpoint's WebSocket connection will fail.
</p>

<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #66cdaa;">;;  </span><span style="color: #66cdaa;">check if it's a continuation frame</span>
(is-continue-frame? opcode)

<span style="color: #66cdaa;">;;  </span><span style="color: #66cdaa;">check if it's text frame</span>
(is-text-frame? opcode)

<span style="color: #66cdaa;">;; </span><span style="color: #66cdaa;">check if it's binary frame</span>
(is-binary-frame? opcode)

<span style="color: #66cdaa;">;; </span><span style="color: #66cdaa;">check if it's control frame</span>
(is-control-frame? opcode)
(is-non-control-frame? opcode)

<span style="color: #66cdaa;">;;  </span><span style="color: #66cdaa;">websocket requires closing</span>
(is-close-frame? opcode)

<span style="color: #66cdaa;">;;  </span><span style="color: #66cdaa;">check if it's a ping frame</span>
(is-ping-frame? opcode)

<span style="color: #66cdaa;">;;  </span><span style="color: #66cdaa;">check if it's a pong frame</span>
(is-pong-frame? opcode)

<span style="color: #66cdaa;">;;  </span><span style="color: #66cdaa;">%xB-F are reserved for further control frames</span>
(is-reserved-frame? opcode)

</pre>
</div>
</div>
</div>
<div id="outline-container-orgb415ea3" class="outline-3">
<h3 id="orgb415ea3"><span class="section-number-3">24.7.</span> Websocket authentication</h3>
<div class="outline-text-3" id="text-24-7">
<p>
The Websocket authentication hasn't been unsupported yet.
</p>
</div>
</div>
</div>
<div id="outline-container-org0823621" class="outline-2">
<h2 id="org0823621"><span class="section-number-2">25.</span> Ragnarok server core</h2>
<div class="outline-text-2" id="text-25">
</div>
<div id="outline-container-org3e7660b" class="outline-3">
<h3 id="org3e7660b"><span class="section-number-3">25.1.</span> Ragnarok introduction</h3>
<div class="outline-text-3" id="text-25-1">
<p>
Since version 0.2, GNU Artanis has started to use a strong server core for high concurrency.
Its name is Ragnarok.
In the philosophy of the design of GNU Artanis, everything is meant to be flexible and customizable.
The server core is no exception. In case Ragnarok doesn't suit your needs, you're free to use something else.
</p>

<p>
Ragnarok doesn't use any popular library for handling events (libev/libuv etc &#x2026;).
It's a brand new server core based on epoll and <a href="https://en.wikipedia.org/wiki/Delimited_continuation">delimited continuations</a>.
</p>
</div>
</div>

<div id="outline-container-org61783da" class="outline-3">
<h3 id="org61783da"><span class="section-number-3">25.2.</span> Principles</h3>
<div class="outline-text-3" id="text-25-2">
<p>
A basic characteristic of Ragnarok is the use of co-routines. These co-routines are implemented with <a href="https://en.wikipedia.org/wiki/Delimited_continuation">delimited continuations</a>.
There are no OS/kernel controlled threads, like pthread, for scheduling <i>request-handlers</i> in Ragnarok.
All the tasks are scheduled by a userland scheduler. And the task is nothing but just a special continuation.
The key difference between this and a regular <a href="https://en.wikipedia.org/wiki/Call-with-current-continuation#Criticism">full-stack continuation</a>, is that you can set
limits with precision, instead of having to capture the whole stack.
</p>

<p>
For researchers, there is a paper published on <a href="http://www.schemeworkshop.org/2016/">ICFP Scheme Workshop 2016 conference</a> to explain the principle and
the design of GNU Artanis:
</p>

<p>
<a href="https://github.com/NalaGinrut/artanis/raw/gh-pages/research/scheme16/art2016.pdf">Multi-purpose web framework design based on websockets over HTTP Gateway</a>.
</p>

<p>
(to be continued &#x2026;)
</p>
</div>
</div>

<div id="outline-container-org1a7b18a" class="outline-3">
<h3 id="org1a7b18a"><span class="section-number-3">25.3.</span> Features</h3>
<div class="outline-text-3" id="text-25-3">
<p>
In Artanis, the request handling can be scheduled even when the socket buffer is full (depends on <code class="src src-conf">server.bufsize</code>).
And let other handlers deal with the requests. Just like the scheduling of an OS, but in userland.
</p>

<p>
If you have issues with the buffer when scheduling, there's no way to flush before it breaks,
since we can't tell if the scheduling is caused by the buffering or the blocking.
</p>

<p>
Ragnarok takes advantage of <code class="src src-conf">SO_REUSEPORT</code> introduced in GNU/Linux 3.9 to provide a feature
named <code class="src src-conf">server.multi</code> which can be enabled in the config. This feature allows users to start several
Artanis instances listening to the same port, to take advantage of multi core CPUs, and the Linux Kernel managing the events.
</p>

<p>
(to be continued &#x2026;)
</p>
</div>
</div>

<div id="outline-container-orgec80dcb" class="outline-3">
<h3 id="orgec80dcb"><span class="section-number-3">25.4.</span> Ragnarok APIs</h3>
<div class="outline-text-3" id="text-25-4">
<p>
You can use these APIs to customize your own server core.
</p>

<p>
(to be continued &#x2026;)
</p>
</div>
</div>
</div>
<div id="outline-container-orgc1ff8a6" class="outline-2">
<h2 id="orgc1ff8a6"><span class="section-number-2">26.</span> Key-Value Database</h2>
<div class="outline-text-2" id="text-26">
</div>
<div id="outline-container-orgdaab97c" class="outline-3">
<h3 id="orgdaab97c"><span class="section-number-3">26.1.</span> LPC</h3>
<div class="outline-text-3" id="text-26-1">
<p>
LPC stands for Lightweight Persistent Cache. It's the easiest way to use key-value DB in Artanis.
</p>

<p>
For example:
</p>
<div class="org-src-container">
<pre class="src src-scheme">(get <span style="color: #ff0000;">"/certain_rule"</span> <span style="font-weight: bold;">#:lpc</span> <span style="color: #00ffff;">&lt;backend&gt;</span> (<span style="color: #4169e1;">lambda</span> (rc) ...))
</pre>
</div>

<p>
The backend includes:
</p>
<ul class="org-ul">
<li><code class="src src-scheme">#t</code> or <code class="src src-scheme">'redis</code></li>
<li><code class="src src-scheme">'json</code></li>
</ul>

<p>
After configured, it's easy to use it:
</p>
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #66cdaa;">;; </span><span style="color: #66cdaa;">Setter</span>
(<span style="font-weight: bold;">:lpc</span> rc 'set <span style="color: #00ffff;">&lt;key&gt;</span> <span style="color: #00ffff;">&lt;val&gt;</span>)

<span style="color: #66cdaa;">;; </span><span style="color: #66cdaa;">Getter</span>
(<span style="font-weight: bold;">:lpc</span> rc 'get <span style="color: #00ffff;">&lt;key&gt;</span>)
<span style="color: #66cdaa;">;; </span><span style="color: #66cdaa;">or</span>
(<span style="font-weight: bold;">:lpc</span> rc 'ref <span style="color: #00ffff;">&lt;key&gt;</span>)
</pre>
</div>

<p>
In default, the key will be prefixed automatically:
</p>
<div class="org-src-container">
<pre class="src src-scheme">(string-append <span style="color: #ff0000;">"__artanis_lpc_"</span> (get-conf '(db name)) <span style="color: #ff0000;">"_"</span> key)
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org962d52c" class="outline-2">
<h2 id="org962d52c"><span class="section-number-2">27.</span> Utils</h2>
<div class="outline-text-2" id="text-27">
<p>
<b>The functions listed below require the <a href="https://gitlab.com/NalaGinrut/artanis/blob/master/artanis/utils.scm">(artanis utils)</a> module.</b>
</p>
</div>
