docs/manual.org
** String Template
GNU Artanis provides Python3-like template strings:
#+begin_src scheme
(make-string-template tpl . vals)
#+end_src

+ *tpl* stands for template string.
+ *vals* is varg-list specifying default value to certain key.

For example:
#+begin_src scheme
(define st (make-string-template "hello ${name}"))
(st #:name "nala")
;; ==> "hello nala"

;; or you may specify a default value for ${name}
(define st (make-string-template "hello ${name}" #:name "unknown"))
(st)
;; ==> "hello unknown"
(st #:name "john")
;; ==> "hello john"
#+end_src
** Random String Generator
Get random string from =/dev/urandom=.
#+begin_src scheme
(get-random-from-dev #:length 8 #:uppercase #f)
#+end_src
** Cryptographic hash functions
#+begin_src scheme
;; hash a string with MD5
(string->md5 str)
;; hash a string with SHA-1
(string->sha-1 str)
#+end_src

SHA-2 hash functions are also supported from Artanis-0.2.5.
#+BEGIN_SRC scheme
(string->sha-224 str)
(string->sha-384 str)
(string->sha-512 str)
#+END_SRC

** Stack & Queue
GNU Artanis provides simple interfaces for stack & queue:
#+begin_src scheme
;; stack operations
(new-stack)
(stack-pop! stk)
(stack-push! stk elem)
(stack-top stk)
(stack-remove! stk key)
(stack-empty? stk)

;; queue operations
(new-queue)
(queue-out! q)
(queue-in! q elem)
(queue-head q)
(queue-tail q)
(queue-remove! q key)
(queue-empty? q)
#+end_src
** Useful string operation
If you want to get all the contents from a file into a string,
then don't use src_conf[:exports code]{get-string-all} imported from rnrs. Because it
will not detect the correct charset from the locale, and this may cause the length differ
from the actual value. Although GNU Artanis can handle this length issue properly, you
should use src_conf[:exports code]{get-string-all-with-detected-charset} when you need
to do something like this. If you don't care about the contents encoding but just want
to get the them, it's better to use src_conf[:exports code]{get-bytevector-all} imported
from rnrs.
#+begin_src scheme
(get-string-all-with-detected-charset filename)
#+end_src
** Time operation tool
TODO

* Debug mode
GNU Artanis provides a debug-mode for a more convenient way to debug. It's very easy to use.

For the simplest way, pass src_scheme[:exports code]{#:debug #t} when calling src_scheme[:exports code]{run} function:
#+BEGIN_SRC scheme
(run #:debug #t)
#+END_SRC

If you are using the MVC system, or created a project directory, just pass --debug or -g to art:
#+BEGIN_SRC scheme
# In the project directory
art work --debug
# Or
art work -g
#+END_SRC

When you enable debug-mode, the Model and Controller modules in the directory  will be reloaded automatically every time they're called.

When */not/* in debug mode, you have to press Ctrl+C to quit GNU Artanis server and start it again to test changed modules. Debug mode saves time when testing.

You can add paths to monitor certain files (for example, a JSON file as config file to be reloaded on the fly).
If you want to be notified when they're changed. Just put
the paths here:
#+BEGIN_SRC conf
debug.monitor = my/lib/json, my/lib/modules
#+END_SRC


