docs/manual.html
<div id="outline-container-org5923817" class="outline-3">
<h3 id="org5923817"><span class="section-number-3">27.1.</span> String Template</h3>
<div class="outline-text-3" id="text-27-1">
<p>
GNU Artanis provides Python3-like template strings:
</p>
<div class="org-src-container">
<pre class="src src-scheme">(make-string-template tpl . vals)
</pre>
</div>

<ul class="org-ul">
<li><b>tpl</b> stands for template string.</li>
<li><b>vals</b> is varg-list specifying default value to certain key.</li>
</ul>

<p>
For example:
</p>
<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #4169e1;">define</span> <span style="color: #ffd700;">st</span> (make-string-template <span style="color: #ff0000;">"hello ${name}"</span>))
(st <span style="font-weight: bold;">#:name</span> <span style="color: #ff0000;">"nala"</span>)
<span style="color: #66cdaa;">;; </span><span style="color: #66cdaa;">==&gt; "hello nala"</span>

<span style="color: #66cdaa;">;; </span><span style="color: #66cdaa;">or you may specify a default value for ${name}</span>
(<span style="color: #4169e1;">define</span> <span style="color: #ffd700;">st</span> (make-string-template <span style="color: #ff0000;">"hello ${name}"</span> <span style="font-weight: bold;">#:name</span> <span style="color: #ff0000;">"unknown"</span>))
(st)
<span style="color: #66cdaa;">;; </span><span style="color: #66cdaa;">==&gt; "hello unknown"</span>
(st <span style="font-weight: bold;">#:name</span> <span style="color: #ff0000;">"john"</span>)
<span style="color: #66cdaa;">;; </span><span style="color: #66cdaa;">==&gt; "hello john"</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org0295962" class="outline-3">
<h3 id="org0295962"><span class="section-number-3">27.2.</span> Random String Generator</h3>
<div class="outline-text-3" id="text-27-2">
<p>
Get random string from <code>/dev/urandom</code>.
</p>
<div class="org-src-container">
<pre class="src src-scheme">(get-random-from-dev <span style="font-weight: bold;">#:length</span> 8 <span style="font-weight: bold;">#:uppercase</span> #f)
</pre>
</div>
</div>
</div>
<div id="outline-container-orgf80fe5c" class="outline-3">
<h3 id="orgf80fe5c"><span class="section-number-3">27.3.</span> Cryptographic hash functions</h3>
<div class="outline-text-3" id="text-27-3">
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #66cdaa;">;; </span><span style="color: #66cdaa;">hash a string with MD5</span>
(string-&gt;md5 str)
<span style="color: #66cdaa;">;; </span><span style="color: #66cdaa;">hash a string with SHA-1</span>
(string-&gt;sha-1 str)
</pre>
</div>

<p>
SHA-2 hash functions are also supported from Artanis-0.2.5.
</p>
<div class="org-src-container">
<pre class="src src-scheme">(string-&gt;sha-224 str)
(string-&gt;sha-384 str)
(string-&gt;sha-512 str)
</pre>
</div>
</div>
</div>

<div id="outline-container-org1bc0ceb" class="outline-3">
<h3 id="org1bc0ceb"><span class="section-number-3">27.4.</span> Stack &amp; Queue</h3>
<div class="outline-text-3" id="text-27-4">
<p>
GNU Artanis provides simple interfaces for stack &amp; queue:
</p>
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #66cdaa;">;; </span><span style="color: #66cdaa;">stack operations</span>
(new-stack)
(stack-pop! stk)
(stack-push! stk elem)
(stack-top stk)
(stack-remove! stk key)
(stack-empty? stk)

<span style="color: #66cdaa;">;; </span><span style="color: #66cdaa;">queue operations</span>
(new-queue)
(queue-out! q)
(queue-in! q elem)
(queue-head q)
(queue-tail q)
(queue-remove! q key)
(queue-empty? q)
</pre>
</div>
</div>
</div>
<div id="outline-container-orge9dd677" class="outline-3">
<h3 id="orge9dd677"><span class="section-number-3">27.5.</span> Useful string operation</h3>
<div class="outline-text-3" id="text-27-5">
<p>
If you want to get all the contents from a file into a string,
then don't use <code class="src src-conf">get-string-all</code> imported from rnrs. Because it
will not detect the correct charset from the locale, and this may cause the length differ
from the actual value. Although GNU Artanis can handle this length issue properly, you
should use <code class="src src-conf">get-string-all-with-detected-charset</code> when you need
to do something like this. If you don't care about the contents encoding but just want
to get the them, it's better to use <code class="src src-conf">get-bytevector-all</code> imported
from rnrs.
</p>
<div class="org-src-container">
<pre class="src src-scheme">(get-string-all-with-detected-charset filename)
</pre>
</div>
</div>
</div>
<div id="outline-container-org55ffd20" class="outline-3">
<h3 id="org55ffd20"><span class="section-number-3">27.6.</span> Time operation tool</h3>
<div class="outline-text-3" id="text-27-6">
<p>
TODO
</p>
</div>
</div>
</div>

<div id="outline-container-org72813ff" class="outline-2">
<h2 id="org72813ff"><span class="section-number-2">28.</span> Debug mode</h2>
<div class="outline-text-2" id="text-28">
<p>
GNU Artanis provides a debug-mode for a more convenient way to debug. It's very easy to use.
</p>

<p>
For the simplest way, pass <code class="src src-scheme"><span style="font-weight: bold;">#:debug</span> #t</code> when calling <code class="src src-scheme">run</code> function:
</p>
<div class="org-src-container">
<pre class="src src-scheme">(run <span style="font-weight: bold;">#:debug</span> #t)
</pre>
</div>

<p>
If you are using the MVC system, or created a project directory, just pass &#x2013;debug or -g to art:
</p>
<div class="org-src-container">
<pre class="src src-scheme"># In the project directory
art work --debug
# Or
art work -g
</pre>
</div>

<p>
When you enable debug-mode, the Model and Controller modules in the directory  will be reloaded automatically every time they're called.
</p>

<p>
When <b><i>not</i></b> in debug mode, you have to press Ctrl+C to quit GNU Artanis server and start it again to test changed modules. Debug mode saves time when testing.
</p>

<p>
You can add paths to monitor certain files (for example, a JSON file as config file to be reloaded on the fly).
If you want to be notified when they're changed. Just put
the paths here:
</p>
<div class="org-src-container">
<pre class="src src-conf"><span style="color: #00ff00;">debug.monitor</span> = my/lib/json, my/lib/modules
</pre>
</div>
</div>
</div>
